/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2010 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 

/** @file
 *
 *  ADEC register details. ( used only within kdriver )
 *
 *  author     Jong-Sang Oh(jongsang.oh@lge.com)
 *  version    4.00
 *  date       2012.12.07
 *
 */

#ifndef _ADEC_REG_L9_H_
#define _ADEC_REG_L9_H_

/*----------------------------------------------------------------------------------------
    Control Constants
----------------------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------------------
    File Inclusions
----------------------------------------------------------------------------------------*/


#ifdef __cplusplus
extern "C" {
#endif

/*-----------------------------------------------------------------------------
	0x0000 hpi0ram ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0100 hpi1ram ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0200 aud_int0_id ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0204 aud_int0_clr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0208 aud_int0_en ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x020c aud_int1_id ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0210 aud_int1_clr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0214 aud_int1_en ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0218 aud_runstall0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_runstall0                   : 1;	//     0
} AUD_RUNSTALL0;

/*-----------------------------------------------------------------------------
	0x021c aud_runstall1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_runstall1                   : 1;	//     0
} AUD_RUNSTALL1;

/*-----------------------------------------------------------------------------
	0x0220 aud_statvecsel0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_statvecsel0                 : 1;	//     0
} AUD_STATVECSEL0;

/*-----------------------------------------------------------------------------
	0x0224 aud_statvecsel1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_statvecsel1                 : 1;	//     0
} AUD_STATVECSEL1;

/*-----------------------------------------------------------------------------
	0x0228 aud_pwaitmode0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_pwaitmode0                  : 1;	//     0
} AUD_PWAITMODE0;

/*-----------------------------------------------------------------------------
	0x022c aud_pwaitmode1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_pwaitmode1                  : 1;	//     0
} AUD_PWAITMODE1;

/*-----------------------------------------------------------------------------
	0x0230 aud_dsp0prid ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0234 aud_dsp1prid ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0238 aud_swreset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aresetout                       : 1,	//     0
	apbresetout                     : 1,	//     1
	aversetout                      : 1,	//     2
	veresetout                      : 1,	//     3
	fs20resetout                    : 1,	//     4
	fs21resetout                    : 1,	//     5
	                                : 1,	//     6 reserved
	fs23resetout                    : 1,	//     7
	fs24resetout                    : 1,	//     8
	asrcrstout                      : 1,	//     9
	dsp0ocdresetout                 : 1,	//    10
	dsp1ocdresetout                 : 1,	//    11
	dsp0bresetout                   : 1,	//    12
	dsp1bresetout                   : 1,	//    13
	aadresetout                     : 1,	//    14
	aadapbresetout                  : 1,	//    15
	                                : 5,	// 16:20 reserved
	fs25resetout                    : 1;	//    21
} AUD_SWRESET;

/*-----------------------------------------------------------------------------
	0x023c aud_mon_sel ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0240 aud_dirq0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_dirq0                       : 1;	//     0
} AUD_DIRQ0;

/*-----------------------------------------------------------------------------
	0x0244 aud_dirq1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_dirq1                       : 1;	//     0
} AUD_DIRQ1;

/*-----------------------------------------------------------------------------
	0x0248 aud_debugen0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_debugen0                    : 1;	//     0
} AUD_DEBUGEN0;

/*-----------------------------------------------------------------------------
	0x024c aud_debugen1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_debugen1                    : 1;	//     0
} AUD_DEBUGEN1;

/*-----------------------------------------------------------------------------
	0x0250 aud_nmiint0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_nmiint0                     : 1;	//     0
} AUD_NMIINT0;

/*-----------------------------------------------------------------------------
	0x0254 aud_mmiint1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_mmiint1                     : 1;	//     0
} AUD_MMIINT1;

/*-----------------------------------------------------------------------------
	0x0258 aud_xocdmode0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_xocdmode0                   : 1;	//     0
} AUD_XOCDMODE0;

/*-----------------------------------------------------------------------------
	0x025c aud_xocdmode1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_xocdmode1                   : 1;	//     0
} AUD_XOCDMODE1;

/*-----------------------------------------------------------------------------
	0x0260 aud_debugdata0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0264 aud_debugdata1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0268 aud_debugpc0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x026c aud_debugpc1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0270 aud_debugstat0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0274 aud_debugstat1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0278 aud_gstcchreg ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_gstcchreg                   : 1;	//     0
} AUD_GSTCCHREG;

/*-----------------------------------------------------------------------------
	0x027c aud_gstcclreg ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0280 aud_dsp0offset0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0284 aud_dsp0offset1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0288 aud_dsp0offset2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x028c aud_dsp0offset3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0290 aud_dsp0offset4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0294 aud_dsp0offset5 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0298 aud_dsp0offset6 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x029c aud_dsp0offset7 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02a0 aud_dsp1offset0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02a4 aud_dsp1offset1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02a8 aud_dsp1offset2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02ac aud_dsp1offset3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02b0 aud_dsp1offset4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02b4 aud_dsp1offset5 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02b8 aud_dsp1offset6 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02bc aud_dsp1offset7 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02c0 memtab0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02c4 memtab1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02c8 memtab2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02cc memtab3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02d0 memtab4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02d4 memtab5 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02d8 aud_dsp0offset61 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02dc aud_dsp1offset61 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x02e0 aud_override ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	aud_override                    : 2;	//  0: 1
} AUD_OVERRIDE;

/*-----------------------------------------------------------------------------
	0x0300 aud_mem_share_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0304 aud_mem_dsp0_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0308 aud_mem_dsp1_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x030c aud_mem_cpbm_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0310 aud_mem_cpbm_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0314 aud_mem_cpba_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0318 aud_mem_cpba_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x031c aud_mem_mpb0_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0320 aud_mem_mpb0_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0324 aud_mem_dpbm_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0328 aud_mem_dpbm_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x032c aud_mem_dpba_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0330 aud_mem_dpba_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0334 aud_mem_iec_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0338 aud_mem_iec_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x033c aud_mem_enc_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0340 aud_mem_enc_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0344 aud_mem_buf_stat0_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0348 aud_mem_buf_stat1_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x034c aud_mem_profile_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0350 aud_mem_se_param_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0354 aud_mem_ipc_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0358 aud_mem_ipc_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x035c aud_ipc_cmd_rptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0360 aud_ipc_cmd_wptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0364 aud_ipc_cmd_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0368 aud_ipc_cmd_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x036c aud_ipc_dbg_rptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0370 aud_ipc_dbg_wptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0374 aud_ipc_dbg_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0378 aud_ipc_dbg_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x037c aud_ipc_req_rptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0380 aud_ipc_req_wptr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0384 aud_ipc_req_base ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0388 aud_ipc_req_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x038c aud_sai_gain ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sai_volgain                     :28,	//  0:27
	check_bit                       : 4;	// 28:31
} AUD_SAI_GAIN;

/*-----------------------------------------------------------------------------
	0x0390 aud_set_inout ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pcm_bit                         : 2,	//  0: 1
	sck_pol_ctrl                    : 1,	//     2
	lrck_pol_ctrl                   : 1,	//     3
	i2s_format                      : 2,	//  4: 5
	i2s_sck_mode                    : 1,	//     6
	i2s_ms_mode                     : 1,	//     7
	chip_type                       : 8,	//  8:15
	                                : 4,	// 16:19 reserved
	in_res                          : 4,	// 20:23
	in_cap                          : 1,	//    24
	in_lr_sel                       : 1,	//    25
	in_format                       : 2,	// 26:27
	scart_out_ctrl                  : 2,	// 28:29
	spdif_mode                      : 1,	//    30
	check_bit                       : 1;	//    31
} AUD_SET_INOUT;

/*-----------------------------------------------------------------------------
	0x0394 aud_dsp1_dbg_mask ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	not_def_enable                  : 1,	//     0
	ipc_enable                      : 1,	//     1
	ipc_param_enable                : 1,	//     2
	codec_enable                    : 1,	//     3
	mix_enable                      : 1,	//     4
	mix_state_enable                : 1,	//     5
	manager_enable                  : 1,	//     6
	scheduler_enable                : 1,	//     7
	src_enable                      : 1,	//     8
	lip_sync_enable                 : 1;	//     9
} AUD_DSP1_DBG_MASK;

/*-----------------------------------------------------------------------------
	0x039c aud_mpb0_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_MPB0_WO;

/*-----------------------------------------------------------------------------
	0x03a0 aud_mpb0_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_MPB0_RO;

/*-----------------------------------------------------------------------------
	0x03a4 aud_mpb0_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_MPB0_WI;

/*-----------------------------------------------------------------------------
	0x03a8 aud_mpb0_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_MPB0_RI;

/*-----------------------------------------------------------------------------
	0x03ac aud_cpb1_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_CPB1_WO;

/*-----------------------------------------------------------------------------
	0x03b0 aud_cpb1_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_CPB1_RO;

/*-----------------------------------------------------------------------------
	0x03b4 aud_cpb1_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_CPB1_WI;

/*-----------------------------------------------------------------------------
	0x03b8 aud_cpb1_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_CPB1_RI;

/*-----------------------------------------------------------------------------
	0x03bc aud_dpb1_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_DPB1_WO;

/*-----------------------------------------------------------------------------
	0x03c0 aud_dpb1_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_DPB1_RO;

/*-----------------------------------------------------------------------------
	0x03c4 aud_dpb1_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_DPB1_WI;

/*-----------------------------------------------------------------------------
	0x03c8 aud_dpb1_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_DPB1_RI;

/*-----------------------------------------------------------------------------
	0x03cc aud_cpb0_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_CPB0_WO;

/*-----------------------------------------------------------------------------
	0x03d0 aud_cpb0_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_CPB0_RO;

/*-----------------------------------------------------------------------------
	0x03d4 aud_cpb0_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_CPB0_WI;

/*-----------------------------------------------------------------------------
	0x03d8 aud_cpb0_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_CPB0_RI;

/*-----------------------------------------------------------------------------
	0x03dc aud_dpb0_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_DPB0_WO;

/*-----------------------------------------------------------------------------
	0x03e0 aud_dpb0_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_DPB0_RO;

/*-----------------------------------------------------------------------------
	0x03e4 aud_dpb0_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_DPB0_WI;

/*-----------------------------------------------------------------------------
	0x03e8 aud_dpb0_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_DPB0_RI;

/*-----------------------------------------------------------------------------
	0x03ec aud_iecbit_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_IECBIT_WO;

/*-----------------------------------------------------------------------------
	0x03f0 aud_iecbit_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_IECBIT_RO;

/*-----------------------------------------------------------------------------
	0x03f4 aud_iecbit_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_IECBIT_WI;

/*-----------------------------------------------------------------------------
	0x03f8 aud_iecbit_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_IECBIT_RI;

/*-----------------------------------------------------------------------------
	0x03fc aud_enc_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_ENC_WO;

/*-----------------------------------------------------------------------------
	0x0400 aud_enc_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_ENC_RO;

/*-----------------------------------------------------------------------------
	0x0404 aud_enc_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_ENC_WI;

/*-----------------------------------------------------------------------------
	0x0408 aud_enc_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_ENC_RI;

/*-----------------------------------------------------------------------------
	0x040c aud_codec_state ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	codec_state_0                   : 4,	//  0: 3
	codec_state_1                   : 4,	//  4: 7
	codec_state_enc                 : 4;	//  8:11
} AUD_CODEC_STATE;

/*-----------------------------------------------------------------------------
	0x0410 aud_codec_cmd ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cmd                             : 4,	//  0: 3
	codec_number                    : 4;	//  4: 7
} AUD_CODEC_CMD;

/*-----------------------------------------------------------------------------
	0x0414 aud_codec_ack ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cmd                             : 4,	//  0: 3
	codec_number                    : 4,	//  4: 7
	result                          : 8;	//  8:15
} AUD_CODEC_ACK;

/*-----------------------------------------------------------------------------
	0x0418 aud_codec_input ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	codec0_input                    : 4,	//  0: 3
	codec1_input                    : 4,	//  4: 7
	encoder_input                   : 4;	//  8:11
} AUD_CODEC_INPUT;

/*-----------------------------------------------------------------------------
	0x041c aud_codec_type ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	codec0_type                     : 8,	//  0: 7
	codec1_type                     : 8,	//  8:15
	encoder_type                    : 8;	// 16:23
} AUD_CODEC_TYPE;

/*-----------------------------------------------------------------------------
	0x0420 aud_dec0_param0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch_num                          : 8,	//  0: 7
	bit_num                         : 8,	//  8:15
	sfreq                           :12,	// 16:27
	check_bit                       : 4;	// 28:31
} AUD_DEC0_PARAM0;

/*-----------------------------------------------------------------------------
	0x0424 aud_dec0_param1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bitrate                         :16,	//  0:15
	                                :12,	// 16:27 reserved
	check_bit                       : 4;	// 28:31
} AUD_DEC0_PARAM1;

/*-----------------------------------------------------------------------------
	0x0428 aud_dec0_param2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	drc_mode                        : 4,	//  0: 3
	downmix_mode                    : 4;	//  4: 7
} AUD_DEC0_PARAM2;

/*-----------------------------------------------------------------------------
	0x042c aud_dec0_param3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fmttag                          :16,	//  0:15
	chmask                          :16;	// 16:31
} AUD_DEC0_PARAM3;

/*-----------------------------------------------------------------------------
	0x0430 aud_dec0_param4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	block_align                     :16,	//  0:15
	encode_opt                      :16;	// 16:31
} AUD_DEC0_PARAM4;

/*-----------------------------------------------------------------------------
	0x0434 aud_dec0_param5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	adv_en_opt                      :16,	//  0:15
	                                :11,	// 16:26 reserved
	check_bit                       : 5;	// 27:31
} AUD_DEC0_PARAM5;

/*-----------------------------------------------------------------------------
	0x0438 aud_dec0_param6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	adv_en_opt2_hi                  ;   	// 31: 0
} AUD_DEC0_PARAM6;

/*-----------------------------------------------------------------------------
	0x043c aud_dec0_param7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	adv_en_opt2_lo                  ;   	// 31: 0
} AUD_DEC0_PARAM7;

/*-----------------------------------------------------------------------------
	0x0440 aud_dec0_param8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	avgbps                          ;   	// 31: 0
} AUD_DEC0_PARAM8;

/*-----------------------------------------------------------------------------
	0x0448 aud_dec1_param0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch_num                          : 8,	//  0: 7
	bit_num                         : 8,	//  8:15
	sfreq                           :12,	// 16:27
	check_bit                       : 4;	// 28:31
} AUD_DEC1_PARAM0;

/*-----------------------------------------------------------------------------
	0x044c aud_dec1_param1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bitrate                         :16,	//  0:15
	                                :12,	// 16:27 reserved
	check_bit                       : 4;	// 28:31
} AUD_DEC1_PARAM1;

/*-----------------------------------------------------------------------------
	0x0450 aud_dec1_param2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	drc_mode                        : 4,	//  0: 3
	downmix_mode                    : 4;	//  4: 7
} AUD_DEC1_PARAM2;

/*-----------------------------------------------------------------------------
	0x0454 aud_dec1_param3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fmttag                          :16,	//  0:15
	chmask                          :16;	// 16:31
} AUD_DEC1_PARAM3;

/*-----------------------------------------------------------------------------
	0x0458 aud_dec1_param4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	block_align                     :16,	//  0:15
	encode_opt                      :16;	// 16:31
} AUD_DEC1_PARAM4;

/*-----------------------------------------------------------------------------
	0x045c aud_dec1_param5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	adv_en_opt                      :16,	//  0:15
	                                :11,	// 16:26 reserved
	check_bit                       : 5;	// 27:31
} AUD_DEC1_PARAM5;

/*-----------------------------------------------------------------------------
	0x0460 aud_dec1_param6 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	adv_en_opt2_hi                  ;   	// 31: 0
} AUD_DEC1_PARAM6;

/*-----------------------------------------------------------------------------
	0x0464 aud_dec1_param7 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	adv_en_opt2_lo                  ;   	// 31: 0
} AUD_DEC1_PARAM7;

/*-----------------------------------------------------------------------------
	0x0468 aud_dec1_param8 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	avgbps                          ;   	// 31: 0
} AUD_DEC1_PARAM8;

/*-----------------------------------------------------------------------------
	0x0470 aud_enc0_param0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch_num                          : 8,	//  0: 7
	bit_num                         : 8,	//  8:15
	sfreq                           :12,	// 16:27
	check_bit                       : 4;	// 28:31
} AUD_ENC0_PARAM0;

/*-----------------------------------------------------------------------------
	0x0474 aud_enc0_param1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bitrate                         :16,	//  0:15
	outmode                         : 2,	// 16:17
	                                :10,	// 18:27 reserved
	check_bit                       : 4;	// 28:31
} AUD_ENC0_PARAM1;

/*-----------------------------------------------------------------------------
	0x0478 aud_enc0_param2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x047c aud_enc0_param3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0480 aud_pes0_free_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pes0_free_size                  :20,	//  0:19
	pes0_max_size                   :12;	// 20:31
} AUD_PES0_FREE_SIZE;

/*-----------------------------------------------------------------------------
	0x0484 aud_pes1_free_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pes1_free_size                  :20,	//  0:19
	pes1_max_size                   :12;	// 20:31
} AUD_PES1_FREE_SIZE;

/*-----------------------------------------------------------------------------
	0x0488 aud_src0_sf ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x048c aud_src1_sf ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0490 aud_src2_sf ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0494 aud_src3_sf ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0498 aud_src4_sf ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x049c aud_src5_sf ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x04a0 aud_dec0_enc_opt0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dec0_encodeopt0                 ;   	// 31: 0
} AUD_DEC0_ENC_OPT0;

/*-----------------------------------------------------------------------------
	0x04a4 aud_dec0_enc_opt1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dec0_encodeopt1                 ;   	// 31: 0
} AUD_DEC0_ENC_OPT1;

/*-----------------------------------------------------------------------------
	0x04a8 aud_enc_opt_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dec0_enc_opt_size               :16,	//  0:15
	dec1_enc_opt_size               :16;	// 16:31
} AUD_ENC_OPT_SIZE;

/*-----------------------------------------------------------------------------
	0x04ac aud_basepts ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x04b0 aud_basestc ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x04b4 aud_dec1_enc_opt0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dec1_encodeopt0                 ;   	// 31: 0
} AUD_DEC1_ENC_OPT0;

/*-----------------------------------------------------------------------------
	0x04b8 aud_dec1_enc_opt1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dec1_encodeopt1                 ;   	// 31: 0
} AUD_DEC1_ENC_OPT1;

/*-----------------------------------------------------------------------------
	0x04bc aud_int_state0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dec0_decoding_info              : 1,	//     0
	dec0_decoding_error             : 1,	//     1
	dec0_decoding_start             : 1,	//     2
	dec0_decoding_stop              : 1,	//     3
	dec0_overflow                   : 1,	//     4
	dec0_underflow                  : 1,	//     5
	dec0_one_frame_decoding_done    : 1,	//     6
	dec0_index_decode_done          : 1,	//     7
	dec1_decoding_info              : 1,	//     8
	dec1_decoding_error             : 1,	//     9
	dec1_decoding_start             : 1,	//    10
	dec1_decoding_stop              : 1,	//    11
	dec1_overflow                   : 1,	//    12
	dec1_underflow                  : 1,	//    13
	dec1_one_frame_decoding_done    : 1,	//    14
	dec1_index_decode_done          : 1,	//    15
	aui_enc_done                    : 1,	//    16
	                                : 3,	// 17:19 reserved
	sif_intr_done                   : 1,	//    20
	adec_intr_done                  : 1,	//    21
	hdmi_intr_done                  : 1,	//    22
	tp0_intr_done                   : 1,	//    23
	tp1_intr_done                   : 1,	//    24
	                                : 4,	// 25:28 reserved
	dsp0_dec0_debug                 : 1,	//    29
	dsp0_dec1_debug                 : 1,	//    30
	dsp0_ready                      : 1;	//    31
} AUD_INT_STATE0;

/*-----------------------------------------------------------------------------
	0x04c0 aud_int_state1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dsp1_info                       : 1,	//     0
	dsp1_error                      : 1,	//     1
	present_info                    : 1,	//     2
	present_error                   : 1,	//     3
	present_start                   : 1,	//     4
	present_stop                    : 1,	//     5
	present_pause                   : 1,	//     6
	present_end                     : 1,	//     7
	                                :16,	//  8:23 reserved
	lipsync_check                   : 1,	//    24
	present_notify                  : 1,	//    25
	skip_present_notify             : 1,	//    26
	dsp1_ready                      : 1,	//    27
	check_bit                       : 4;	// 28:31
} AUD_INT_STATE1;

/*-----------------------------------------------------------------------------
	0x04c4 aud_intmask ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	int_err_mask0                   : 1,	//     0
	int_info_mask0                  : 1,	//     1
	int_lip_mask0                   : 1,	//     2
	int_frm_mask0                   : 1,	//     3
	int_dec_event0                  : 1,	//     4
	                                :11,	//  5:15 reserved
	int_err_mask1                   : 1,	//    16
	int_info_mask1                  : 1,	//    17
	int_lip_mask1                   : 1,	//    18
	int_frm_mask1                   : 1,	//    19
	int_dec_event1                  : 1;	//    20
} AUD_INTMASK;

/*-----------------------------------------------------------------------------
	0x04c8 aud_levelmo_l ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x04cc aud_levelmo_r ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x04d0 aud_sai_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	write_sai_data                  ;   	// 31: 0
} AUD_SAI_DATA;

/*-----------------------------------------------------------------------------
	0x04d4 aud_decstat0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	es_info0                        :12,	//  0:11
	es_info1                        : 8,	// 12:19
	es_info2                        : 4,	// 20:23
	es_info3                        : 4,	// 24:27
	es_existence                    : 4;	// 28:31
} AUD_DECSTAT0;

/*-----------------------------------------------------------------------------
	0x04d8 aud_decstat1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	es_info0                        :12,	//  0:11
	es_info1                        : 8,	// 12:19
	es_info2                        : 4,	// 20:23
	es_info3                        : 4,	// 24:27
	es_existence                    : 4;	// 28:31
} AUD_DECSTAT1;

/*-----------------------------------------------------------------------------
	0x04dc aud_encstat0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sfreq                           :16,	//  0:15
	duration                        :16;	// 16:31
} AUD_ENCSTAT0;

/*-----------------------------------------------------------------------------
	0x04e0 aud_pts_index0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x04e4 aud_pts_index1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x04e8 aud_dec0_cbt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x04ec aud_dec0_sbt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x04f0 aud_dec1_cbt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x04f4 aud_dec1_sbt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x04f8 aud_dsp0_state ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	codec_ver                       :16,	//  0:15
	codec_type                      : 8,	// 16:23
	                                : 3,	// 24:26 reserved
	is_init                         : 1,	//    27
	check_bit                       : 4;	// 28:31
} AUD_DSP0_STATE;

/*-----------------------------------------------------------------------------
	0x04fc aud_dsp1_state ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	codec_ver                       :16,	//  0:15
	                                :12,	// 16:27 reserved
	check_bit                       : 4;	// 28:31
} AUD_DSP1_STATE;

/*-----------------------------------------------------------------------------
	0x0500 aud_mem_mpb1_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0504 aud_mem_mpb1_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0508 aud_mem_mpb2_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x050c aud_mem_mpb2_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0510 aud_mem_mpb3_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0514 aud_mem_mpb3_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0518 aud_mpb3_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_MPB3_WO;

/*-----------------------------------------------------------------------------
	0x051c aud_mpb3_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_MPB3_RO;

/*-----------------------------------------------------------------------------
	0x0520 aud_mpb3_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_MPB3_WI;

/*-----------------------------------------------------------------------------
	0x0524 aud_mpb3_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_MPB3_RI;

/*-----------------------------------------------------------------------------
	0x0528 aud_mpb2_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_MPB2_WO;

/*-----------------------------------------------------------------------------
	0x052c aud_mpb2_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_MPB2_RO;

/*-----------------------------------------------------------------------------
	0x0530 aud_mpb2_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_MPB2_WI;

/*-----------------------------------------------------------------------------
	0x0534 aud_mpb2_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_MPB2_RI;

/*-----------------------------------------------------------------------------
	0x0538 aud_mpb1_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_MPB1_WO;

/*-----------------------------------------------------------------------------
	0x053c aud_mpb1_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_MPB1_RO;

/*-----------------------------------------------------------------------------
	0x0540 aud_mpb1_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_MPB1_WI;

/*-----------------------------------------------------------------------------
	0x0544 aud_mpb1_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_MPB1_RI;

/*-----------------------------------------------------------------------------
	0x0548 aud_in_index_dec0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x054c aud_in_index_dec1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0550 aud_in_index_mix0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0554 aud_in_index_mix1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0558 aud_in_index_mix2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x055c aud_in_index_mix3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0560 aud_in_index_mix4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0564 aud_in_index_mix5 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0568 aud_mem_ddco_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x056c aud_mem_ddco_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0570 aud_ddco_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_DDCO_WO;

/*-----------------------------------------------------------------------------
	0x0574 aud_ddco_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_DDCO_RO;

/*-----------------------------------------------------------------------------
	0x0578 aud_ddco_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_DDCO_WI;

/*-----------------------------------------------------------------------------
	0x057c aud_ddco_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_DDCO_RI;

/*-----------------------------------------------------------------------------
	0x0580 aud_mem_enc_intra_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0584 aud_mem_enc_intra_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0588 aud_clock_rate ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dto_rate                        : 8,	//  0: 7
	pcmout_rate                     :16;	//  8:23
} AUD_CLOCK_RATE;

/*-----------------------------------------------------------------------------
	0x058c aud_in_index_present0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0590 aud_in_index_present1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0594 aud_in_index_present2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0598 aud_in_index_present3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x059c aud_in_index_present4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x05a0 aud_in_index_present5 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x05a4 aud_hdmi_int_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x05a8 aud_hdmi_int_gstc ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x05ac aud_clear_hdmi_int_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x05c0 aud_llb_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_LLB_WO;

/*-----------------------------------------------------------------------------
	0x05c4 aud_llb_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_LLB_RO;

/*-----------------------------------------------------------------------------
	0x05c8 aud_llb_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_LLB_WI;

/*-----------------------------------------------------------------------------
	0x05cc aud_llb_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_LLB_RI;

/*-----------------------------------------------------------------------------
	0x05d0 aud_mem_llb_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x05d4 aud_mem_llb_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x05d8 aud_in_index_llb ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x05dc aud_src_sf_llb ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x05e0 aud_acr_wo ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_ACR_WO;

/*-----------------------------------------------------------------------------
	0x05e4 aud_acr_ro ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	offset                          :28,	//  0:27
	chk_bit                         : 4;	// 28:31
} AUD_ACR_RO;

/*-----------------------------------------------------------------------------
	0x05e8 aud_acr_wi ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_ACR_WI;

/*-----------------------------------------------------------------------------
	0x05ec aud_acr_ri ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           :27,	//  0:26
	is_allocated                    : 1,	//    27
	chk_bit                         : 4;	// 28:31
} AUD_ACR_RI;

/*-----------------------------------------------------------------------------
	0x05f0 aud_mem_acr_addr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x05f4 aud_mem_acr_size ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x05f8 aud_src_sf_acr ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0610 aud_dec_num_essync ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sync_dec0                       : 1,	//     0
	sync_dec1                       : 1;	//     1
} AUD_DEC_NUM_ESSYNC;

/*-----------------------------------------------------------------------------
	0x0614 aud_dsp0_stc ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0618 aud_dsp1_stc ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x061c aud_dec0_frame_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0620 aud_dec1_frame_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0624 aud_enc_frame_cnt ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0628 aud_debug00_0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x062c aud_debug01_0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0630 aud_debug02_0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0634 aud_debug03_0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0638 aud_debug00 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x063c aud_debug01 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0640 aud_debug02 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0644 aud_debug03 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0648 aud_dbg_mix_ch0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch_state                        : 3,	//  0: 2
	sample_bit                      : 2,	//  3: 4
	ch_mode                         : 2,	//  5: 6
	fade_gain                       :11,	//  7:17
	pre_gain                        :14;	// 18:31
} AUD_DBG_MIX_CH0;

/*-----------------------------------------------------------------------------
	0x064c aud_dbg_mix_ch1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch_state                        : 3,	//  0: 2
	sample_bit                      : 2,	//  3: 4
	ch_mode                         : 2,	//  5: 6
	fade_gain                       :11,	//  7:17
	pre_gain                        :14;	// 18:31
} AUD_DBG_MIX_CH1;

/*-----------------------------------------------------------------------------
	0x0650 aud_dbg_mix_ch2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch_state                        : 3,	//  0: 2
	sample_bit                      : 2,	//  3: 4
	ch_mode                         : 2,	//  5: 6
	fade_gain                       :11,	//  7:17
	pre_gain                        :14;	// 18:31
} AUD_DBG_MIX_CH2;

/*-----------------------------------------------------------------------------
	0x0654 aud_dbg_mix_ch3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch_state                        : 3,	//  0: 2
	sample_bit                      : 2,	//  3: 4
	ch_mode                         : 2,	//  5: 6
	fade_gain                       :11,	//  7:17
	pre_gain                        :14;	// 18:31
} AUD_DBG_MIX_CH3;

/*-----------------------------------------------------------------------------
	0x0658 aud_dbg_mix_ch4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch_state                        : 3,	//  0: 2
	sample_bit                      : 2,	//  3: 4
	ch_mode                         : 2,	//  5: 6
	fade_gain                       :11,	//  7:17
	pre_gain                        :14;	// 18:31
} AUD_DBG_MIX_CH4;

/*-----------------------------------------------------------------------------
	0x065c aud_dbg_mix_ch5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ch_state                        : 3,	//  0: 2
	sample_bit                      : 2,	//  3: 4
	ch_mode                         : 2,	//  5: 6
	fade_gain                       :11,	//  7:17
	pre_gain                        :14;	// 18:31
} AUD_DBG_MIX_CH5;

/*-----------------------------------------------------------------------------
	0x0688 aud_dbg_spkout_info0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	balanced                        : 8,	//  0: 7
	delay                           :12,	//  8:19
	mute                            : 1,	//    20
	volume_enable                   : 1,	//    21
	error                           :10;	// 22:31
} AUD_DBG_SPKOUT_INFO0;

/*-----------------------------------------------------------------------------
	0x068c aud_dbg_spkout_info1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	volume                          ;   	// 31: 0
} AUD_DBG_SPKOUT_INFO1;

/*-----------------------------------------------------------------------------
	0x0690 aud_dbg_hpout_info0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	balanced                        : 8,	//  0: 7
	delay                           :12,	//  8:19
	mute                            : 1,	//    20
	volume_enable                   : 1,	//    21
	error                           :10;	// 22:31
} AUD_DBG_HPOUT_INFO0;

/*-----------------------------------------------------------------------------
	0x0694 aud_dbg_hpout_info1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	volume                          ;   	// 31: 0
} AUD_DBG_HPOUT_INFO1;

/*-----------------------------------------------------------------------------
	0x0698 aud_dbg_spdifout_info0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	balanced                        : 8,	//  0: 7
	delay                           :12,	//  8:19
	mute                            : 1,	//    20
	volume_enable                   : 1,	//    21
	error                           :10;	// 22:31
} AUD_DBG_SPDIFOUT_INFO0;

/*-----------------------------------------------------------------------------
	0x069c aud_dbg_spdifout_info1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	volume                          ;   	// 31: 0
} AUD_DBG_SPDIFOUT_INFO1;

/*-----------------------------------------------------------------------------
	0x06a0 aud_dbg_scartout_info0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	balanced                        : 8,	//  0: 7
	delay                           :12,	//  8:19
	mute                            : 1,	//    20
	volume_enable                   : 1,	//    21
	error                           :10;	// 22:31
} AUD_DBG_SCARTOUT_INFO0;

/*-----------------------------------------------------------------------------
	0x06a4 aud_dbg_scartout_info1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	volume                          ;   	// 31: 0
} AUD_DBG_SCARTOUT_INFO1;

/*-----------------------------------------------------------------------------
	0x06a8 aud_dbg_lineout_info0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	balanced                        : 8,	//  0: 7
	delay                           :12,	//  8:19
	mute                            : 1,	//    20
	volume_enable                   : 1,	//    21
	error                           :10;	// 22:31
} AUD_DBG_LINEOUT_INFO0;

/*-----------------------------------------------------------------------------
	0x06ac aud_dbg_lineout_info1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	volume                          ;   	// 31: 0
} AUD_DBG_LINEOUT_INFO1;

/*-----------------------------------------------------------------------------
	0x06b0 aud_dbg_lipsync0_info0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	state                           : 4,	//  0: 3
	input_stream_type               : 2,	//  4: 5
	error                           :26;	//  6:31
} AUD_DBG_LIPSYNC0_INFO0;

/*-----------------------------------------------------------------------------
	0x06b4 aud_dbg_lipsync0_info1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	upperbound                      : 8,	//  0: 7
	lowerbound                      : 8,	//  8:15
	constdelay                      :16;	// 16:31
} AUD_DBG_LIPSYNC0_INFO1;

/*-----------------------------------------------------------------------------
	0x06b8 aud_dbg_lipsync1_info0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	state                           : 4,	//  0: 3
	input_stream_type               : 2,	//  4: 5
	error                           :26;	//  6:31
} AUD_DBG_LIPSYNC1_INFO0;

/*-----------------------------------------------------------------------------
	0x06bc aud_dbg_lipsync1_info1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	upperbound                      : 8,	//  0: 7
	lowerbound                      : 8,	//  8:15
	constdelay                      :16;	// 16:31
} AUD_DBG_LIPSYNC1_INFO1;

/*-----------------------------------------------------------------------------
	0x06c0 aud_dbg_reserved0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06c4 aud_dbg_reserved1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06c8 aud_dbg_reserved2 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06cc aud_dbg_reserved3 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06d0 aud_dbg_reserved4 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06d4 aud_dbg_dsp0_reset ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x06d8 aud_dbg_dsp1_reset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dsp_reset_count                 :16,	//  0:15
	clock_reset_count               : 8,	// 16:23
	mclk_reset_count                : 8;	// 24:31
} AUD_DBG_DSP1_RESET;

/*-----------------------------------------------------------------------------
	0x06dc aud_dbg_ad_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fade                            :16,	//  0:15
	pan                             :16;	// 16:31
} AUD_DBG_AD_INFO;

/*-----------------------------------------------------------------------------
	0x06e0 aud_dbg_se_info0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mode                            :24,	//  0:23
	deq_mode                        : 8;	// 24:31
} AUD_DBG_SE_INFO0;

/*-----------------------------------------------------------------------------
	0x06e4 aud_dbg_se_info1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	peq_mode                        :16,	//  0:15
	osd_volume                      : 8,	// 16:23
	input_pcm_format                : 8;	// 24:31
} AUD_DBG_SE_INFO1;

/*-----------------------------------------------------------------------------
	0x06e8 aud_dbg_src0_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	input_fs                        : 8,	//  0: 7
	output_fs                       : 8,	//  8:15
	channel                         : 2,	// 16:17
	error                           :14;	// 18:31
} AUD_DBG_SRC0_INFO;

/*-----------------------------------------------------------------------------
	0x06ec aud_dbg_src1_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	input_fs                        : 8,	//  0: 7
	output_fs                       : 8,	//  8:15
	channel                         : 2,	// 16:17
	error                           :14;	// 18:31
} AUD_DBG_SRC1_INFO;

/*-----------------------------------------------------------------------------
	0x06f0 aud_dbg_src2_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	input_fs                        : 8,	//  0: 7
	output_fs                       : 8,	//  8:15
	channel                         : 2,	// 16:17
	error                           :14;	// 18:31
} AUD_DBG_SRC2_INFO;

/*-----------------------------------------------------------------------------
	0x06f4 aud_dbg_src3_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	input_fs                        : 8,	//  0: 7
	output_fs                       : 8,	//  8:15
	channel                         : 2,	// 16:17
	error                           :14;	// 18:31
} AUD_DBG_SRC3_INFO;

/*-----------------------------------------------------------------------------
	0x06f8 aud_dbg_src4_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	input_fs                        : 8,	//  0: 7
	output_fs                       : 8,	//  8:15
	channel                         : 2,	// 16:17
	error                           :14;	// 18:31
} AUD_DBG_SRC4_INFO;

/*-----------------------------------------------------------------------------
	0x06fc aud_dbg_src5_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	input_fs                        : 8,	//  0: 7
	output_fs                       : 8,	//  8:15
	channel                         : 2,	// 16:17
	error                           :14;	// 18:31
} AUD_DBG_SRC5_INFO;

typedef struct {
	UINT32                          	hpi0ram                         ;	// 0x0000 : ''
	UINT32                          	                 __rsvd_00[  63];	// 0x0004 ~ 0x00fc
	UINT32                          	hpi1ram                         ;	// 0x0100 : ''
	UINT32                          	                 __rsvd_01[  63];	// 0x0104 ~ 0x01fc
	UINT32                          	aud_int0_id                     ;	// 0x0200 : ''
	UINT32                          	aud_int0_clr                    ;	// 0x0204 : ''
	UINT32                          	aud_int0_en                     ;	// 0x0208 : ''
	UINT32                          	aud_int1_id                     ;	// 0x020c : ''
	UINT32                          	aud_int1_clr                    ;	// 0x0210 : ''
	UINT32                          	aud_int1_en                     ;	// 0x0214 : ''
	AUD_RUNSTALL0                   	aud_runstall0                   ;	// 0x0218 : ''
	AUD_RUNSTALL1                   	aud_runstall1                   ;	// 0x021c : ''
	AUD_STATVECSEL0                 	aud_statvecsel0                 ;	// 0x0220 : ''
	AUD_STATVECSEL1                 	aud_statvecsel1                 ;	// 0x0224 : ''
	AUD_PWAITMODE0                  	aud_pwaitmode0                  ;	// 0x0228 : ''
	AUD_PWAITMODE1                  	aud_pwaitmode1                  ;	// 0x022c : ''
	UINT32                          	aud_dsp0prid                    ;	// 0x0230 : ''
	UINT32                          	aud_dsp1prid                    ;	// 0x0234 : ''
	AUD_SWRESET                     	aud_swreset                     ;	// 0x0238 : ''
	UINT32                          	aud_mon_sel                     ;	// 0x023c : ''
	AUD_DIRQ0                       	aud_dirq0                       ;	// 0x0240 : ''
	AUD_DIRQ1                       	aud_dirq1                       ;	// 0x0244 : ''
	AUD_DEBUGEN0                    	aud_debugen0                    ;	// 0x0248 : ''
	AUD_DEBUGEN1                    	aud_debugen1                    ;	// 0x024c : ''
	AUD_NMIINT0                     	aud_nmiint0                     ;	// 0x0250 : ''
	AUD_MMIINT1                     	aud_mmiint1                     ;	// 0x0254 : ''
	AUD_XOCDMODE0                   	aud_xocdmode0                   ;	// 0x0258 : ''
	AUD_XOCDMODE1                   	aud_xocdmode1                   ;	// 0x025c : ''
	UINT32                          	aud_debugdata0                  ;	// 0x0260 : ''
	UINT32                          	aud_debugdata1                  ;	// 0x0264 : ''
	UINT32                          	aud_debugpc0                    ;	// 0x0268 : ''
	UINT32                          	aud_debugpc1                    ;	// 0x026c : ''
	UINT32                          	aud_debugstat0                  ;	// 0x0270 : ''
	UINT32                          	aud_debugstat1                  ;	// 0x0274 : ''
	AUD_GSTCCHREG                   	aud_gstcchreg                   ;	// 0x0278 : ''
	UINT32                          	aud_gstcclreg                   ;	// 0x027c : ''
	UINT32                          	aud_dsp0offset0                 ;	// 0x0280 : ''
	UINT32                          	aud_dsp0offset1                 ;	// 0x0284 : ''
	UINT32                          	aud_dsp0offset2                 ;	// 0x0288 : ''
	UINT32                          	aud_dsp0offset3                 ;	// 0x028c : ''
	UINT32                          	aud_dsp0offset4                 ;	// 0x0290 : ''
	UINT32                          	aud_dsp0offset5                 ;	// 0x0294 : ''
	UINT32                          	aud_dsp0offset6                 ;	// 0x0298 : ''
	UINT32                          	aud_dsp0offset7                 ;	// 0x029c : ''
	UINT32                          	aud_dsp1offset0                 ;	// 0x02a0 : ''
	UINT32                          	aud_dsp1offset1                 ;	// 0x02a4 : ''
	UINT32                          	aud_dsp1offset2                 ;	// 0x02a8 : ''
	UINT32                          	aud_dsp1offset3                 ;	// 0x02ac : ''
	UINT32                          	aud_dsp1offset4                 ;	// 0x02b0 : ''
	UINT32                          	aud_dsp1offset5                 ;	// 0x02b4 : ''
	UINT32                          	aud_dsp1offset6                 ;	// 0x02b8 : ''
	UINT32                          	aud_dsp1offset7                 ;	// 0x02bc : ''
	UINT32                          	memtab0                         ;	// 0x02c0 : ''
	UINT32                          	memtab1                         ;	// 0x02c4 : ''
	UINT32                          	memtab2                         ;	// 0x02c8 : ''
	UINT32                          	memtab3                         ;	// 0x02cc : ''
	UINT32                          	memtab4                         ;	// 0x02d0 : ''
	UINT32                          	memtab5                         ;	// 0x02d4 : ''
	UINT32                          	aud_dsp0offset61                ;	// 0x02d8 : ''
	UINT32                          	aud_dsp1offset61                ;	// 0x02dc : ''
	AUD_OVERRIDE                    	aud_override                    ;	// 0x02e0 : ''
	UINT32                          	                 __rsvd_02[   7];	// 0x02e4 ~ 0x02fc
	UINT32                          	aud_mem_share_base              ;	// 0x0300 : ''
	UINT32                          	aud_mem_dsp0_base               ;	// 0x0304 : ''
	UINT32                          	aud_mem_dsp1_base               ;	// 0x0308 : ''
	UINT32                          	aud_mem_cpbm_addr               ;	// 0x030c : ''
	UINT32                          	aud_mem_cpbm_size               ;	// 0x0310 : ''
	UINT32                          	aud_mem_cpba_addr               ;	// 0x0314 : ''
	UINT32                          	aud_mem_cpba_size               ;	// 0x0318 : ''
	UINT32                          	aud_mem_mpb0_addr               ;	// 0x031c : ''
	UINT32                          	aud_mem_mpb0_size               ;	// 0x0320 : ''
	UINT32                          	aud_mem_dpbm_addr               ;	// 0x0324 : ''
	UINT32                          	aud_mem_dpbm_size               ;	// 0x0328 : ''
	UINT32                          	aud_mem_dpba_addr               ;	// 0x032c : ''
	UINT32                          	aud_mem_dpba_size               ;	// 0x0330 : ''
	UINT32                          	aud_mem_iec_addr                ;	// 0x0334 : ''
	UINT32                          	aud_mem_iec_size                ;	// 0x0338 : ''
	UINT32                          	aud_mem_enc_addr                ;	// 0x033c : ''
	UINT32                          	aud_mem_enc_size                ;	// 0x0340 : ''
	UINT32                          	aud_mem_buf_stat0_addr          ;	// 0x0344 : ''
	UINT32                          	aud_mem_buf_stat1_addr          ;	// 0x0348 : ''
	UINT32                          	aud_mem_profile_addr            ;	// 0x034c : ''
	UINT32                          	aud_mem_se_param_addr           ;	// 0x0350 : ''
	UINT32                          	aud_mem_ipc_addr                ;	// 0x0354 : ''
	UINT32                          	aud_mem_ipc_size                ;	// 0x0358 : ''
	UINT32                          	aud_ipc_cmd_rptr                ;	// 0x035c : ''
	UINT32                          	aud_ipc_cmd_wptr                ;	// 0x0360 : ''
	UINT32                          	aud_ipc_cmd_base                ;	// 0x0364 : ''
	UINT32                          	aud_ipc_cmd_size                ;	// 0x0368 : ''
	UINT32                          	aud_ipc_dbg_rptr                ;	// 0x036c : ''
	UINT32                          	aud_ipc_dbg_wptr                ;	// 0x0370 : ''
	UINT32                          	aud_ipc_dbg_base                ;	// 0x0374 : ''
	UINT32                          	aud_ipc_dbg_size                ;	// 0x0378 : ''
	UINT32                          	aud_ipc_req_rptr                ;	// 0x037c : ''
	UINT32                          	aud_ipc_req_wptr                ;	// 0x0380 : ''
	UINT32                          	aud_ipc_req_base                ;	// 0x0384 : ''
	UINT32                          	aud_ipc_req_size                ;	// 0x0388 : ''
	AUD_SAI_GAIN                    	aud_sai_gain                    ;	// 0x038c : ''
	AUD_SET_INOUT                   	aud_set_inout                   ;	// 0x0390 : ''
	AUD_DSP1_DBG_MASK               	aud_dsp1_dbg_mask               ;	// 0x0394 : ''
	UINT32                          	                 __rsvd_03[   1];	// 0x0398
	AUD_MPB0_WO                     	aud_mpb0_wo                     ;	// 0x039c : ''
	AUD_MPB0_RO                     	aud_mpb0_ro                     ;	// 0x03a0 : ''
	AUD_MPB0_WI                     	aud_mpb0_wi                     ;	// 0x03a4 : ''
	AUD_MPB0_RI                     	aud_mpb0_ri                     ;	// 0x03a8 : ''
	AUD_CPB1_WO                     	aud_cpb1_wo                     ;	// 0x03ac : ''
	AUD_CPB1_RO                     	aud_cpb1_ro                     ;	// 0x03b0 : ''
	AUD_CPB1_WI                     	aud_cpb1_wi                     ;	// 0x03b4 : ''
	AUD_CPB1_RI                     	aud_cpb1_ri                     ;	// 0x03b8 : ''
	AUD_DPB1_WO                     	aud_dpb1_wo                     ;	// 0x03bc : ''
	AUD_DPB1_RO                     	aud_dpb1_ro                     ;	// 0x03c0 : ''
	AUD_DPB1_WI                     	aud_dpb1_wi                     ;	// 0x03c4 : ''
	AUD_DPB1_RI                     	aud_dpb1_ri                     ;	// 0x03c8 : ''
	AUD_CPB0_WO                     	aud_cpb0_wo                     ;	// 0x03cc : ''
	AUD_CPB0_RO                     	aud_cpb0_ro                     ;	// 0x03d0 : ''
	AUD_CPB0_WI                     	aud_cpb0_wi                     ;	// 0x03d4 : ''
	AUD_CPB0_RI                     	aud_cpb0_ri                     ;	// 0x03d8 : ''
	AUD_DPB0_WO                     	aud_dpb0_wo                     ;	// 0x03dc : ''
	AUD_DPB0_RO                     	aud_dpb0_ro                     ;	// 0x03e0 : ''
	AUD_DPB0_WI                     	aud_dpb0_wi                     ;	// 0x03e4 : ''
	AUD_DPB0_RI                     	aud_dpb0_ri                     ;	// 0x03e8 : ''
	AUD_IECBIT_WO                   	aud_iecbit_wo                   ;	// 0x03ec : ''
	AUD_IECBIT_RO                   	aud_iecbit_ro                   ;	// 0x03f0 : ''
	AUD_IECBIT_WI                   	aud_iecbit_wi                   ;	// 0x03f4 : ''
	AUD_IECBIT_RI                   	aud_iecbit_ri                   ;	// 0x03f8 : ''
	AUD_ENC_WO                      	aud_enc_wo                      ;	// 0x03fc : ''
	AUD_ENC_RO                      	aud_enc_ro                      ;	// 0x0400 : ''
	AUD_ENC_WI                      	aud_enc_wi                      ;	// 0x0404 : ''
	AUD_ENC_RI                      	aud_enc_ri                      ;	// 0x0408 : ''
	AUD_CODEC_STATE                 	aud_codec_state                 ;	// 0x040c : ''
	AUD_CODEC_CMD                   	aud_codec_cmd                   ;	// 0x0410 : ''
	AUD_CODEC_ACK                   	aud_codec_ack                   ;	// 0x0414 : ''
	AUD_CODEC_INPUT                 	aud_codec_input                 ;	// 0x0418 : ''
	AUD_CODEC_TYPE                  	aud_codec_type                  ;	// 0x041c : ''
	AUD_DEC0_PARAM0                 	aud_dec0_param0                 ;	// 0x0420 : ''
	AUD_DEC0_PARAM1                 	aud_dec0_param1                 ;	// 0x0424 : ''
	AUD_DEC0_PARAM2                 	aud_dec0_param2                 ;	// 0x0428 : ''
	AUD_DEC0_PARAM3                 	aud_dec0_param3                 ;	// 0x042c : ''
	AUD_DEC0_PARAM4                 	aud_dec0_param4                 ;	// 0x0430 : ''
	AUD_DEC0_PARAM5                 	aud_dec0_param5                 ;	// 0x0434 : ''
	AUD_DEC0_PARAM6                 	aud_dec0_param6                 ;	// 0x0438 : ''
	AUD_DEC0_PARAM7                 	aud_dec0_param7                 ;	// 0x043c : ''
	AUD_DEC0_PARAM8                 	aud_dec0_param8                 ;	// 0x0440 : ''
	UINT32                          	                 __rsvd_04[   1];	// 0x0444
	AUD_DEC1_PARAM0                 	aud_dec1_param0                 ;	// 0x0448 : ''
	AUD_DEC1_PARAM1                 	aud_dec1_param1                 ;	// 0x044c : ''
	AUD_DEC1_PARAM2                 	aud_dec1_param2                 ;	// 0x0450 : ''
	AUD_DEC1_PARAM3                 	aud_dec1_param3                 ;	// 0x0454 : ''
	AUD_DEC1_PARAM4                 	aud_dec1_param4                 ;	// 0x0458 : ''
	AUD_DEC1_PARAM5                 	aud_dec1_param5                 ;	// 0x045c : ''
	AUD_DEC1_PARAM6                 	aud_dec1_param6                 ;	// 0x0460 : ''
	AUD_DEC1_PARAM7                 	aud_dec1_param7                 ;	// 0x0464 : ''
	AUD_DEC1_PARAM8                 	aud_dec1_param8                 ;	// 0x0468 : ''
	UINT32                          	                 __rsvd_05[   1];	// 0x046c
	AUD_ENC0_PARAM0                 	aud_enc0_param0                 ;	// 0x0470 : ''
	AUD_ENC0_PARAM1                 	aud_enc0_param1                 ;	// 0x0474 : ''
	UINT32                          	aud_enc0_param2                 ;	// 0x0478 : ''
	UINT32                          	aud_enc0_param3                 ;	// 0x047c : ''
	AUD_PES0_FREE_SIZE              	aud_pes0_free_size              ;	// 0x0480 : ''
	AUD_PES1_FREE_SIZE              	aud_pes1_free_size              ;	// 0x0484 : ''
	UINT32                          	aud_src0_sf                     ;	// 0x0488 : ''
	UINT32                          	aud_src1_sf                     ;	// 0x048c : ''
	UINT32                          	aud_src2_sf                     ;	// 0x0490 : ''
	UINT32                          	aud_src3_sf                     ;	// 0x0494 : ''
	UINT32                          	aud_src4_sf                     ;	// 0x0498 : ''
	UINT32                          	aud_src5_sf                     ;	// 0x049c : ''
	AUD_DEC0_ENC_OPT0               	aud_dec0_enc_opt0               ;	// 0x04a0 : ''
	AUD_DEC0_ENC_OPT1               	aud_dec0_enc_opt1               ;	// 0x04a4 : ''
	AUD_ENC_OPT_SIZE                	aud_enc_opt_size                ;	// 0x04a8 : ''
	UINT32                          	aud_basepts                     ;	// 0x04ac : ''
	UINT32                          	aud_basestc                     ;	// 0x04b0 : ''
	AUD_DEC1_ENC_OPT0               	aud_dec1_enc_opt0               ;	// 0x04b4 : ''
	AUD_DEC1_ENC_OPT1               	aud_dec1_enc_opt1               ;	// 0x04b8 : ''
	AUD_INT_STATE0                  	aud_int_state0                  ;	// 0x04bc : ''
	AUD_INT_STATE1                  	aud_int_state1                  ;	// 0x04c0 : ''
	AUD_INTMASK                     	aud_intmask                     ;	// 0x04c4 : ''
	UINT32                          	aud_levelmo_l                   ;	// 0x04c8 : ''
	UINT32                          	aud_levelmo_r                   ;	// 0x04cc : ''
	AUD_SAI_DATA                    	aud_sai_data                    ;	// 0x04d0 : ''
	AUD_DECSTAT0                    	aud_decstat0                    ;	// 0x04d4 : ''
	AUD_DECSTAT1                    	aud_decstat1                    ;	// 0x04d8 : ''
	AUD_ENCSTAT0                    	aud_encstat0                    ;	// 0x04dc : ''
	UINT32                          	aud_pts_index0                  ;	// 0x04e0 : ''
	UINT32                          	aud_pts_index1                  ;	// 0x04e4 : ''
	UINT32                          	aud_dec0_cbt                    ;	// 0x04e8 : ''
	UINT32                          	aud_dec0_sbt                    ;	// 0x04ec : ''
	UINT32                          	aud_dec1_cbt                    ;	// 0x04f0 : ''
	UINT32                          	aud_dec1_sbt                    ;	// 0x04f4 : ''
	AUD_DSP0_STATE                  	aud_dsp0_state                  ;	// 0x04f8 : ''
	AUD_DSP1_STATE                  	aud_dsp1_state                  ;	// 0x04fc : ''
	UINT32                          	aud_mem_mpb1_addr               ;	// 0x0500 : ''
	UINT32                          	aud_mem_mpb1_size               ;	// 0x0504 : ''
	UINT32                          	aud_mem_mpb2_addr               ;	// 0x0508 : ''
	UINT32                          	aud_mem_mpb2_size               ;	// 0x050c : ''
	UINT32                          	aud_mem_mpb3_addr               ;	// 0x0510 : ''
	UINT32                          	aud_mem_mpb3_size               ;	// 0x0514 : ''
	AUD_MPB3_WO                     	aud_mpb3_wo                     ;	// 0x0518 : ''
	AUD_MPB3_RO                     	aud_mpb3_ro                     ;	// 0x051c : ''
	AUD_MPB3_WI                     	aud_mpb3_wi                     ;	// 0x0520 : ''
	AUD_MPB3_RI                     	aud_mpb3_ri                     ;	// 0x0524 : ''
	AUD_MPB2_WO                     	aud_mpb2_wo                     ;	// 0x0528 : ''
	AUD_MPB2_RO                     	aud_mpb2_ro                     ;	// 0x052c : ''
	AUD_MPB2_WI                     	aud_mpb2_wi                     ;	// 0x0530 : ''
	AUD_MPB2_RI                     	aud_mpb2_ri                     ;	// 0x0534 : ''
	AUD_MPB1_WO                     	aud_mpb1_wo                     ;	// 0x0538 : ''
	AUD_MPB1_RO                     	aud_mpb1_ro                     ;	// 0x053c : ''
	AUD_MPB1_WI                     	aud_mpb1_wi                     ;	// 0x0540 : ''
	AUD_MPB1_RI                     	aud_mpb1_ri                     ;	// 0x0544 : ''
	UINT32                          	aud_in_index_dec0               ;	// 0x0548 : ''
	UINT32                          	aud_in_index_dec1               ;	// 0x054c : ''
	UINT32                          	aud_in_index_mix0               ;	// 0x0550 : ''
	UINT32                          	aud_in_index_mix1               ;	// 0x0554 : ''
	UINT32                          	aud_in_index_mix2               ;	// 0x0558 : ''
	UINT32                          	aud_in_index_mix3               ;	// 0x055c : ''
	UINT32                          	aud_in_index_mix4               ;	// 0x0560 : ''
	UINT32                          	aud_in_index_mix5               ;	// 0x0564 : ''
	UINT32                          	aud_mem_ddco_addr               ;	// 0x0568 : ''
	UINT32                          	aud_mem_ddco_size               ;	// 0x056c : ''
	AUD_DDCO_WO                     	aud_ddco_wo                     ;	// 0x0570 : ''
	AUD_DDCO_RO                     	aud_ddco_ro                     ;	// 0x0574 : ''
	AUD_DDCO_WI                     	aud_ddco_wi                     ;	// 0x0578 : ''
	AUD_DDCO_RI                     	aud_ddco_ri                     ;	// 0x057c : ''
	UINT32                          	aud_mem_enc_intra_addr          ;	// 0x0580 : ''
	UINT32                          	aud_mem_enc_intra_size          ;	// 0x0584 : ''
	AUD_CLOCK_RATE                  	aud_clock_rate                  ;	// 0x0588 : ''
	UINT32                          	aud_in_index_present0           ;	// 0x058c : ''
	UINT32                          	aud_in_index_present1           ;	// 0x0590 : ''
	UINT32                          	aud_in_index_present2           ;	// 0x0594 : ''
	UINT32                          	aud_in_index_present3           ;	// 0x0598 : ''
	UINT32                          	aud_in_index_present4           ;	// 0x059c : ''
	UINT32                          	aud_in_index_present5           ;	// 0x05a0 : ''
	UINT32                          	aud_hdmi_int_cnt                ;	// 0x05a4 : ''
	UINT32                          	aud_hdmi_int_gstc               ;	// 0x05a8 : ''
	UINT32                          	aud_clear_hdmi_int_cnt          ;	// 0x05ac : ''
	UINT32                          	                 __rsvd_06[   4];	// 0x05b0 ~ 0x05bc
	AUD_LLB_WO                      	aud_llb_wo                      ;	// 0x05c0 : ''
	AUD_LLB_RO                      	aud_llb_ro                      ;	// 0x05c4 : ''
	AUD_LLB_WI                      	aud_llb_wi                      ;	// 0x05c8 : ''
	AUD_LLB_RI                      	aud_llb_ri                      ;	// 0x05cc : ''
	UINT32                          	aud_mem_llb_addr                ;	// 0x05d0 : ''
	UINT32                          	aud_mem_llb_size                ;	// 0x05d4 : ''
	UINT32                          	aud_in_index_llb                ;	// 0x05d8 : ''
	UINT32                          	aud_src_sf_llb                  ;	// 0x05dc : ''
	AUD_ACR_WO                      	aud_acr_wo                      ;	// 0x05e0 : ''
	AUD_ACR_RO                      	aud_acr_ro                      ;	// 0x05e4 : ''
	AUD_ACR_WI                      	aud_acr_wi                      ;	// 0x05e8 : ''
	AUD_ACR_RI                      	aud_acr_ri                      ;	// 0x05ec : ''
	UINT32                          	aud_mem_acr_addr                ;	// 0x05f0 : ''
	UINT32                          	aud_mem_acr_size                ;	// 0x05f4 : ''
	UINT32                          	aud_src_sf_acr                  ;	// 0x05f8 : ''
	UINT32                          	                 __rsvd_07[   5];	// 0x05fc ~ 0x060c
	AUD_DEC_NUM_ESSYNC              	aud_dec_num_essync              ;	// 0x0610 : ''
	UINT32                          	aud_dsp0_stc                    ;	// 0x0614 : ''
	UINT32                          	aud_dsp1_stc                    ;	// 0x0618 : ''
	UINT32                          	aud_dec0_frame_cnt              ;	// 0x061c : ''
	UINT32                          	aud_dec1_frame_cnt              ;	// 0x0620 : ''
	UINT32                          	aud_enc_frame_cnt               ;	// 0x0624 : ''
	UINT32                          	aud_debug00_0                   ;	// 0x0628 : ''
	UINT32                          	aud_debug01_0                   ;	// 0x062c : ''
	UINT32                          	aud_debug02_0                   ;	// 0x0630 : ''
	UINT32                          	aud_debug03_0                   ;	// 0x0634 : ''
	UINT32                          	aud_debug00                     ;	// 0x0638 : ''
	UINT32                          	aud_debug01                     ;	// 0x063c : ''
	UINT32                          	aud_debug02                     ;	// 0x0640 : ''
	UINT32                          	aud_debug03                     ;	// 0x0644 : ''
	AUD_DBG_MIX_CH0                 	aud_dbg_mix_ch0                 ;	// 0x0648 : ''
	AUD_DBG_MIX_CH1                 	aud_dbg_mix_ch1                 ;	// 0x064c : ''
	AUD_DBG_MIX_CH2                 	aud_dbg_mix_ch2                 ;	// 0x0650 : ''
	AUD_DBG_MIX_CH3                 	aud_dbg_mix_ch3                 ;	// 0x0654 : ''
	AUD_DBG_MIX_CH4                 	aud_dbg_mix_ch4                 ;	// 0x0658 : ''
	AUD_DBG_MIX_CH5                 	aud_dbg_mix_ch5                 ;	// 0x065c : ''
	UINT32                          	                 __rsvd_08[  10];	// 0x0660 ~ 0x0684
	AUD_DBG_SPKOUT_INFO0            	aud_dbg_spkout_info0            ;	// 0x0688 : ''
	AUD_DBG_SPKOUT_INFO1            	aud_dbg_spkout_info1            ;	// 0x068c : ''
	AUD_DBG_HPOUT_INFO0             	aud_dbg_hpout_info0             ;	// 0x0690 : ''
	AUD_DBG_HPOUT_INFO1             	aud_dbg_hpout_info1             ;	// 0x0694 : ''
	AUD_DBG_SPDIFOUT_INFO0          	aud_dbg_spdifout_info0          ;	// 0x0698 : ''
	AUD_DBG_SPDIFOUT_INFO1          	aud_dbg_spdifout_info1          ;	// 0x069c : ''
	AUD_DBG_SCARTOUT_INFO0          	aud_dbg_scartout_info0          ;	// 0x06a0 : ''
	AUD_DBG_SCARTOUT_INFO1          	aud_dbg_scartout_info1          ;	// 0x06a4 : ''
	AUD_DBG_LINEOUT_INFO0           	aud_dbg_lineout_info0           ;	// 0x06a8 : ''
	AUD_DBG_LINEOUT_INFO1           	aud_dbg_lineout_info1           ;	// 0x06ac : ''
	AUD_DBG_LIPSYNC0_INFO0          	aud_dbg_lipsync0_info0          ;	// 0x06b0 : ''
	AUD_DBG_LIPSYNC0_INFO1          	aud_dbg_lipsync0_info1          ;	// 0x06b4 : ''
	AUD_DBG_LIPSYNC1_INFO0          	aud_dbg_lipsync1_info0          ;	// 0x06b8 : ''
	AUD_DBG_LIPSYNC1_INFO1          	aud_dbg_lipsync1_info1          ;	// 0x06bc : ''
	UINT32                          	aud_dbg_reserved0               ;	// 0x06c0 : ''
	UINT32                          	aud_dbg_reserved1               ;	// 0x06c4 : ''
	UINT32                          	aud_dbg_reserved2               ;	// 0x06c8 : ''
	UINT32                          	aud_dbg_reserved3               ;	// 0x06cc : ''
	UINT32                          	aud_dbg_reserved4               ;	// 0x06d0 : ''
	UINT32                          	aud_dbg_dsp0_reset              ;	// 0x06d4 : ''
	AUD_DBG_DSP1_RESET              	aud_dbg_dsp1_reset              ;	// 0x06d8 : ''
	AUD_DBG_AD_INFO                 	aud_dbg_ad_info                 ;	// 0x06dc : ''
	AUD_DBG_SE_INFO0                	aud_dbg_se_info0                ;	// 0x06e0 : ''
	AUD_DBG_SE_INFO1                	aud_dbg_se_info1                ;	// 0x06e4 : ''
	AUD_DBG_SRC0_INFO               	aud_dbg_src0_info               ;	// 0x06e8 : ''
	AUD_DBG_SRC1_INFO               	aud_dbg_src1_info               ;	// 0x06ec : ''
	AUD_DBG_SRC2_INFO               	aud_dbg_src2_info               ;	// 0x06f0 : ''
	AUD_DBG_SRC3_INFO               	aud_dbg_src3_info               ;	// 0x06f4 : ''
	AUD_DBG_SRC4_INFO               	aud_dbg_src4_info               ;	// 0x06f8 : ''
	AUD_DBG_SRC5_INFO               	aud_dbg_src5_info               ;	// 0x06fc : ''
} AUD_REG_T;
/* 293 regs, 293 types */

/* 293 regs, 293 types in Total*/

/*
 * @{
 * Naming for register pointer.
 * gpRealRegAUD : real register of AUD.
 * gpRegAUD     : shadow register.
 *
 * @def AUD_RdFL: Read  FLushing : Shadow <- Real.
 * @def AUD_WrFL: Write FLushing : Shadow -> Real.
 * @def AUD_Rd  : Read  whole register(UINT32) from Shadow register.
 * @def AUD_Wr  : Write whole register(UINT32) from Shadow register.
 * @def AUD_Rd01 ~ AUD_Rdnn: Read  given '01~nn' fields from Shadow register.
 * @def AUD_Wr01 ~ AUD_Wrnn: Write given '01~nn' fields to   Shadow register.
 * */
#define AUD_RdFL(_r)			((gpRegAUD->_r)=(gpRealRegAUD->_r))
#define AUD_WrFL(_r)			((gpRealRegAUD->_r)=(gpRegAUD->_r))

#define AUD_Rd(_r)			*((UINT32*)(&(gpRegAUD->_r)))
#define AUD_Wr(_r,_v)			((AUD_Rd(_r))=((UINT32)(_v)))

#define AUD_Rd01(_r,_f01,_v01)													\
