/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2010 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 

/*-----------------------------------------------------------------------------
	0x1100 ov_ctrl0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	main_444                        : 1,	//     0
	                                : 3,	//  1: 3 reserved
	main_lsr_2b                     : 2,	//  4: 5
	main_cflt_mode                  : 2,	//  6: 7
	sub_444                         : 1,	//     8
	                                : 3,	//  9:11 reserved
	sub_lsr_2b                      : 2,	// 12:13
	sub_cflt_mode                   : 2;	// 14:15
} OV_CTRL0;

/*-----------------------------------------------------------------------------
	0x1104 ov_ctrl1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	border_color_cr                 : 4,	//  0: 3
	border_color_cb                 : 4,	//  4: 7
	border_color_yy                 : 8,	//  8:15
	load_enable                     : 1,	//    16
	load_type                       : 1;	//    17
} OV_CTRL1;

/*-----------------------------------------------------------------------------
	0x1108 ov_ctrl2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	back_color_cr                   : 4,	//  0: 3
	back_color_cb                   : 4,	//  4: 7
	back_color_yy                   : 8,	//  8:15
	dark_color_cr                   : 4,	// 16:19
	dark_color_cb                   : 4,	// 20:23
	dark_color_yy                   : 8;	// 24:31
} OV_CTRL2;

/*-----------------------------------------------------------------------------
	0x110c ov_ctrl3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	w0_blending_alpha               : 8,	//  0: 7
	w1_blending_alpha               : 8,	//  8:15
	w0_blend_en                     : 1,	//    16
	w1_blend_en                     : 1,	//    17
	w1_blend_with                   : 1,	//    18
	large_win                       : 1,	//    19
	w0_dark_en                      : 1,	//    20
	w1_dark_en                      : 1;	//    21
} OV_CTRL3;

/*-----------------------------------------------------------------------------
	0x1110 ov_moffset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	w0_hoffset                      :11,	//  0:10
	                                : 5,	// 11:15 reserved
	w0_voffset                      :12;	// 16:27
} OV_MOFFSET;

/*-----------------------------------------------------------------------------
	0x1114 ov_msize ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	w0_hsize                        :11,	//  0:10
	                                : 5,	// 11:15 reserved
	w0_vsize                        :12;	// 16:27
} OV_MSIZE;

/*-----------------------------------------------------------------------------
	0x1118 ov_soffset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	w1_hoffset                      :11,	//  0:10
	                                : 5,	// 11:15 reserved
	w1_voffset                      :11;	// 16:26
} OV_SOFFSET;

/*-----------------------------------------------------------------------------
	0x111c ov_ssize ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	w1_hsize                        :11,	//  0:10
	                                : 5,	// 11:15 reserved
	w1_vsize                        :11;	// 16:26
} OV_SSIZE;

/*-----------------------------------------------------------------------------
	0x1120 ov_border_width ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	w1_right_wid                    : 4,	//  0: 3
	w1_left_wid                     : 4,	//  4: 7
	w1_down_wid                     : 4,	//  8:11
	w1_up_wid                       : 4,	// 12:15
	w0_right_wid                    : 4,	// 16:19
	w0_left_wid                     : 4,	// 20:23
	w0_down_wid                     : 4,	// 24:27
	w0_up_wid                       : 4;	// 28:31
} OV_BORDER_WIDTH;

/*-----------------------------------------------------------------------------
	0x1124 cflt_coef0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cflt_coef_1                     :12,	//  0:11
	                                : 4,	// 12:15 reserved
	cflt_coef_0                     :12;	// 16:27
} CFLT_COEF0;

/*-----------------------------------------------------------------------------
	0x1128 cflt_coef1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cflt_coef_3                     :12,	//  0:11
	                                : 4,	// 12:15 reserved
	cflt_coef_2                     :12;	// 16:27
} CFLT_COEF1;

/*-----------------------------------------------------------------------------
	0x1130 ov_param_by_ddr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 9,	//  0: 8 reserved
	stride                          : 2,	//  9:10
	                                : 5,	// 11:15 reserved
	vsize                           : 8,	// 16:23
	                                : 6,	// 24:29 reserved
	endian_conversion               : 1,	//    30
	update_by_ddr                   : 1;	//    31
} OV_PARAM_BY_DDR;

/*-----------------------------------------------------------------------------
	0x1140 ov_intr_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	intr_enable                     : 1,	//     0
	intr_line_pos_enable            : 1,	//     1
	                                : 6,	//  2: 7 reserved
	intr_sbuf_c_empty_en            : 1,	//     8
	intr_sbuf_y_empty_en            : 1,	//     9
	intr_mbuf_c_empty_en            : 1,	//    10
	intr_mbuf_y_empty_en            : 1,	//    11
	intr_pdb_end_en                 : 1,	//    12
	                                : 3,	// 13:15 reserved
	line_position                   :11;	// 16:26
} OV_INTR_CTRL;

/*-----------------------------------------------------------------------------
	0x1144 ov_intr_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sbuf_c_empty                    : 1,	//     0
	sbuf_y_empty                    : 1,	//     1
	mbuf_c_empty                    : 1,	//     2
	mbuf_y_empty                    : 1,	//     3
	                                :12,	//  4:15 reserved
	line_cnt                        :11;	// 16:26
} OV_INTR_STATUS;

typedef struct {
	OV_CTRL0                        	ov_ctrl0                        ;	// 0x1100 : ''
	OV_CTRL1                        	ov_ctrl1                        ;	// 0x1104 : ''
	OV_CTRL2                        	ov_ctrl2                        ;	// 0x1108 : ''
	OV_CTRL3                        	ov_ctrl3                        ;	// 0x110c : ''
	OV_MOFFSET                      	ov_moffset                      ;	// 0x1110 : ''
	OV_MSIZE                        	ov_msize                        ;	// 0x1114 : ''
	OV_SOFFSET                      	ov_soffset                      ;	// 0x1118 : ''
	OV_SSIZE                        	ov_ssize                        ;	// 0x111c : ''
	OV_BORDER_WIDTH                 	ov_border_width                 ;	// 0x1120 : ''
	CFLT_COEF0                      	cflt_coef0                      ;	// 0x1124 : ''
	CFLT_COEF1                      	cflt_coef1                      ;	// 0x1128 : ''
	UINT32                          	                 __rsvd_00[   1];	// 0x112c
	OV_PARAM_BY_DDR                 	ov_param_by_ddr                 ;	// 0x1130 : ''
	UINT32                          	                 __rsvd_01[   3];	// 0x1134 ~ 0x113c
	OV_INTR_CTRL                    	ov_intr_ctrl                    ;	// 0x1140 : ''
	OV_INTR_STATUS                  	ov_intr_status                  ;	// 0x1144 : ''
} ov_top_REG_T;
/* 14 regs, 14 types */

/* 14 regs, 14 types in Total*/

/*
 * @{
 * Naming for register pointer.
 * gpRealRegov_top : real register of ov_top.
 * gpRegov_top     : shadow register.
 *
 * @def ov_top_RdFL: Read  FLushing : Shadow <- Real.
 * @def ov_top_WrFL: Write FLushing : Shadow -> Real.
 * @def ov_top_Rd  : Read  whole register(UINT32) from Shadow register.
 * @def ov_top_Wr  : Write whole register(UINT32) from Shadow register.
 * @def ov_top_Rd01 ~ ov_top_Rdnn: Read  given '01~nn' fields from Shadow register.
 * @def ov_top_Wr01 ~ ov_top_Wrnn: Write given '01~nn' fields to   Shadow register.
 * */
#define ov_top_RdFL(_r)			((gpRegov_top->_r)=(gpRealRegov_top->_r))
#define ov_top_WrFL(_r)			((gpRealRegov_top->_r)=(gpRegov_top->_r))

#define ov_top_Rd(_r)			*((UINT32*)(&(gpRegov_top->_r)))
#define ov_top_Wr(_r,_v)			((ov_top_Rd(_r))=((UINT32)(_v)))

