/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2010 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 

/*-----------------------------------------------------------------------------
	0x0300 pe0_load ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	load_time                       : 1,	//     0
	load_enable                     : 1,	//     1
	load_type                       : 1;	//     2
} PE0_LOAD;

/*-----------------------------------------------------------------------------
	0x0304 pe0_intr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	intr_enable                     : 1,	//     0
	                                : 3,	//  1: 3 reserved
	intr_src                        : 3,	//  4: 6
	                                : 9,	//  7:15 reserved
	intr_line_pos                   :11;	// 16:26
} PE0_INTR;

/*-----------------------------------------------------------------------------
	0x0308 pe0_status0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tnr_frame_id                    : 4,	//  0: 3
	ipc_frame_id                    : 4,	//  4: 7
	tnrw_y_frame_id                 : 4,	//  8:11
	tnrw_c_frame_id                 : 4,	// 12:15
	dnr_frame_id                    : 8,	// 16:23
	pic_init_frame_id               : 4;	// 24:27
} PE0_STATUS0;

/*-----------------------------------------------------------------------------
	0x030c pe0_status1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	line_cnt                        :11;	//  0:10
} PE0_STATUS1;

/*-----------------------------------------------------------------------------
	0x0310 pe0_opmode ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tnr_c_en                        : 1,	//     0
	tnr_y_en                        : 1,	//     1
	ipc_c_en                        : 1,	//     2
	ipc_y_en                        : 1,	//     3
	tnr_c_444_as_420                : 1,	//     4
	tnr_y2_en                       : 1,	//     5
	force_420                       : 1;	//     6
} PE0_OPMODE;

/*-----------------------------------------------------------------------------
	0x0314 pe0_src_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hsize                           :11,	//  0:10
	                                : 2,	// 11:12 reserved
	cs_type                         : 3,	// 13:15
	vsize                           :11,	// 16:26
	                                : 4,	// 27:30 reserved
	scan_type                       : 1;	//    31
} PE0_SRC_SIZE;

/*-----------------------------------------------------------------------------
	0x0318 pe0_field ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	field_id                        : 1;	//     0
} PE0_FIELD;

/*-----------------------------------------------------------------------------
	0x031c pe0_param_by_ddr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 9,	//  0: 8 reserved
	stride                          : 2,	//  9:10
	                                : 5,	// 11:15 reserved
	vsize                           : 8,	// 16:23
	                                : 6,	// 24:29 reserved
	endian                          : 1,	//    30
	update_by_ddr                   : 1;	//    31
} PE0_PARAM_BY_DDR;

/*-----------------------------------------------------------------------------
	0x0320 win_ctrl_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x0                              :11,	//  0:10
	                                : 5,	// 11:15 reserved
	y0                              :11;	// 16:26
} WIN_CTRL_0;

/*-----------------------------------------------------------------------------
	0x0324 win_ctrl_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x1                              :11,	//  0:10
	                                : 5,	// 11:15 reserved
	y1                              :11;	// 16:26
} WIN_CTRL_1;

/*-----------------------------------------------------------------------------
	0x0328 win_ctrl_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x0                              :11,	//  0:10
	                                : 5,	// 11:15 reserved
	y0                              :11,	// 16:26
	                                : 1,	//    27 reserved
	ac_bnr_feature_cal_mode         : 2;	// 28:29
} WIN_CTRL_2;

/*-----------------------------------------------------------------------------
	0x032c win_ctrl_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x1                              :11,	//  0:10
	                                : 5,	// 11:15 reserved
	y1                              :11;	// 16:26
} WIN_CTRL_3;

/*-----------------------------------------------------------------------------
	0x0330 bbd_ctrl_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x0                              :11,	//  0:10
	                                : 5,	// 11:15 reserved
	y0                              :11;	// 16:26
} BBD_CTRL_1;

/*-----------------------------------------------------------------------------
	0x0334 bbd_ctrl_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x1                              :11,	//  0:10
	                                : 5,	// 11:15 reserved
	y1                              :11;	// 16:26
} BBD_CTRL_2;

/*-----------------------------------------------------------------------------
	0x0338 bbd_stat_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x0                              :11,	//  0:10
	                                : 5,	// 11:15 reserved
	y0                              :11;	// 16:26
} BBD_STAT_0;

/*-----------------------------------------------------------------------------
	0x033c bbd_stat_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x1                              :11,	//  0:10
	y1                              :11,	// 11:21
	apl_y                           :10;	// 22:31
} BBD_STAT_1;

/*-----------------------------------------------------------------------------
	0x0340 tnr_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tnr_enable                      : 1,	//     0
	                                : 5,	//  1: 5 reserved
	scene_change_prev_hist_calc_en  : 1,	//     6
	frame_skip_enable_for_3d        : 1,	//     7
	calc_motion_sample_mode         : 2,	//  8: 9
	hist_motion_sample_mode         : 2,	// 10:11
	calc_motion_median_bypass       : 2,	// 12:13
	hist_motion_median_bypass       : 2,	// 14:15
	calc_motion_max_yc              : 1,	//    16
	hist_motion_max_yc              : 1,	//    17
	average_win_for_color_region    : 2,	// 18:19
	average_win_for_nr_calc         : 2,	// 20:21
	                                : 1,	//    22 reserved
	variance_sample_mode            : 1,	//    23
	scene_change_enable             : 1,	//    24
	scene_change_th                 : 7;	// 25:31
} TNR_CTRL_00;

/*-----------------------------------------------------------------------------
	0x0344 tnr_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_th_lo                         :10,	//  0: 9
	                                : 2,	// 10:11 reserved
	y_th_hi                         :10,	// 12:21
	svar_input_ctrl                 : 2,	// 22:23
	svar_hist_n_pct                 : 8;	// 24:31
} TNR_CTRL_01;

/*-----------------------------------------------------------------------------
	0x0348 tnr_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ns_g_fit_th0                    : 8,	//  0: 7
	ns_g_fit_th1                    : 8,	//  8:15
	ns_x_pn_minus                   : 4,	// 16:19
	                                : 4,	// 20:23 reserved
	ns_iir_alpha                    : 8;	// 24:31
} TNR_CTRL_02;

/*-----------------------------------------------------------------------------
	0x034c tnr_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wa_min                          : 8,	//  0: 7
	wa_max                          : 8,	//  8:15
	wa_k                            : 7,	// 16:22
	                                : 1,	//    23 reserved
	tnr_hist_wa_th                  : 8;	// 24:31
} TNR_CTRL_03;

/*-----------------------------------------------------------------------------
	0x0350 tnr_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	nl_peak0                        : 8,	//  0: 7
	nl_peak1                        : 8,	//  8:15
	nl_peak2                        : 8,	// 16:23
	nl_peak3                        : 8;	// 24:31
} TNR_CTRL_04;

/*-----------------------------------------------------------------------------
	0x0354 tnr_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	nt_min                          : 8,	//  0: 7
	nt_max                          : 8,	//  8:15
	gm_low                          : 8,	// 16:23
	gm_high                         : 8;	// 24:31
} TNR_CTRL_05;

/*-----------------------------------------------------------------------------
	0x0358 tnr_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	nt_at_as_th                     : 8,	//  0: 7
	nt_iir_alpha                    : 8,	//  8:15
	adj_alpha_k0                    : 8,	// 16:23
	adj_alpha_k1                    : 8;	// 24:31
} TNR_CTRL_06;

/*-----------------------------------------------------------------------------
	0x035c tnr_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	alpha_lut_ind0                  : 8,	//  0: 7
	alpha_lut_ind1                  : 8,	//  8:15
	alpha_lut_ind2                  : 8,	// 16:23
	alpha_lut_ind3                  : 8;	// 24:31
} TNR_CTRL_07;

/*-----------------------------------------------------------------------------
	0x0360 tnr_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	alpha_lut_ind4                  : 8,	//  0: 7
	alpha_lut_ind5                  : 8,	//  8:15
	alpha_lut_ind6                  : 8,	// 16:23
	adj_alpha_nt_lvl_th             : 8;	// 24:31
} TNR_CTRL_08;

/*-----------------------------------------------------------------------------
	0x0364 tnr_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	occ_area_a_th_l                 : 8,	//  0: 7
	occ_area_a_th_h                 : 8,	//  8:15
	occ_area_wa_th_l                : 8,	// 16:23
	occ_area_wa_th_h                : 8;	// 24:31
} TNR_CTRL_09;

/*-----------------------------------------------------------------------------
	0x0368 tnr_ctrl_10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dbg_show_tnr_param              : 5,	//  0: 4
	                                : 3,	//  5: 7 reserved
	dbg_force_wa                    : 1,	//     8
	dbg_force_calc_motion           : 1,	//     9
	dbg_force_lut_alpha             : 1,	//    10
	dbg_force_adj_alpha             : 1,	//    11
	dbg_force_final_alpha           : 1,	//    12
	dbg_force_beta                  : 1,	//    13
	chroma_polarity_check           : 1,	//    14
	ignore_active_window            : 1,	//    15
	dbg_tnrw_port_ctrl              : 2,	// 16:17
	                                : 6,	// 18:23 reserved
	dbg_wa                          : 8;	// 24:31
} TNR_CTRL_10;

/*-----------------------------------------------------------------------------
	0x036c tnr_ctrl_11 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dbg_calc_motion                 : 8,	//  0: 7
	dbg_alpha                       : 8,	//  8:15
	                                : 8,	// 16:23 reserved
	dbg_beta                        : 8;	// 24:31
} TNR_CTRL_11;

/*-----------------------------------------------------------------------------
	0x0370 tnr_ctrl_12 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	force_ns_lvl                    : 1,	//     0
	                                : 7,	//  1: 7 reserved
	force_ns_lvl_val                : 8,	//  8:15
	adjust_ns_lvl                   : 1,	//    16
	                                : 7,	// 17:23 reserved
	adjust_ns_lvl_val               : 8;	// 24:31
} TNR_CTRL_12;

/*-----------------------------------------------------------------------------
	0x0374 tnr_ctrl_13 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	force_nt_lvl                    : 1,	//     0
	                                : 7,	//  1: 7 reserved
	force_nt_lvl_val                : 8,	//  8:15
	adjust_nt_lvl                   : 1,	//    16
	                                : 7,	// 17:23 reserved
	adjust_nt_lvl_val               : 8;	// 24:31
} TNR_CTRL_13;

/*-----------------------------------------------------------------------------
	0x0378 tnr_ctrl_14 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x037c tnr_ctrl_15 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0380 tnr_ctrl_16 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	show_dbg_bar_ctrl0              : 8,	//  0: 7
	show_dbg_bar_ctrl1              : 8,	//  8:15
	show_dbg_bar_ctrl2              : 8,	// 16:23
	show_dbg_bar_ctrl3              : 8;	// 24:31
} TNR_CTRL_16;

/*-----------------------------------------------------------------------------
	0x0384 tnr_ctrl_17 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	show_dbg_bar_ctrl4              : 8;	//  0: 7
} TNR_CTRL_17;

/*-----------------------------------------------------------------------------
	0x0388 tnr_ctrl_18 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	crgn_gain_enable                : 1,	//     0
	luma_gain_enable                : 1,	//     1
	saturation_gain_enable          : 1,	//     2
	                                : 1,	//     3 reserved
	input_for_luma                  : 2,	//  4: 5
	                                : 2,	//  6: 7 reserved
	input_for_crgn_satr             : 1,	//     8
	                                : 7,	//  9:15 reserved
	y_gain                          : 8,	// 16:23
	c_gain                          : 8;	// 24:31
} TNR_CTRL_18;

/*-----------------------------------------------------------------------------
	0x038c tnr_ctrl_19 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	luma_gain_p0_x                  : 8,	//  0: 7
	luma_gain_p1_x                  : 8,	//  8:15
	luma_gain_p2_x                  : 8,	// 16:23
	luma_gain_p3_x                  : 8;	// 24:31
} TNR_CTRL_19;

/*-----------------------------------------------------------------------------
	0x0390 tnr_ctrl_20 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	luma_gain_p4_x                  : 8,	//  0: 7
	luma_gain_p5_x                  : 8,	//  8:15
	luma_gain_p6_x                  : 8,	// 16:23
	luma_gain_p7_x                  : 8;	// 24:31
} TNR_CTRL_20;

/*-----------------------------------------------------------------------------
	0x0394 tnr_ctrl_21 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	luma_gain_p0_y                  : 8,	//  0: 7
	luma_gain_p1_y                  : 8,	//  8:15
	luma_gain_p2_y                  : 8,	// 16:23
	luma_gain_p3_y                  : 8;	// 24:31
} TNR_CTRL_21;

/*-----------------------------------------------------------------------------
	0x0398 tnr_ctrl_22 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	luma_gain_p4_y                  : 8,	//  0: 7
	luma_gain_p5_y                  : 8,	//  8:15
	luma_gain_p6_y                  : 8,	// 16:23
	luma_gain_p7_y                  : 8;	// 24:31
} TNR_CTRL_22;

/*-----------------------------------------------------------------------------
	0x039c tnr_ctrl_23 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	saturation_gain_p0_x            : 8,	//  0: 7
	saturation_gain_p1_x            : 8,	//  8:15
	saturation_gain_p2_x            : 8,	// 16:23
	saturation_gain_p3_x            : 8;	// 24:31
} TNR_CTRL_23;

/*-----------------------------------------------------------------------------
	0x03a0 tnr_ctrl_24 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	saturation_gain_p4_x            : 8,	//  0: 7
	saturation_gain_p5_x            : 8,	//  8:15
	saturation_gain_p6_x            : 8,	// 16:23
	saturation_gain_p7_x            : 8;	// 24:31
} TNR_CTRL_24;

/*-----------------------------------------------------------------------------
	0x03a4 tnr_ctrl_25 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	saturation_gain_p0_y            : 8,	//  0: 7
	saturation_gain_p1_y            : 8,	//  8:15
	saturation_gain_p2_y            : 8,	// 16:23
	saturation_gain_p3_y            : 8;	// 24:31
} TNR_CTRL_25;

/*-----------------------------------------------------------------------------
	0x03a8 tnr_ctrl_26 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	saturation_gain_p4_y            : 8,	//  0: 7
	saturation_gain_p5_y            : 8,	//  8:15
	saturation_gain_p6_y            : 8,	// 16:23
	saturation_gain_p7_y            : 8;	// 24:31
} TNR_CTRL_26;

/*-----------------------------------------------------------------------------
	0x03ac tnr_ctrl_27 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	crgn_gain_in_rgn0               : 8,	//  0: 7
	crgn_gain_out_rgn0              : 8,	//  8:15
	crgn_gain_in_rgn1               : 8,	// 16:23
	crgn_gain_out_rgn1              : 8;	// 24:31
} TNR_CTRL_27;

/*-----------------------------------------------------------------------------
	0x03b0 tnr_ctrl_28 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	crgn_gain_in_rgn2               : 8,	//  0: 7
	crgn_gain_out_rgn2              : 8,	//  8:15
	crgn_gain_in_rgn3               : 8,	// 16:23
	crgn_gain_out_rgn3              : 8;	// 24:31
} TNR_CTRL_28;

/*-----------------------------------------------------------------------------
	0x03b4 tnr_ctrl_29 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x03b8 tnr_ctrl_30 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x03bc tnr_ctrl_31 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x03c0 tnr_status_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x_avg_t                         : 8,	//  0: 7
	x_peak_t2                       : 8,	//  8:15
	nt_lvl                          : 8,	// 16:23
	scene_change                    : 8;	// 24:31
} TNR_STATUS_00;

/*-----------------------------------------------------------------------------
	0x03c4 tnr_status_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x_avg_s                         : 8,	//  0: 7
	x_peak_s                        : 8,	//  8:15
	ns_lvl                          : 8;	// 16:23
} TNR_STATUS_01;

/*-----------------------------------------------------------------------------
	0x03c8 tnr_status_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	g_fit                           : 8,	//  0: 7
	x_pn_s                          : 8,	//  8:15
	gm                              : 8,	// 16:23
	lp                              : 8;	// 24:31
} TNR_STATUS_02;

/*-----------------------------------------------------------------------------
	0x03cc tnr_status_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sum_of_temp_pel_diff            :29;	//  0:28
} TNR_STATUS_03;

/*-----------------------------------------------------------------------------
	0x03d0 tnr_main_lut_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	main_lut_indir_addr             : 4,	//  0: 3
	                                : 8,	//  4:11 reserved
	main_lut_ai_enable              : 1;	//    12
} TNR_MAIN_LUT_00;

/*-----------------------------------------------------------------------------
	0x03d4 tnr_main_lut_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	main_lut_indir_data0            ;   	// 31: 0
} TNR_MAIN_LUT_01;

/*-----------------------------------------------------------------------------
	0x03d8 tnr_main_lut_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	main_lut_indir_data1            ;   	// 31: 0
} TNR_MAIN_LUT_02;

/*-----------------------------------------------------------------------------
	0x03dc ti_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ti_h_enable                     : 1,	//     0
	ti_h_filter                     : 1,	//     1
	                                : 6,	//  2: 7 reserved
	ti_v_enable                     : 1,	//     8
	ti_v_filter                     : 1,	//     9
	                                : 6,	// 10:15 reserved
	ti_h_gain                       : 8,	// 16:23
	ti_v_gain                       : 8;	// 24:31
} TI_CTRL;

/*-----------------------------------------------------------------------------
	0x03e0 tnr_nt_lvl_lut_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	nt_lvl_lut_indir_addr           : 3,	//  0: 2
	                                : 9,	//  3:11 reserved
	nt_lvl_lut_ai_enable            : 1;	//    12
} TNR_NT_LVL_LUT_00;

/*-----------------------------------------------------------------------------
	0x03e4 tnr_nt_lvl_lut_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	nt_lvl_lut_indir_data0          ;   	// 31: 0
} TNR_NT_LVL_LUT_01;

/*-----------------------------------------------------------------------------
	0x03e8 tnr_nt_lvl_lut_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	nt_lvl_lut_indir_data1          ;   	// 31: 0
} TNR_NT_LVL_LUT_02;

/*-----------------------------------------------------------------------------
	0x03ec tnr_nt_lvl_lut_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	nt_lvl_lut_indir_data2          ;   	// 31: 0
} TNR_NT_LVL_LUT_03;

/*-----------------------------------------------------------------------------
	0x03f0 tnr_crg_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	crgn_ctrl_indir_addr            : 8,	//  0: 7
	crgn_ctrl_crgn_sel              : 3,	//  8:10
	                                : 1,	//    11 reserved
	crgn_ctrl_ai_enable             : 1,	//    12
	crgn_ctrl_hsv_csc_scaler_en     : 1,	//    13
	crgn_ctrl_csc_sel               : 1,	//    14
	crgn_ctrl_access_off            : 1;	//    15
} TNR_CRG_CTRL_00;

/*-----------------------------------------------------------------------------
	0x03f4 tnr_crg_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	crgn_ctrl_indir_data            ;   	// 31: 0
} TNR_CRG_CTRL_01;

/*-----------------------------------------------------------------------------
	0x03f8 sqm_ctrl_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	charcter_delta_limit            : 8,	//  0: 7
	boundary_width                  : 8,	//  8:15
	vedio_height__top_to_8_reg      : 8;	// 16:23
} SQM_CTRL_2;

/*-----------------------------------------------------------------------------
	0x03fc sqm_ctrl_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_threshold                    : 8,	//  0: 7
	pc_delta_limit                  : 8,	//  8:15
	pc_pixel_minimal_limit          : 8;	// 16:23
} SQM_CTRL_3;

/*-----------------------------------------------------------------------------
	0x0400 ipc_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	luma_mode                       : 2,	//  0: 1
	                                : 1,	//     2 reserved
	luma_edi                        : 1,	//     3
	chroma_mode                     : 2,	//  4: 5
	                                : 1,	//     6 reserved
	chroma_edi                      : 1,	//     7
	                                : 8,	//  8:15 reserved
	chroma_diff_for_err_t_coeff     : 4,	// 16:19
	chroma_diff_for_err_t           : 1,	//    20
	                                : 8,	// 21:28 reserved
	film_mode_apply_c               : 1,	//    29
	film_mode_apply_y               : 1,	//    30
	film_mode_enable                : 1;	//    31
} IPC_CTRL_00;

/*-----------------------------------------------------------------------------
	0x0404 ipc_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	spatial_alpha_th0               : 8,	//  0: 7
	spatial_alpha_th1               : 8,	//  8:15
	spatial_filter_tap_ctrl         : 8,	// 16:23
	                                : 7,	// 24:30 reserved
	texture_alpha_use_global_max    : 1;	//    31
} IPC_CTRL_01;

/*-----------------------------------------------------------------------------
	0x0408 ipc_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	v_motion_ratio_min              : 6,	//  0: 5
	                                : 2,	//  6: 7 reserved
	v_motion_ratio_max              : 6,	//  8:13
	                                : 1,	//    14 reserved
	v_motion_detect_en              : 1,	//    15
	fuzzy_ctrl_pt1_l                : 8,	// 16:23
	fuzzy_ctrl_pt1_h                : 8;	// 24:31
} IPC_CTRL_02;

/*-----------------------------------------------------------------------------
	0x040c ipc_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fuzzy_ctrl_pt0                  : 8,	//  0: 7
	fuzzy_ctrl_pt2                  : 8,	//  8:15
	fuzzy_margin0                   : 8,	// 16:23
	fuzzy_margin1                   : 8;	// 24:31
} IPC_CTRL_03;

/*-----------------------------------------------------------------------------
	0x0410 ipc_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fuzzy_ctrl_pt1_err_s            : 8,	//  0: 7
	check_tearing_in_fuzzy_area     : 1,	//     8
	hmc_filter_range_top            :11,	//  9:19
	hmc_filter_range_bottom         :11;	// 20:30
} IPC_CTRL_04;

/*-----------------------------------------------------------------------------
	0x0414 ipc_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hmc_search_range                : 4,	//  0: 3
	                                : 4,	//  4: 7 reserved
	hmc_h_motion_ratio              : 6,	//  8:13
	                                : 2,	// 14:15 reserved
	hmc_lock_filter_half_size       : 3,	// 16:18
	                                : 5,	// 19:23 reserved
	hmc_lock_filter_expand          : 1;	//    24
} IPC_CTRL_05;

/*-----------------------------------------------------------------------------
	0x0418 ipc_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hmc_lock_point_max              : 8,	//  0: 7
	hmc_lock_point_penalty          : 8,	//  8:15
	hmc_lock_point_valid            : 8;	// 16:23
} IPC_CTRL_06;

/*-----------------------------------------------------------------------------
	0x041c ipc_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hmc_enable                      : 1,	//     0
	                                : 7,	//  1: 7 reserved
	hmc_blend_alpha                 : 8,	//  8:15
	hmc_err_t_th                    : 8,	// 16:23
	hmc_pn_diff_max                 : 8;	// 24:31
} IPC_CTRL_07;

/*-----------------------------------------------------------------------------
	0x0420 ipc_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	boundary_mask_y                 : 8,	//  0: 7
	boundary_mask_c                 : 8,	//  8:15
	                                : 8,	// 16:23 reserved
	tnr_debug_mode                  : 1,	//    24
	tnr_debug_black_mask            : 1;	//    25
} IPC_CTRL_08;

/*-----------------------------------------------------------------------------
	0x0424 ipc_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tearing_strength                : 2,	//  0: 1
	tearing_med_filt_lev            : 2,	//  2: 3
	tearing_a_th                    : 6,	//  4: 9
	fmd_a_th                        : 4,	// 10:13
	use_3field_err_t                : 1,	//    14
	two_field_delay_mode            : 1,	//    15
	fmd_margin_top                  : 8,	// 16:23
	fmd_margin_bottom               : 8;	// 24:31
} IPC_CTRL_09;

/*-----------------------------------------------------------------------------
	0x0428 ipc_ctrl_10 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fmd_sw_inter_with               : 2,	//  0: 1
	fmd_hw_interleave_en            : 1,	//     2
	fmd_hw_bad_edit_en              : 1,	//     3
	fmd_sw_cap_flow_detected        : 1,	//     4
	                                : 2,	//  5: 6 reserved
	fmd_diff_pel_cnt_for_pn         : 1,	//     7
	fmd_pel_diff_th_for_pn          : 8,	//  8:15
	fmd_sw_bad_edit_th              :10,	// 16:25
	                                : 2,	// 26:27 reserved
	fmd_measure_scale               : 2,	// 28:29
	loading_time_ctrl               : 1,	//    30
	fmd_sw_bad_edit_en              : 1;	//    31
} IPC_CTRL_10;

/*-----------------------------------------------------------------------------
	0x042c ipc_ctrl_11 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fmd_caption_range_top           :11,	//  0:10
	                                : 5,	// 11:15 reserved
	fmd_caption_range_bot           :11,	// 16:26
	                                : 4,	// 27:30 reserved
	hmc_when_cap_not_detected       : 1;	//    31
} IPC_CTRL_11;

/*-----------------------------------------------------------------------------
	0x0430 ipc_ctrl_12 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fmd_32_enable                   : 1,	//     0
	fmd_22_enable                   : 1,	//     1
	                                : 2,	//  2: 3 reserved
	fmd_hw_bad_edit_mul_th          : 3,	//  4: 6
	                                : 1,	//     7 reserved
	fmd_hw_bad_edit_th_min          : 8,	//  8:15
	                                :12,	// 16:27 reserved
	fmd_22_pcn_small_weight         : 3;	// 28:30
} IPC_CTRL_12;

/*-----------------------------------------------------------------------------
	0x0434 ipc_ctrl_13 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fmd_32_still_th_pn              : 8,	//  0: 7
	fmd_32_still_th_pcn             : 8,	//  8:15
	fmd_32_pn_max_val_min_th0       : 8,	// 16:23
	fmd_32_pn_max_val_min_th1       : 8;	// 24:31
} IPC_CTRL_13;

/*-----------------------------------------------------------------------------
	0x0438 ipc_ctrl_14 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fmd_32_min_field_num            : 4,	//  0: 3
	                                : 4,	//  4: 7 reserved
	fmd_32_pn_min_val_max_th        : 8,	//  8:15
	fmd_32_pn_max_min_ratio0        : 4,	// 16:19
	fmd_32_pn_max_min_ratio1        : 4,	// 20:23
	fmd_32_pcn_small_weight         : 3;	// 24:26
} IPC_CTRL_14;

/*-----------------------------------------------------------------------------
	0x043c ipc_ctrl_15 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fmd_22_still_th_pn              : 8,	//  0: 7
	fmd_22_still_th_pcn             : 8,	//  8:15
	fmd_22_min_val_max_th0          : 8,	// 16:23
	fmd_22_min_val_max_th1          : 8;	// 24:31
} IPC_CTRL_15;

/*-----------------------------------------------------------------------------
	0x0440 ipc_ctrl_16 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fmd_22_min_field_num0           : 4,	//  0: 3
	fmd_22_min_field_num1           : 4,	//  4: 7
	fmd_22_pn_max_val_min_th0       : 8,	//  8:15
	fmd_22_pn_max_val_min_th1       : 8,	// 16:23
	fmd_22_max_min_ratio0           : 4,	// 24:27
	fmd_22_max_min_ratio1           : 4;	// 28:31
} IPC_CTRL_16;

/*-----------------------------------------------------------------------------
	0x0444 ipc_ctrl_17 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dbg_show_mode                   : 5,	//  0: 4
	dbg_show_level                  : 3,	//  5: 7
	dbg_show_scale                  : 3,	//  8:10
	dbg_show_black_mask             : 1,	//    11
	dbg_pprv_to_curr                : 1,	//    12
	dbg_prv3_to_prev                : 1,	//    13
	dbg_curr_to_pprv                : 1,	//    14
	                                : 1,	//    15 reserved
	flat_ctrl_lateral_diff_th       : 4,	// 16:19
	flat_ctrl_vertical_diff_th      : 4,	// 20:23
	flat_ctrl_err_t_bias            : 4,	// 24:27
	flat_ctrl_max_for_vert_calc     : 1,	//    28
	                                : 2,	// 29:30 reserved
	flat_ctrl_enable                : 1;	//    31
} IPC_CTRL_17;

/*-----------------------------------------------------------------------------
	0x0448 ipc_ctrl_18 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	v_filt_ctrl_v_filt_range_top    :11,	//  0:10
	                                : 5,	// 11:15 reserved
	v_filt_ctrl_v_filt_range_bot    :11,	// 16:26
	                                : 4,	// 27:30 reserved
	v_filt_ctrl_hmc_line_info_en    : 1;	//    31
} IPC_CTRL_18;

/*-----------------------------------------------------------------------------
	0x044c ipc_ctrl_19 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	repeat_det_line_cnt_th          : 8,	//  0: 7
	repeat_det_diff_pel_cnt_th      : 8,	//  8:15
	repeat_det_noise_th             : 4;	// 16:19
} IPC_CTRL_19;

/*-----------------------------------------------------------------------------
	0x0450 ipc_status_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	repeat_detected                 : 1,	//     1
	fmd_pc_cnt                      :14,	//  2:15
	fmd_nc_cnt                      :16;	// 16:31
} IPC_STATUS_00;

/*-----------------------------------------------------------------------------
	0x0454 ipc_status_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fmd_pn_cnt                      :16,	//  0:15
	fmd_same_cnt                    :16;	// 16:31
} IPC_STATUS_01;

/*-----------------------------------------------------------------------------
	0x0458 ipc_status_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fmd_hw_32_inter_with            : 2,	//  0: 1
	                                : 1,	//     2 reserved
	fmd_hw_32_detected              : 1,	//     3
	fmd_hw_32_locking_cnt           : 8,	//  4:11
	fmd_hw_22_inter_with            : 2,	// 12:13
	                                : 1,	//    14 reserved
	fmd_hw_22_detected              : 1,	//    15
	fmd_hw_22_locking_cnt           : 8,	// 16:23
	fmd_hw_inter_with               : 2,	// 24:25
	fmd_bad_edit_detected_hw        : 1,	//    26
	fmd_bad_edit_detected_sw        : 1;	//    27
} IPC_STATUS_02;

/*-----------------------------------------------------------------------------
	0x045c ipc_status_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fuzzy_ctrl_pt1                  : 8,	//  0: 7
	repeat_detect_measure           : 8,	//  8:15
	fmd_hw_bad_edit_th              :16;	// 16:31
} IPC_STATUS_03;

/*-----------------------------------------------------------------------------
	0x0460 clc_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cc_filter_enable                : 1,	//     0
	cl_filter_enable                : 1,	//     1
	clc_detection_enable            : 1,	//     2
	                                : 1,	//     3 reserved
	cc_cross_gain0                  : 4,	//  4: 7
	cc_cross_gain1                  : 4,	//  8:11
	cl_ab_ratio                     : 4,	// 12:15
	cl_y_hdistance                  : 2,	// 16:17
	cl_c_hdistance                  : 2,	// 18:19
	cl_var_th                       : 5,	// 20:24
	                                : 1,	//    25 reserved
	cc_margin128                    : 2,	// 26:27
	cl_motion_a_filter              : 1,	//    28
	cl_motion_b_filter              : 1,	//    29
	cc_motion_a_filter              : 1,	//    30
	cc_motion_b_filter              : 1;	//    31
} CLC_CTRL_00;

/*-----------------------------------------------------------------------------
	0x0464 clc_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cl_motion_a_th                  : 8,	//  0: 7
	cl_motion_b_th                  : 8,	//  8:15
	cc_motion_a_th                  : 8,	// 16:23
	cc_motion_b_th                  : 8;	// 24:31
} CLC_CTRL_01;

/*-----------------------------------------------------------------------------
	0x0468 clc_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cl_y_bound_th                   : 7,	//  0: 6
	                                : 1,	//     7 reserved
	cl_c_bound_th                   : 7,	//  8:14
	cl_c_bound_type                 : 1,	//    15
	cl_y_bound_width_chroma         : 2,	// 16:17
	cl_y_bound_ignore_cc            : 1,	//    18
	cl_y_bound_ignore_p2            : 1,	//    19
	cl_y_bound_ignore_p4            : 1;	//    20
} CLC_CTRL_02;

/*-----------------------------------------------------------------------------
	0x046c clc_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cl_sat_min                      : 8,	//  0: 7
	cc_sat_min                      : 8,	//  8:15
	cc_sat_max                      : 8;	// 16:23
} CLC_CTRL_03;

/*-----------------------------------------------------------------------------
	0x0470 clc_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cc_frame_min                    :12,	//  0:11
	cl_frame_min                    :12;	// 12:23
} CLC_CTRL_04;

/*-----------------------------------------------------------------------------
	0x0474 clc_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	clc_c_filter_when_cl_detected   : 1,	//     0
	                                : 1,	//     1 reserved
	clc_y_filter_when_cc_detected   : 2,	//  2: 3
	clc_cc_line_mem_ctrl            : 2,	//  4: 5
	                                : 2,	//  6: 7 reserved
	clc_c_gain                      : 8,	//  8:15
	clc_dbg_show_mask               :12;	// 16:27
} CLC_CTRL_05;

/*-----------------------------------------------------------------------------
	0x0478 clc_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cc_c_filter_gain                : 8,	//  0: 7
	cc_y_filter_when_cc_detected    : 1;	//     8
} CLC_CTRL_06;

/*-----------------------------------------------------------------------------
	0x047c clc_stat_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cc_detection_count              :16,	//  0:15
	cl_detection_count              :16;	// 16:31
} CLC_STAT_00;

/*-----------------------------------------------------------------------------
	0x0480 vflt_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vfilterenable                   : 1,	//     0
	                                : 2,	//  1: 2 reserved
	vfilter_strength                : 1,	//     3
	                                : 4,	//  4: 7 reserved
	vfilter_a_th                    : 7,	//  8:14
	                                : 1,	//    15 reserved
	vfilter_in_field_var            : 8,	// 16:23
	vfilter_use_mc_mask             : 1,	//    24
	vfilter_expand                  : 1,	//    25
	vfilter_center                  : 1,	//    26
	vfilter_ul4                     : 1,	//    27
	dbgshow_level                   : 2,	// 28:29
	                                : 1,	//    30 reserved
	dbgshow_enable                  : 1;	//    31
} VFLT_CTRL;

/*-----------------------------------------------------------------------------
	0x0484 snr_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	snr_enable                      : 1,	//     0
	                                : 3,	//  1: 3 reserved
	display_mode                    : 3,	//  4: 6
	                                : 1,	//     7 reserved
	normalization                   : 4,	//  8:11
	scaling_factor                  : 3,	// 12:14
	                                : 1,	//    15 reserved
	coring_factor                   : 8;	// 16:23
} SNR_CTRL_00;

/*-----------------------------------------------------------------------------
	0x0488 mnr_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mnr_enable                      : 1,	//     0
	edge_gain_mapping_enable        : 1,	//     1
	sel_sd_hd                       : 1,	//     2
	                                : 1,	//     3 reserved
	debug_mode                      : 3;	//  4: 6
} MNR_CTRL_00;

/*-----------------------------------------------------------------------------
	0x048c mnr_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                :16,	//  0:15 reserved
	hcoef_00                        : 4,	// 16:19
	hcoef_01                        : 4,	// 20:23
	hcoef_02                        : 4,	// 24:27
	hcoef_03                        : 4;	// 28:31
} MNR_CTRL_01;

/*-----------------------------------------------------------------------------
	0x0490 mnr_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hcoef_04                        : 4,	//  0: 3
	hcoef_05                        : 4,	//  4: 7
	hcoef_06                        : 4,	//  8:11
	hcoef_07                        : 4,	// 12:15
	hcoef_08                        : 4,	// 16:19
	hcoef_09                        : 4,	// 20:23
	hcoef_10                        : 4,	// 24:27
	hcoef_11                        : 4;	// 28:31
} MNR_CTRL_02;

/*-----------------------------------------------------------------------------
	0x0494 mnr_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hcoef_12                        : 4,	//  0: 3
	hcoef_13                        : 4,	//  4: 7
	hcoef_14                        : 4,	//  8:11
	hcoef_15                        : 4,	// 12:15
	hcoef_16                        : 4,	// 16:19
	                                : 4,	// 20:23 reserved
	x1_position                     : 8;	// 24:31
} MNR_CTRL_03;

/*-----------------------------------------------------------------------------
	0x0498 mnr_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x2_position                     : 8,	//  0: 7
	x3_position                     : 8,	//  8:15
	x4_position                     : 8,	// 16:23
	y1_position                     : 8;	// 24:31
} MNR_CTRL_04;

/*-----------------------------------------------------------------------------
	0x049c mnr_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y2_position                     : 8,	//  0: 7
	y3_position                     : 8,	//  8:15
	y4_position                     : 8,	// 16:23
	filter_threshold                : 8;	// 24:31
} MNR_CTRL_05;

/*-----------------------------------------------------------------------------
	0x04a0 mnr_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vcoef0                          : 4,	//  0: 3
	vcoef1                          : 4,	//  4: 7
	vcoef2                          : 4,	//  8:11
	vcoef3                          : 4,	// 12:15
	vcoef4                          : 4,	// 16:19
	vcoef5                          : 4,	// 20:23
	vcoef6                          : 4;	// 24:27
} MNR_CTRL_06;

/*-----------------------------------------------------------------------------
	0x04a4 edf_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	edf_data_processing             : 3,	//  0: 2
	                                : 1,	//     3 reserved
	debug_scaling_factor            : 2,	//  4: 5
	debug_make_diff                 : 2,	//  6: 7
	sign_change_feed_data           : 3,	//  8:10
	                                : 5,	// 11:15 reserved
	number_of_sign_change_th1       : 6,	// 16:21
	                                : 2,	// 22:23 reserved
	number_of_sign_change_th0       : 6;	// 24:29
} EDF_CTRL_00;

/*-----------------------------------------------------------------------------
	0x04a8 edf_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	coefficient_of_alpha1           : 8,	//  0: 7
	coefficient_of_alpha0           : 8;	//  8:15
} EDF_CTRL_01;

/*-----------------------------------------------------------------------------
	0x04ac bnr_dc_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dc_bnr_enable                   : 1,	//     0
	                                : 3,	//  1: 3 reserved
	sd_hd_sel                       : 1,	//     4
	output_mux                      : 3,	//  5: 7
	offset                          :13,	//  8:20
	                                : 3,	// 21:23 reserved
	gain                            : 8;	// 24:31
} BNR_DC_CTRL_00;

/*-----------------------------------------------------------------------------
	0x04b0 bnr_dc_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blur_enable                     : 2;	//  0: 1
} BNR_DC_CTRL_01;

/*-----------------------------------------------------------------------------
	0x04b4 bnr_dc_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dc_bnr_gain_ctrl_y2             : 8,	//  0: 7
	dc_bnr_gain_ctrl_x2             : 8,	//  8:15
	dc_bnr_gain_ctrl_y3             : 8,	// 16:23
	dc_bnr_gain_ctrl_x3             : 8;	// 24:31
} BNR_DC_CTRL_02;

/*-----------------------------------------------------------------------------
	0x04b8 bnr_dc_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dc_bnr_gain_ctrl_y0             : 8,	//  0: 7
	dc_bnr_gain_ctrl_x0             : 8,	//  8:15
	dc_bnr_gain_ctrl_y1             : 8,	// 16:23
	dc_bnr_gain_ctrl_x1             : 8;	// 24:31
} BNR_DC_CTRL_03;

/*-----------------------------------------------------------------------------
	0x04bc bbd_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	black_boundary_detection_enable : 1,	//     0
	hysterisis_mode                 : 5,	//  1: 5
	op_mode                         : 1,	//     6
	                                : 1,	//     7 reserved
	cnt_th                          : 8,	//  8:15
	diff_th                         : 8;	// 16:23
} BBD_CTRL_00;

/*-----------------------------------------------------------------------------
	0x04c0 bnr_ac_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnr_h_en                        : 1,	//     0
	bnr_v_en                        : 1,	//     1
	                                : 2,	//  2: 3 reserved
	source_type                     : 1,	//     4
	status_read_type                : 1,	//     5
	status_read_mode                : 2,	//  6: 7
	hbmax_gain                      : 4,	//  8:11
	vbmax_gain                      : 4,	// 12:15
	strength_resolution             : 1,	//    16
	                                : 3,	// 17:19 reserved
	fiter_type                      : 1,	//    20
	                                : 3,	// 21:23 reserved
	output_mux                      : 2;	// 24:25
} BNR_AC_CTRL_00;

/*-----------------------------------------------------------------------------
	0x04c4 bnr_ac_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	strength_h_x0                   : 8,	//  0: 7
	strength_h_x1                   : 8,	//  8:15
	strength_h_max                  : 8;	// 16:23
} BNR_AC_CTRL_01;

/*-----------------------------------------------------------------------------
	0x04c8 bnr_ac_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	strength_v_x0                   : 8,	//  0: 7
	strength_v_x1                   : 8,	//  8:15
	strength_v_max                  : 8;	// 16:23
} BNR_AC_CTRL_02;

/*-----------------------------------------------------------------------------
	0x04cc bnr_ac_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	h_offset_mode                   : 1,	//     0
	manual_offset_h_value           : 3,	//  1: 3
	v_offset_mode                   : 1,	//     4
	manual_offset_v_value           : 3,	//  5: 7
	use_of_hysterisis               : 4,	//  8:11
	                                : 4,	// 12:15 reserved
	t_filter_weight                 : 8;	// 16:23
} BNR_AC_CTRL_03;

/*-----------------------------------------------------------------------------
	0x04d0 bnr_ac_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	max_delta_th0                   : 8,	//  0: 7
	max_delta_th1                   : 8,	//  8:15
	h_blockness_th                  : 8,	// 16:23
	h_weight_max                    : 8;	// 24:31
} BNR_AC_CTRL_04;

/*-----------------------------------------------------------------------------
	0x04d4 bnr_ac_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	use_of_hysterisis               : 4,	//  0: 3
	block_boundary_processing_type  : 1;	//     4
} BNR_AC_CTRL_05;

/*-----------------------------------------------------------------------------
	0x04d8 dnr_max_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	enable_snr                      : 1,	//     0
	enable_mnr                      : 1,	//     1
	enable_edf                      : 1,	//     2
	enable_dc_bnr                   : 1,	//     3
	enable_ac_bnr                   : 1,	//     4
	                                : 3,	//  5: 7 reserved
	debug_enable                    : 1,	//     8
	debug_mode                      : 1,	//     9
	debug__snr_enable               : 1,	//    10
	debug__mnr_enable               : 1,	//    11
	debug__edf_enable               : 1,	//    12
	debug__dc_bnr_enable            : 1,	//    13
	debug__ac_bnr_enable            : 1,	//    14
	                                : 1,	//    15 reserved
	win_control_enable              : 1,	//    16
	border_enable                   : 1;	//    17
} DNR_MAX_CTRL;

/*-----------------------------------------------------------------------------
	0x04dc dnr_dbar_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	debug_bar_en                    : 1,	//     0
	show_sqm_bar                    : 1,	//     1
	show_debug_bar_for_bnr          : 1,	//     2
	show_black_boundary_detection   : 1,	//     3
	gain                            : 3,	//  4: 6
	                                : 1,	//     7 reserved
	sd_hd_sel                       : 2,	//  8: 9
	show_sqm_pixel_info             : 1,	//    10
	show_sqm_measure                : 1,	//    11
	show_sqm_pixel_cnt              : 1,	//    12
	show_bbd_result                 : 1,	//    13
	show_bbd_non_black_pixels       : 1,	//    14
	show_apl                        : 1;	//    15
} DNR_DBAR_CTRL;

/*-----------------------------------------------------------------------------
	0x04e0 bnr_stat_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ac_bnr_h_status                 : 8,	//  0: 7
	ac_bnr_v_status                 : 8,	//  8:15
	dc_bnr__th                      :14;	// 16:29
} BNR_STAT_0;

/*-----------------------------------------------------------------------------
	0x04e4 sqm_ctrl_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	outmux_debugmap                 : 4,	//  0: 3
	iir                             : 4,	//  4: 7
	i_score                         : 8,	//  8:15
	v_score                         : 8,	// 16:23
	l_score                         : 8;	// 24:31
} SQM_CTRL_0;

/*-----------------------------------------------------------------------------
	0x04e8 sqm_ctrl_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	v_limit                         : 8,	//  0: 7
	l_limit                         : 8,	//  8:15
	score_threshold                 : 8,	// 16:23
	flat_threshold                  : 8;	// 24:31
} SQM_CTRL_1;

/*-----------------------------------------------------------------------------
	0x04ec sqm_stat_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blur_pixel                      :10,	//  0: 9
	sharp_pixel                     :10,	// 10:19
	source_quality_measure          :10,	// 20:29
	pc_detected                     : 1;	//    30
} SQM_STAT_0;

/*-----------------------------------------------------------------------------
	0x04f0 hist_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 1,	//     0 reserved
	reg_bin_mode                    : 2,	//  1: 2
	                                : 1,	//     3 reserved
	bin_bitwidth_mode               : 2,	//  4: 5
	window_size_mode_en             : 1,	//     6
	window_size_info_latch          : 1,	//     7
	reg_histogram_bin_min_position  : 8,	//  8:15
	reg_histogram_bin_max_position  : 8;	// 16:23
} HIST_CTRL;

/*-----------------------------------------------------------------------------
	0x04f4 pe0_hist_read_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hif_hist_address                : 6,	//  0: 5
	                                : 6,	//  6:11 reserved
	hif_hist_ai___auto_increment_ena: 1,	//    12
	                                : 2,	// 13:14 reserved
	hif_hist_enable                 : 1,	//    15
	hif_status_address              : 2,	// 16:17
	                                :10,	// 18:27 reserved
	hif_status_ai                   : 1;	//    28
} PE0_HIST_READ_CTRL;

/*-----------------------------------------------------------------------------
	0x04f8 pe0_hist_data_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hif_histogram_bin_even_read     :16,	//  0:15
	hif_histogram_bin_odd_read      :16;	// 16:31
} PE0_HIST_DATA_0;

/*-----------------------------------------------------------------------------
	0x04fc pe0_hist_data_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hif_hist_status                 ;   	// 31: 0
} PE0_HIST_DATA_1;

typedef struct {
	PE0_LOAD                        	pe0_load                        ;	// 0x0300 : ''
	PE0_INTR                        	pe0_intr                        ;	// 0x0304 : ''
	PE0_STATUS0                     	pe0_status0                     ;	// 0x0308 : ''
	PE0_STATUS1                     	pe0_status1                     ;	// 0x030c : ''
	PE0_OPMODE                      	pe0_opmode                      ;	// 0x0310 : ''
	PE0_SRC_SIZE                    	pe0_src_size                    ;	// 0x0314 : ''
	PE0_FIELD                       	pe0_field                       ;	// 0x0318 : ''
	PE0_PARAM_BY_DDR                	pe0_param_by_ddr                ;	// 0x031c : ''
	WIN_CTRL_0                      	win_ctrl_0                      ;	// 0x0320 : ''
	WIN_CTRL_1                      	win_ctrl_1                      ;	// 0x0324 : ''
	WIN_CTRL_2                      	win_ctrl_2                      ;	// 0x0328 : ''
	WIN_CTRL_3                      	win_ctrl_3                      ;	// 0x032c : ''
	BBD_CTRL_1                      	bbd_ctrl_1                      ;	// 0x0330 : ''
	BBD_CTRL_2                      	bbd_ctrl_2                      ;	// 0x0334 : ''
	BBD_STAT_0                      	bbd_stat_0                      ;	// 0x0338 : ''
	BBD_STAT_1                      	bbd_stat_1                      ;	// 0x033c : ''
	TNR_CTRL_00                     	tnr_ctrl_00                     ;	// 0x0340 : ''
	TNR_CTRL_01                     	tnr_ctrl_01                     ;	// 0x0344 : ''
	TNR_CTRL_02                     	tnr_ctrl_02                     ;	// 0x0348 : ''
	TNR_CTRL_03                     	tnr_ctrl_03                     ;	// 0x034c : ''
	TNR_CTRL_04                     	tnr_ctrl_04                     ;	// 0x0350 : ''
	TNR_CTRL_05                     	tnr_ctrl_05                     ;	// 0x0354 : ''
	TNR_CTRL_06                     	tnr_ctrl_06                     ;	// 0x0358 : ''
	TNR_CTRL_07                     	tnr_ctrl_07                     ;	// 0x035c : ''
	TNR_CTRL_08                     	tnr_ctrl_08                     ;	// 0x0360 : ''
	TNR_CTRL_09                     	tnr_ctrl_09                     ;	// 0x0364 : ''
	TNR_CTRL_10                     	tnr_ctrl_10                     ;	// 0x0368 : ''
	TNR_CTRL_11                     	tnr_ctrl_11                     ;	// 0x036c : ''
	TNR_CTRL_12                     	tnr_ctrl_12                     ;	// 0x0370 : ''
	TNR_CTRL_13                     	tnr_ctrl_13                     ;	// 0x0374 : ''
	UINT32                          	tnr_ctrl_14                     ;	// 0x0378 : ''
	UINT32                          	tnr_ctrl_15                     ;	// 0x037c : ''
	TNR_CTRL_16                     	tnr_ctrl_16                     ;	// 0x0380 : ''
	TNR_CTRL_17                     	tnr_ctrl_17                     ;	// 0x0384 : ''
	TNR_CTRL_18                     	tnr_ctrl_18                     ;	// 0x0388 : ''
	TNR_CTRL_19                     	tnr_ctrl_19                     ;	// 0x038c : ''
	TNR_CTRL_20                     	tnr_ctrl_20                     ;	// 0x0390 : ''
	TNR_CTRL_21                     	tnr_ctrl_21                     ;	// 0x0394 : ''
	TNR_CTRL_22                     	tnr_ctrl_22                     ;	// 0x0398 : ''
	TNR_CTRL_23                     	tnr_ctrl_23                     ;	// 0x039c : ''
	TNR_CTRL_24                     	tnr_ctrl_24                     ;	// 0x03a0 : ''
	TNR_CTRL_25                     	tnr_ctrl_25                     ;	// 0x03a4 : ''
	TNR_CTRL_26                     	tnr_ctrl_26                     ;	// 0x03a8 : ''
	TNR_CTRL_27                     	tnr_ctrl_27                     ;	// 0x03ac : ''
	TNR_CTRL_28                     	tnr_ctrl_28                     ;	// 0x03b0 : ''
	UINT32                          	tnr_ctrl_29                     ;	// 0x03b4 : ''
	UINT32                          	tnr_ctrl_30                     ;	// 0x03b8 : ''
	UINT32                          	tnr_ctrl_31                     ;	// 0x03bc : ''
	TNR_STATUS_00                   	tnr_status_00                   ;	// 0x03c0 : ''
	TNR_STATUS_01                   	tnr_status_01                   ;	// 0x03c4 : ''
	TNR_STATUS_02                   	tnr_status_02                   ;	// 0x03c8 : ''
	TNR_STATUS_03                   	tnr_status_03                   ;	// 0x03cc : ''
	TNR_MAIN_LUT_00                 	tnr_main_lut_00                 ;	// 0x03d0 : ''
	TNR_MAIN_LUT_01                 	tnr_main_lut_01                 ;	// 0x03d4 : ''
	TNR_MAIN_LUT_02                 	tnr_main_lut_02                 ;	// 0x03d8 : ''
	TI_CTRL                         	ti_ctrl                         ;	// 0x03dc : ''
	TNR_NT_LVL_LUT_00               	tnr_nt_lvl_lut_00               ;	// 0x03e0 : ''
	TNR_NT_LVL_LUT_01               	tnr_nt_lvl_lut_01               ;	// 0x03e4 : ''
	TNR_NT_LVL_LUT_02               	tnr_nt_lvl_lut_02               ;	// 0x03e8 : ''
	TNR_NT_LVL_LUT_03               	tnr_nt_lvl_lut_03               ;	// 0x03ec : ''
	TNR_CRG_CTRL_00                 	tnr_crg_ctrl_00                 ;	// 0x03f0 : ''
	TNR_CRG_CTRL_01                 	tnr_crg_ctrl_01                 ;	// 0x03f4 : ''
	SQM_CTRL_2                      	sqm_ctrl_2                      ;	// 0x03f8 : ''
	SQM_CTRL_3                      	sqm_ctrl_3                      ;	// 0x03fc : ''
	IPC_CTRL_00                     	ipc_ctrl_00                     ;	// 0x0400 : ''
	IPC_CTRL_01                     	ipc_ctrl_01                     ;	// 0x0404 : ''
	IPC_CTRL_02                     	ipc_ctrl_02                     ;	// 0x0408 : ''
	IPC_CTRL_03                     	ipc_ctrl_03                     ;	// 0x040c : ''
	IPC_CTRL_04                     	ipc_ctrl_04                     ;	// 0x0410 : ''
	IPC_CTRL_05                     	ipc_ctrl_05                     ;	// 0x0414 : ''
	IPC_CTRL_06                     	ipc_ctrl_06                     ;	// 0x0418 : ''
	IPC_CTRL_07                     	ipc_ctrl_07                     ;	// 0x041c : ''
	IPC_CTRL_08                     	ipc_ctrl_08                     ;	// 0x0420 : ''
	IPC_CTRL_09                     	ipc_ctrl_09                     ;	// 0x0424 : ''
	IPC_CTRL_10                     	ipc_ctrl_10                     ;	// 0x0428 : ''
	IPC_CTRL_11                     	ipc_ctrl_11                     ;	// 0x042c : ''
	IPC_CTRL_12                     	ipc_ctrl_12                     ;	// 0x0430 : ''
	IPC_CTRL_13                     	ipc_ctrl_13                     ;	// 0x0434 : ''
	IPC_CTRL_14                     	ipc_ctrl_14                     ;	// 0x0438 : ''
	IPC_CTRL_15                     	ipc_ctrl_15                     ;	// 0x043c : ''
	IPC_CTRL_16                     	ipc_ctrl_16                     ;	// 0x0440 : ''
	IPC_CTRL_17                     	ipc_ctrl_17                     ;	// 0x0444 : ''
	IPC_CTRL_18                     	ipc_ctrl_18                     ;	// 0x0448 : ''
	IPC_CTRL_19                     	ipc_ctrl_19                     ;	// 0x044c : ''
	IPC_STATUS_00                   	ipc_status_00                   ;	// 0x0450 : ''
	IPC_STATUS_01                   	ipc_status_01                   ;	// 0x0454 : ''
	IPC_STATUS_02                   	ipc_status_02                   ;	// 0x0458 : ''
	IPC_STATUS_03                   	ipc_status_03                   ;	// 0x045c : ''
	CLC_CTRL_00                     	clc_ctrl_00                     ;	// 0x0460 : ''
	CLC_CTRL_01                     	clc_ctrl_01                     ;	// 0x0464 : ''
	CLC_CTRL_02                     	clc_ctrl_02                     ;	// 0x0468 : ''
	CLC_CTRL_03                     	clc_ctrl_03                     ;	// 0x046c : ''
	CLC_CTRL_04                     	clc_ctrl_04                     ;	// 0x0470 : ''
	CLC_CTRL_05                     	clc_ctrl_05                     ;	// 0x0474 : ''
	CLC_CTRL_06                     	clc_ctrl_06                     ;	// 0x0478 : ''
	CLC_STAT_00                     	clc_stat_00                     ;	// 0x047c : ''
	VFLT_CTRL                       	vflt_ctrl                       ;	// 0x0480 : ''
	SNR_CTRL_00                     	snr_ctrl_00                     ;	// 0x0484 : ''
	MNR_CTRL_00                     	mnr_ctrl_00                     ;	// 0x0488 : ''
	MNR_CTRL_01                     	mnr_ctrl_01                     ;	// 0x048c : ''
	MNR_CTRL_02                     	mnr_ctrl_02                     ;	// 0x0490 : ''
	MNR_CTRL_03                     	mnr_ctrl_03                     ;	// 0x0494 : ''
	MNR_CTRL_04                     	mnr_ctrl_04                     ;	// 0x0498 : ''
	MNR_CTRL_05                     	mnr_ctrl_05                     ;	// 0x049c : ''
	MNR_CTRL_06                     	mnr_ctrl_06                     ;	// 0x04a0 : ''
	EDF_CTRL_00                     	edf_ctrl_00                     ;	// 0x04a4 : ''
	EDF_CTRL_01                     	edf_ctrl_01                     ;	// 0x04a8 : ''
	BNR_DC_CTRL_00                  	bnr_dc_ctrl_00                  ;	// 0x04ac : ''
	BNR_DC_CTRL_01                  	bnr_dc_ctrl_01                  ;	// 0x04b0 : ''
	BNR_DC_CTRL_02                  	bnr_dc_ctrl_02                  ;	// 0x04b4 : ''
	BNR_DC_CTRL_03                  	bnr_dc_ctrl_03                  ;	// 0x04b8 : ''
	BBD_CTRL_00                     	bbd_ctrl_00                     ;	// 0x04bc : ''
	BNR_AC_CTRL_00                  	bnr_ac_ctrl_00                  ;	// 0x04c0 : ''
	BNR_AC_CTRL_01                  	bnr_ac_ctrl_01                  ;	// 0x04c4 : ''
	BNR_AC_CTRL_02                  	bnr_ac_ctrl_02                  ;	// 0x04c8 : ''
	BNR_AC_CTRL_03                  	bnr_ac_ctrl_03                  ;	// 0x04cc : ''
	BNR_AC_CTRL_04                  	bnr_ac_ctrl_04                  ;	// 0x04d0 : ''
	BNR_AC_CTRL_05                  	bnr_ac_ctrl_05                  ;	// 0x04d4 : ''
	DNR_MAX_CTRL                    	dnr_max_ctrl                    ;	// 0x04d8 : ''
	DNR_DBAR_CTRL                   	dnr_dbar_ctrl                   ;	// 0x04dc : ''
	BNR_STAT_0                      	bnr_stat_0                      ;	// 0x04e0 : ''
	SQM_CTRL_0                      	sqm_ctrl_0                      ;	// 0x04e4 : ''
	SQM_CTRL_1                      	sqm_ctrl_1                      ;	// 0x04e8 : ''
	SQM_STAT_0                      	sqm_stat_0                      ;	// 0x04ec : ''
	HIST_CTRL                       	hist_ctrl                       ;	// 0x04f0 : ''
	PE0_HIST_READ_CTRL              	pe0_hist_read_ctrl              ;	// 0x04f4 : ''
	PE0_HIST_DATA_0                 	pe0_hist_data_0                 ;	// 0x04f8 : ''
	PE0_HIST_DATA_1                 	pe0_hist_data_1                 ;	// 0x04fc : ''
} PE0_REG_T;
/* 128 regs, 128 types */

/* 128 regs, 128 types in Total*/

/*
 * @{
 * Naming for register pointer.
 * gpRealRegPE0 : real register of PE0.
 * gpRegPE0     : shadow register.
 *
 * @def PE0_RdFL: Read  FLushing : Shadow <- Real.
 * @def PE0_WrFL: Write FLushing : Shadow -> Real.
 * @def PE0_Rd  : Read  whole register(UINT32) from Shadow register.
 * @def PE0_Wr  : Write whole register(UINT32) from Shadow register.
 * @def PE0_Rd01 ~ PE0_Rdnn: Read  given '01~nn' fields from Shadow register.
 * @def PE0_Wr01 ~ PE0_Wrnn: Write given '01~nn' fields to   Shadow register.
 * */
#define PE0_RdFL(_r)			((gpRegPE0->_r)=(gpRealRegPE0->_r))
#define PE0_WrFL(_r)			((gpRealRegPE0->_r)=(gpRegPE0->_r))

#define PE0_Rd(_r)			*((UINT32*)(&(gpRegPE0->_r)))
#define PE0_Wr(_r,_v)			((PE0_Rd(_r))=((UINT32)(_v)))

#define PE0_Rd01(_r,_f01,_v01)													\
								do { 											\
