/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2010 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 

/*-----------------------------------------------------------------------------
	0x0000 rw : read & write ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1200 pe1_top_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	load_time                       : 1,	//     0
	load_enable                     : 1,	//     1
	load_type                       : 1;	//     2
} PE1_TOP_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1204 pe1_top_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	width                           :11,	//  0:10
	                                : 5,	// 11:15 reserved
	height                          :11;	// 16:26
} PE1_TOP_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1208 pe1_top_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tpg_positon                     : 1,	//     0
	                                :17,	//  1:17 reserved
	vdpulse_pos                     : 1;	//    18
} PE1_TOP_CTRL_02;

/*-----------------------------------------------------------------------------
	0x120c pe1_top_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vcnt                            :11,	//  0:10
	va_pe1_in                       : 1,	//    11
	va_pe1_out                      : 1,	//    12
	                                : 3,	// 13:15 reserved
	stat_tpg                        : 1,	//    16
	stat_gt                         : 3,	// 17:19
	stat_crg_lsr                    : 3,	// 20:22
	                                : 1,	//    23 reserved
	stat_crg_shp                    : 3,	// 24:26
	stat_dce                        : 1,	//    27
	stat_cen                        : 1,	//    28
	stat_wb                         : 1,	//    29
	stat_gmc                        : 2;	// 30:31
} PE1_TOP_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1210 pe1_win_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 6,	//  0: 5 reserved
	win_outside                     : 1,	//     6
	win_en                          : 1,	//     7
	bdr_alpha                       : 5,	//  8:12
	bdr_wid                         : 2,	// 13:14
	bdr_en                          : 1,	//    15
	cr5                             : 5,	// 16:20
	cb5                             : 5,	// 21:25
	yy6                             : 6;	// 26:31
} PE1_WIN_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1214 pe1_win_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	win_w0_x0                       :11,	//  0:10
	                                : 5,	// 11:15 reserved
	win_w0_y0                       :11;	// 16:26
} PE1_WIN_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1218 pe1_win_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	win_w0_x1                       :11,	//  0:10
	                                : 5,	// 11:15 reserved
	win_w0_y1                       :11;	// 16:26
} PE1_WIN_CTRL_02;

/*-----------------------------------------------------------------------------
	0x121c pe1_win_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	win_w1_x0                       :11,	//  0:10
	                                : 5,	// 11:15 reserved
	win_w1_y0                       :11;	// 16:26
} PE1_WIN_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1220 pe1_win_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	win_w1_x1                       :11,	//  0:10
	                                : 5,	// 11:15 reserved
	win_w1_y1                       :11;	// 16:26
} PE1_WIN_CTRL_04;

/*-----------------------------------------------------------------------------
	0x1224 pe1_win_ctrl_05 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1228 pe1_apl_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	apl_win_ctrl_x0                 :11,	//  0:10
	                                : 5,	// 11:15 reserved
	apl_win_ctrl_y0                 :11;	// 16:26
} PE1_APL_CTRL_00;

/*-----------------------------------------------------------------------------
	0x122c pe1_apl_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	apl_win_ctrl_x1                 :11,	//  0:10
	                                : 5,	// 11:15 reserved
	apl_win_ctrl_y1                 :11;	// 16:26
} PE1_APL_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1230 pe1_apl_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	apl_position                    : 2,	//  0: 1
	                                : 2,	//  2: 3 reserved
	apl_y_type                      : 1,	//     4
	                                : 3,	//  5: 7 reserved
	act_win_mode                    : 1;	//     8
} PE1_APL_CTRL_02;

/*-----------------------------------------------------------------------------
	0x1234 pe1_apl_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	apl_y                           :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	apl_rgb                         :10;	// 16:25
} PE1_APL_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1238 pe1_apl_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	apl_b                           :10,	//  0: 9
	apl_g                           :10,	// 10:19
	apl_r                           :10;	// 20:29
} PE1_APL_CTRL_04;

/*-----------------------------------------------------------------------------
	0x123c tpg_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tpg_enable                      : 1,	//     0
	pattern_type                    : 2,	//  1: 2
	                                : 1,	//     3 reserved
	blend_alpha                     : 4,	//  4: 7
	blt_size_x                      :11,	//  8:18
	                                : 1,	//    19 reserved
	blt_size_y                      :11;	// 20:30
} TPG_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1240 tpg_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gradation_stride                : 7,	//  0: 6
	gradation_direction             : 1,	//     7
	gradation_bar_en                : 4,	//  8:11
	                                : 4,	// 12:15 reserved
	washing_num_of_bar_x            : 3,	// 16:18
	                                : 1,	//    19 reserved
	washing_num_of_bar_y            : 3,	// 20:22
	                                : 1,	//    23 reserved
	washing_speed                   : 8;	// 24:31
} TPG_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1244 tpg_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	patch_en                        ;   	// 31: 0
} TPG_CTRL_02;

/*-----------------------------------------------------------------------------
	0x1248 tpg_indir_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tpg_indir_addr                  : 7,	//  0: 6
	                                : 5,	//  7:11 reserved
	tpg_indir_ai_en                 : 1;	//    12
} TPG_INDIR_CTRL;

/*-----------------------------------------------------------------------------
	0x124c tpg_indir_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tpg_indir_data                  ;   	// 31: 0
} TPG_INDIR_DATA;

/*-----------------------------------------------------------------------------
	0x1250 pe1_film_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vignetting_enable               : 1,	//     0
	film_contrast_enable            : 1,	//     1
	                                : 6,	//  2: 7 reserved
	contrast_alpha                  : 8,	//  8:15
	contrast_delta_max              : 8,	// 16:23
	vignetting_gain                 : 8;	// 24:31
} PE1_FILM_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1254 pe1_film_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	noise_gen_enable                : 1,	//     0
	noise_frame_rate                : 3,	//  1: 3
	noise_size                      : 1,	//     4
	                                : 3,	//  5: 7 reserved
	noise_gain                      : 8;	//  8:15
} PE1_FILM_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1258 pe1_film_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	tone_gain                       : 7,	//  0: 6
	                                : 1,	//     7 reserved
	tone_offset                     : 6;	//  8:13
} PE1_FILM_CTRL_02;

/*-----------------------------------------------------------------------------
	0x125c pe1_hfnr_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	flats_t0_fc0                    : 2,	//  0: 1
	flats_t0_fcs                    : 2,	//  2: 3
	flats_t1_fc0                    : 2,	//  4: 5
	flats_t1_fc1                    : 2,	//  6: 7
	flats_t0_fcp                    : 2,	//  8: 9
	flats_t0_fcd                    : 2,	// 10:11
	t0_bc0                          : 2,	// 12:13
	t1_bc0                          : 2,	// 14:15
	dth_t0_dth0                     : 7,	// 16:22
	h_disable                       : 1,	//    23
	dth_t0_dths                     : 8;	// 24:31
} PE1_HFNR_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1260 pe1_hfnr_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dth_t0_dthp                     : 8,	//  0: 7
	dth_t1_dth0                     : 4,	//  8:11
	dth_t1_dth1                     : 4;	// 12:15
} PE1_HFNR_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1264 pe1_lsr_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vsum_mode                       : 2,	//  0: 1
	hsum_mode                       : 2,	//  2: 3
	vsum121_en                      : 1,	//     4
	                                : 3,	//  5: 7 reserved
	vertical_min_max                : 2,	//  8: 9
	                                : 6,	// 10:15 reserved
	a_flt_mux                       : 2,	// 16:17
	a_e_mux                         : 2,	// 18:19
	t_mux                           : 1,	//    20
	                                : 3,	// 21:23 reserved
	a_gen_width                     : 4;	// 24:27
} PE1_LSR_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1268 pe1_lsr_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a_gen_of_y                      : 8,	//  0: 7
	a_gen_of_c                      : 8,	//  8:15
	avg_flt_mode                    : 3,	// 16:18
	avg_flt_en                      : 1,	//    19
	                                : 4,	// 20:23 reserved
	max_flt_mode                    : 3;	// 24:26
} PE1_LSR_CTRL_01;

/*-----------------------------------------------------------------------------
	0x126c pe1_lsr_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	a_exp_gain_ctrl_y0              : 4,	//  0: 3
	a_exp2_gain_ctrl_x0             : 4,	//  4: 7
	a_exp2_gain_ctrl_y1             : 4,	//  8:11
	a_exp2_gain_ctrl_x1             : 4,	// 12:15
	a_avg2_flt_wid                  : 4,	// 16:19
	a_avg2_flt_en                   : 1,	//    20
	                                : 3,	// 21:23 reserved
	a_exp_max2_en                   : 1,	//    24
	                                : 1,	//    25 reserved
	y_sum_mode                      : 2;	// 26:27
} PE1_LSR_CTRL_02;

/*-----------------------------------------------------------------------------
	0x1270 pe1_lsr_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 5,	//  0: 4 reserved
	a_mux_for_edge_gaintable        : 3,	//  5: 7
	                                : 9,	//  8:16 reserved
	a_mux_for_detail_filter         : 3,	// 17:19
	                                : 1,	//    20 reserved
	a_mux_for_edge_filter           : 3,	// 21:23
	a_scaling_flat_filter           : 4,	// 24:27
	                                : 1,	//    28 reserved
	a_mux_for_flat_filter           : 3;	// 29:31
} PE1_LSR_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1274 pe1_lsr_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_dbg_scale                   : 4,	//  0: 3
	sum_mux                         : 4,	//  4: 7
	reg_enh_en_cc                   : 3,	//  8:10
	                                : 1,	//    11 reserved
	reg_enh_en_yy                   : 3;	// 12:14
} PE1_LSR_CTRL_04;

/*-----------------------------------------------------------------------------
	0x1278 pe1_lsr_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_vmm_param                   : 2,	//  0: 1
	                                : 6,	//  2: 7 reserved
	reg_csft_gain                   : 6,	//  8:13
	                                : 2,	// 14:15 reserved
	reg_th_gain_edge                : 6,	// 16:21
	reg_th_gain_flat                : 2,	// 22:23
	reg_th_manual_th                : 7,	// 24:30
	reg_th_manual_en                : 1;	//    31
} PE1_LSR_CTRL_05;

/*-----------------------------------------------------------------------------
	0x127c pe1_lsr_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 8,	//  0: 7 reserved
	edge_filter_white_gain          : 6,	//  8:13
	                                : 2,	// 14:15 reserved
	edge_filter_black_gain          : 6,	// 16:21
	                                : 2,	// 22:23 reserved
	reg_amean_en                    : 1,	//    24
	                                : 1,	//    25 reserved
	edge_filter_v_tap               : 2,	// 26:27
	                                : 2,	// 28:29 reserved
	edge_c_filter_en                : 1,	//    30
	edge_y_filter_en                : 1;	//    31
} PE1_LSR_CTRL_06;

/*-----------------------------------------------------------------------------
	0x1280 pe1_lsr_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                :24,	//  0:23 reserved
	flat_filter_gain                : 6,	// 24:29
	                                : 1,	//    30 reserved
	flat_filter_en                  : 1;	//    31
} PE1_LSR_CTRL_07;

/*-----------------------------------------------------------------------------
	0x1284 pe1_lsr_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	amod_ctrl0_y0                   : 8,	//  0: 7
	amod_ctrl0_x0                   : 8,	//  8:15
	amod_ctrl0_y1                   : 8,	// 16:23
	amod_ctrl0_x1                   : 8;	// 24:31
} PE1_LSR_CTRL_08;

/*-----------------------------------------------------------------------------
	0x1288 pe1_lsr_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	amod_ctrl1_x0                   : 8,	//  0: 7
	amod_ctrl1_x1                   : 8,	//  8:15
	y_c_mux_control                 : 3,	// 16:18
	chroma_weight                   : 5;	// 19:23
} PE1_LSR_CTRL_09;

/*-----------------------------------------------------------------------------
	0x128c pe1_lsr_dtl_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	detail_enhancer_enable          : 1,	//     0
	                                : 2,	//  1: 2 reserved
	debug_mode                      : 1,	//     3
	debug_image                     : 4,	//  4: 7
	gain_w                          : 8,	//  8:15
	gain_b                          : 8,	// 16:23
	filter_coef_normalization       : 2,	// 24:25
	freq_selective_filter_type      : 1,	//    26
	detail_measure_for_sca          : 1;	//    27
} PE1_LSR_DTL_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1290 pe1_lsr_dtl_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	f2_gain                         : 8,	//  0: 7
	f3_gain                         : 8,	//  8:15
	f4_gain                         : 8,	// 16:23
	f5_gain                         : 8;	// 24:31
} PE1_LSR_DTL_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1294 pe1_lsr_dtl_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	t5_gain                         : 8,	//  0: 7
	edge_operator_mode              : 1,	//     8
	weighting_mdoe                  : 3,	//  9:11
	                                : 4,	// 12:15 reserved
	edge_th_1                       : 8,	// 16:23
	edge_th_2                       : 8;	// 24:31
} PE1_LSR_DTL_CTRL_02;

/*-----------------------------------------------------------------------------
	0x1298 pe1_lsr_dtl_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vertical_compensation_enable    : 1,	//     0
	um3x3_type                      : 1,	//     1
	                                : 6,	//  2: 7 reserved
	vertical_compensation_gain      : 8,	//  8:15
	um3x3_gain                      : 8;	// 16:23
} PE1_LSR_DTL_CTRL_03;

/*-----------------------------------------------------------------------------
	0x129c pe1_lsr_dtl_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vertical_compensation_th_l1     : 8,	//  0: 7
	vertical_compensation_th_l2     : 8,	//  8:15
	vertical_compensation_th_h1     : 8,	// 16:23
	vertical_compensation_th_h2     : 8;	// 24:31
} PE1_LSR_DTL_CTRL_04;

/*-----------------------------------------------------------------------------
	0x12a0 pe1_lsr_dtl_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	manual_coring_enable            : 1,	//     0
	coring_post_filtering_type      : 2,	//  1: 2
	coring_post_filtering_enable    : 1,	//     3
	local_min_max_mode              : 2,	//  4: 5
	                                : 2,	//  6: 7 reserved
	sc_max_th                       : 4,	//  8:11
	dbg_diff_gain                   : 3,	// 12:14
	                                : 1,	//    15 reserved
	c_mmd_th                        : 4,	// 16:19
	c_mmd_scale                     : 4,	// 20:23
	c_mmd_type                      : 2;	// 24:25
} PE1_LSR_DTL_CTRL_05;

/*-----------------------------------------------------------------------------
	0x12a4 pe1_lsr_dtl_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_max_th                       : 4,	//  0: 3
	                                : 4,	//  4: 7 reserved
	sc_th1                          : 6,	//  8:13
	                                : 2,	// 14:15 reserved
	sc_th2                          : 6,	// 16:21
	                                : 2,	// 22:23 reserved
	sc_gain                         : 6;	// 24:29
} PE1_LSR_DTL_CTRL_06;

/*-----------------------------------------------------------------------------
	0x12a8 pe1_lsr_dtl_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	coring_mmd_th_l1                : 8,	//  0: 7
	coring_mmd_th_l2                : 8,	//  8:15
	coring_mmd_th_h1                : 8,	// 16:23
	coring_mmd_th_h2                : 8;	// 24:31
} PE1_LSR_DTL_CTRL_07;

/*-----------------------------------------------------------------------------
	0x12ac pe1_lsr_dtl_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	post_filterig_enable            : 1,	//     0
	                                : 7,	//  1: 7 reserved
	post_filtering_y_delta          : 4,	//  8:11
	post_filtering_y_th             : 4;	// 12:15
} PE1_LSR_DTL_CTRL_08;

/*-----------------------------------------------------------------------------
	0x12b0 pe1_lsr_dtl_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	adaptive_coring_enable          : 1,	//     0
	                                : 3,	//  1: 3 reserved
	ac_mmd_for_strong_edge          : 2,	//  4: 5
	ac_mmd_for_wide_area            : 2;	//  6: 7
} PE1_LSR_DTL_CTRL_09;

/*-----------------------------------------------------------------------------
	0x12b4 pe1_lsr_dtl_ctrl_0a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ac_strong_edge_protection_th1   : 8,	//  0: 7
	ac_strong_edge_protection_th2   : 8,	//  8:15
	ac_flat_th1                     : 8,	// 16:23
	ac_flat_th2                     : 8;	// 24:31
} PE1_LSR_DTL_CTRL_0A;

/*-----------------------------------------------------------------------------
	0x12b8 pe1_lsr_dtl_ctrl_0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gain_balancing_on_off           : 1,	//     0
	                                : 3,	//  1: 3 reserved
	delta_axis_resolution           : 1,	//     4
	                                : 3,	//  5: 7 reserved
	ed_x1                           : 8,	//  8:15
	ed_x2                           : 8;	// 16:23
} PE1_LSR_DTL_CTRL_0B;

/*-----------------------------------------------------------------------------
	0x12bc pe1_lsr_dtl_ctrl_0c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ed_y1                           : 8,	//  0: 7
	ed_y2                           : 8,	//  8:15
	ed_y3                           : 8;	// 16:23
} PE1_LSR_DTL_CTRL_0C;

/*-----------------------------------------------------------------------------
	0x12c0 pe1_lsr_dtl_ctrl_0d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lgain_en                        : 1,	//     0
	                                : 3,	//  1: 3 reserved
	lgain_apl_type                  : 2,	//  4: 5
	                                : 2,	//  6: 7 reserved
	lgain_th0                       : 8,	//  8:15
	lgain_th1                       : 8;	// 16:23
} PE1_LSR_DTL_CTRL_0D;

/*-----------------------------------------------------------------------------
	0x12c4 pe1_lsr_gt_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gt_detail_mode                  : 1,	//     0
	gt_edge_mode                    : 1,	//     1
	gt_flat_mode                    : 1,	//     2
	                                : 5,	//  3: 7 reserved
	gt_detail_manual_gain           : 6,	//  8:13
	                                : 2,	// 14:15 reserved
	gt_edge_manual_gain             : 6,	// 16:21
	                                : 2,	// 22:23 reserved
	gt_flat_manual_gain             : 6;	// 24:29
} PE1_LSR_GT_CTRL_00;

/*-----------------------------------------------------------------------------
	0x12c8 pe1_lsr_gt_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gt_interpolation_type           : 2,	//  0: 1
	                                : 6,	//  2: 7 reserved
	interpol_x0                     : 8,	//  8:15
	interpol_x1                     : 8,	// 16:23
	interpol_x2                     : 8;	// 24:31
} PE1_LSR_GT_CTRL_01;

/*-----------------------------------------------------------------------------
	0x12cc pe1_lsr_gt_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	th1                             : 8,	//  0: 7
	th2                             : 8,	//  8:15
	th3                             : 8,	// 16:23
	pcm_th                          : 8;	// 24:31
} PE1_LSR_GT_CTRL_02;

/*-----------------------------------------------------------------------------
	0x12d0 pe1_lsr_gt_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	enable_manual_sqa_measure       : 1,	//     0
	auto_sqa_measure_type           : 1,	//     1
	hdm_pcm_selection               : 1,	//     2
	sqm_bit_resolution              : 1,	//     3
	                                : 4,	//  4: 7 reserved
	manual_sqa_value                : 8,	//  8:15
	hd_measure                      : 8,	// 16:23
	pc_measure                      : 8;	// 24:31
} PE1_LSR_GT_CTRL_03;

/*-----------------------------------------------------------------------------
	0x12d4 pe1_lsr_gt_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	source_quality_measure          : 8;	//  0: 7
} PE1_LSR_GT_CTRL_04;

/*-----------------------------------------------------------------------------
	0x12d8 pe1_lsr_gt_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	index                           : 6,	//  0: 5
	                                : 2,	//  6: 7 reserved
	edf                             : 2,	//  8: 9
	                                : 2,	// 10:11 reserved
	auto_increment                  : 1,	//    12
	                                : 2,	// 13:14 reserved
	gt_enable                       : 1;	//    15
} PE1_LSR_GT_CTRL_05;

/*-----------------------------------------------------------------------------
	0x12dc pe1_lsr_gt_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_gt_wdata0                   : 6,	//  0: 5
	                                : 2,	//  6: 7 reserved
	reg_gt_wdata1                   : 6,	//  8:13
	                                : 2,	// 14:15 reserved
	reg_gt_wdata2                   : 6;	// 16:21
} PE1_LSR_GT_CTRL_06;

/*-----------------------------------------------------------------------------
	0x12e0 pe1_lsr_sca_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sca_total_detail_gain_en        : 1,	//     0
	sca_percentage_gain_en          : 1,	//     1
	sca_avg_detail_gain_en          : 1,	//     2
	sca_color_gain_en               : 1,	//     3
	crg_csc                         : 1,	//     4
	                                : 3,	//  5: 7 reserved
	sca_gain_display                : 4,	//  8:11
	sca_cr_image_display            : 2,	// 12:13
	                                : 2,	// 14:15 reserved
	sca_detail_measure_display_gain : 3,	// 16:18
	                                : 5,	// 19:23 reserved
	display_gain_for_cr_weight      : 8;	// 24:31
} PE1_LSR_SCA_CTRL_00;

/*-----------------------------------------------------------------------------
	0x12e4 pe1_lsr_sca_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cr_strength_norm_factor         : 2,	//  0: 1
	                                : 6,	//  2: 7 reserved
	sca_total_detailness_calculation: 2,	//  8: 9
	                                : 6,	// 10:15 reserved
	sca_cr_info_calculation_type    : 2;	// 16:17
} PE1_LSR_SCA_CTRL_01;

/*-----------------------------------------------------------------------------
	0x12e8 pe1_lsr_sca_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	use_of_t_in_detail_calculation  : 2,	//  0: 1
	                                : 6,	//  2: 7 reserved
	total_detail_astart             : 8,	//  8:15
	total_detail_aend               : 8,	// 16:23
	t_start                         : 4,	// 24:27
	t_end                           : 4;	// 28:31
} PE1_LSR_SCA_CTRL_02;

/*-----------------------------------------------------------------------------
	0x12ec pe1_lsr_sca_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	flicker_removal                 : 1,	//     0
	                                : 3,	//  1: 3 reserved
	cr_mask_sel                     : 1,	//     4
	                                :11,	//  5:15 reserved
	t_filter_weight                 : 4,	// 16:19
	weight                          : 4,	// 20:23
	envelop_gain_for_sca            : 6;	// 24:29
} PE1_LSR_SCA_CTRL_03;

/*-----------------------------------------------------------------------------
	0x12f0 pe1_lsr_sca_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fd_enable                       : 1,	//     0
	                                : 7,	//  1: 7 reserved
	fd_flat_detector_gain           : 6,	//  8:13
	                                : 2,	// 14:15 reserved
	enable_sca_to_flat_filter       : 1,	//    16
	                                : 3,	// 17:19 reserved
	gain_of_sca_to_flat_filter      : 4;	// 20:23
} PE1_LSR_SCA_CTRL_04;

/*-----------------------------------------------------------------------------
	0x12f4 pe1_lsr_sca_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fd_detail_th1                   : 8,	//  0: 7
	fd_detail_th2                   : 8,	//  8:15
	fd_percentage_th1               : 8,	// 16:23
	fd_percentage_th2               : 8;	// 24:31
} PE1_LSR_SCA_CTRL_05;

/*-----------------------------------------------------------------------------
	0x12f8 pe1_lsr_sca_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	enable_debug_mode               : 1,	//     0
	show_sqm1                       : 1,	//     1
	show_cr_info                    : 1,	//     2
	debug_bar_gain_position         : 1,	//     3
	measure_display_gain            : 3,	//  4: 6
	                                : 1,	//     7 reserved
	show_hdm_pcm_area               : 1,	//     8
	show_sqm2                       : 1,	//     9
	sqm2_debug_image                : 4,	// 10:13
	                                : 2,	// 14:15 reserved
	show_bbd                        : 1,	//    16
	bbd_line_width                  : 3,	// 17:19
	show_apl                        : 1;	//    20
} PE1_LSR_SCA_CTRL_06;

/*-----------------------------------------------------------------------------
	0x12fc pe1_lsr_sca_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_manual_var                  : 7,	//  0: 6
	reg_manual_var_en               : 1,	//     7
	reg_manual_x0                   : 7,	//  8:14
	reg_manual_x0_en                : 1,	//    15
	reg_manual_str                  : 7,	// 16:22
	reg_manual_str_en               : 1,	//    23
	use_of_cr_strength_in_sca_gain  : 1;	//    24
} PE1_LSR_SCA_CTRL_07;

/*-----------------------------------------------------------------------------
	0x1300 pe1_lsr_sca_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_cr_str_y1l                  : 8,	//  0: 7
	reg_cr_str_y2l                  : 8,	//  8:15
	reg_cr_str_y1h                  : 8,	// 16:23
	reg_cr_str_y2h                  : 8;	// 24:31
} PE1_LSR_SCA_CTRL_08;

/*-----------------------------------------------------------------------------
	0x1304 pe1_lsr_sca_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_xl_gain2                    : 4,	//  0: 3
	reg_xl_gain1                    : 4,	//  4: 7
	reg_xh_gain2                    : 4,	//  8:11
	reg_xh_gain1                    : 4,	// 12:15
	reg_cr_str_y0                   : 8;	// 16:23
} PE1_LSR_SCA_CTRL_09;

/*-----------------------------------------------------------------------------
	0x1308 pe1_lsr_sca_ctrl_0a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pre_avg_mode                    : 3,	//  0: 2
	pre_avg_enable_for_detailness   : 1;	//     3
} PE1_LSR_SCA_CTRL_0A;

/*-----------------------------------------------------------------------------
	0x130c pe1_lsr_sca_ctrl_0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gain_type                       : 2,	//  0: 1
	color_region                    : 3,	//  2: 4
	                                : 7,	//  5:11 reserved
	auto_increment                  : 1;	//    12
} PE1_LSR_SCA_CTRL_0B;

/*-----------------------------------------------------------------------------
	0x1310 pe1_lsr_sca_ctrl_0c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x1                              : 8,	//  0: 7
	x2                              : 8,	//  8:15
	g1                              : 6,	// 16:21
	                                : 2,	// 22:23 reserved
	g2                              : 6;	// 24:29
} PE1_LSR_SCA_CTRL_0C;

/*-----------------------------------------------------------------------------
	0x1314 pe1_lsr_crg_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hif_crg_lsr_address             : 4,	//  0: 3
	                                : 8,	//  4:11 reserved
	hif_crg_lsr_ai                  : 1,	//    12
	                                : 2,	// 13:14 reserved
	hif_crg_lsr_wr                  : 1;	//    15
} PE1_LSR_CRG_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1318 pe1_lsr_crg_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	value                           : 8,	//  0: 7
	                                : 2,	//  8: 9 reserved
	saturation                      : 7,	// 10:16
	                                : 3,	// 17:19 reserved
	hue                             :10;	// 20:29
} PE1_LSR_CRG_CTRL_01;

/*-----------------------------------------------------------------------------
	0x131c pe1_shp_edge_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	edge_enhance_enable             : 1,	//     0
	edge_enhance_mode               : 1,	//     1
	lm_mode                         : 1,	//     2
	                                : 5,	//  3: 7 reserved
	lti_level                       : 4,	//  8:11
	edge_operator_selection         : 2;	// 12:13
} PE1_SHP_EDGE_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1320 pe1_shp_edge_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	white_gain                      : 7,	//  0: 6
	                                : 1,	//     7 reserved
	black_gain                      : 7,	//  8:14
	                                : 1,	//    15 reserved
	horizontal_gain                 : 8,	// 16:23
	vertical_gain                   : 8;	// 24:31
} PE1_SHP_EDGE_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1324 pe1_shp_edge_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sobel_weight                    : 8,	//  0: 7
	laplacian_weight                : 8,	//  8:15
	sobel_manual_mode_en            : 1,	//    16
	                                : 7,	// 17:23 reserved
	sobel_manual_gain               : 8;	// 24:31
} PE1_SHP_EDGE_CTRL_02;

/*-----------------------------------------------------------------------------
	0x1328 pe1_shp_edge_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lum_low_th1                     : 8,	//  0: 7
	lum_low_th2                     : 8,	//  8:15
	lum_high_th1                    : 8,	// 16:23
	lum_high_th2                    : 8;	// 24:31
} PE1_SHP_EDGE_CTRL_03;

/*-----------------------------------------------------------------------------
	0x132c pe1_shp_edge_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	laplacian_offset                : 8,	//  0: 7
	debug_selection                 : 3,	//  8:10
	debug_enable                    : 1;	//    11
} PE1_SHP_EDGE_CTRL_04;

/*-----------------------------------------------------------------------------
	0x1330 pe1_shp_cti_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cti_enable                      : 1,	//     0
	bif_enable                      : 1,	//     1
	                                : 6,	//  2: 7 reserved
	cti_gain                        : 8,	//  8:15
	cti_offset                      : 8,	// 16:23
	bif_threshold                   : 8;	// 24:31
} PE1_SHP_CTI_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1334 pe1_shp_cti_ctrl_01 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1338 pe1_shp_dtl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	detail_filter_enable            : 1,	//     0
	normalization_enable            : 1,	//     1
	                                : 2,	//  2: 3 reserved
	dbg_image_mux                   : 4,	//  4: 7
	gain_w                          : 8,	//  8:15
	gain_b                          : 8;	// 16:23
} PE1_SHP_DTL_00;

/*-----------------------------------------------------------------------------
	0x133c pe1_shp_dtl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	coring_enable_manual            : 1,	//     0
	                                : 3,	//  1: 3 reserved
	y_local_min_max_mode            : 2,	//  4: 5
	mmd_type                        : 2,	//  6: 7
	sc_max_th                       : 4,	//  8:11
	dbg_diff_gain                   : 3,	// 12:14
	                                : 1,	//    15 reserved
	c_mmd_th                        : 4,	// 16:19
	c_mmd_scale                     : 4,	// 20:23
	c_mmd_kernel_size               : 2;	// 24:25
} PE1_SHP_DTL_01;

/*-----------------------------------------------------------------------------
	0x1340 pe1_shp_dtl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sc_max_th                       : 4,	//  0: 3
	                                : 4,	//  4: 7 reserved
	sc_th1                          : 6,	//  8:13
	                                : 2,	// 14:15 reserved
	sc_th2                          : 6,	// 16:21
	                                : 2,	// 22:23 reserved
	sc_gain                         : 6;	// 24:29
} PE1_SHP_DTL_02;

/*-----------------------------------------------------------------------------
	0x1344 pe1_shp_dtl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mmd_th_l1                       : 8,	//  0: 7
	mmd_th_l2                       : 8,	//  8:15
	mmd_th_h1                       : 8,	// 16:23
	mmd_th_h2                       : 8;	// 24:31
} PE1_SHP_DTL_03;

/*-----------------------------------------------------------------------------
	0x1348 pe1_shp_dtl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gain_balancing_en               : 1,	//     0
	                                : 3,	//  1: 3 reserved
	delta_axis_resolutution         : 1,	//     4
	                                : 3,	//  5: 7 reserved
	ed_x1                           : 8,	//  8:15
	ed_x2                           : 8;	// 16:23
} PE1_SHP_DTL_04;

/*-----------------------------------------------------------------------------
	0x134c pe1_shp_dtl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ed_y1                           : 8,	//  0: 7
	ed_y2                           : 8,	//  8:15
	ed_y3                           : 8;	// 16:23
} PE1_SHP_DTL_05;

/*-----------------------------------------------------------------------------
	0x1350 pe1_shp_dtl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	adaptive_coring_enable          : 1,	//     0
	                                : 3,	//  1: 3 reserved
	ac_mmd_for_strong_edge_protectio: 2,	//  4: 5
	ac_mmd_for_wide_area_inspection : 2;	//  6: 7
} PE1_SHP_DTL_06;

/*-----------------------------------------------------------------------------
	0x1354 pe1_shp_dtl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ac_strong_edge_protection_th1   : 8,	//  0: 7
	ac_strong_edge_protection_th2   : 8,	//  8:15
	ac_flat_th1                     : 8,	// 16:23
	ac_flat_th2                     : 8;	// 24:31
} PE1_SHP_DTL_07;

/*-----------------------------------------------------------------------------
	0x1358 pe1_shp_dtl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lgain_en                        : 1,	//     0
	                                : 3,	//  1: 3 reserved
	lgain_apl_type                  : 2,	//  4: 5
	                                : 2,	//  6: 7 reserved
	lgain_th0                       : 8,	//  8:15
	lgain_th1                       : 8;	// 16:23
} PE1_SHP_DTL_08;

/*-----------------------------------------------------------------------------
	0x135c pe1_shp_dtl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	um_enable                       : 1,	//     0
	                                : 3,	//  1: 3 reserved
	um_avg_type                     : 3,	//  4: 6
	                                : 1,	//     7 reserved
	um_gain_w                       : 8,	//  8:15
	um_gain_b                       : 8;	// 16:23
} PE1_SHP_DTL_09;

/*-----------------------------------------------------------------------------
	0x1360 pe1_shp_dtl_0a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	blur_mode_enable                : 1,	//     0
	                                : 3,	//  1: 3 reserved
	blur_filter_selection           : 4,	//  4: 7
	blur_level                      : 6;	//  8:13
} PE1_SHP_DTL_0A;

/*-----------------------------------------------------------------------------
	0x1364 pe1_shp_dtl_0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	filter3_tap9_weight             : 6,	//  0: 5
	                                : 2,	//  6: 7 reserved
	filter2_tap7_weight             : 6,	//  8:13
	                                : 2,	// 14:15 reserved
	filter1_tap5_weight             : 6,	// 16:21
	                                : 2,	// 22:23 reserved
	filter0_tap3_weight             : 6;	// 24:29
} PE1_SHP_DTL_0B;

/*-----------------------------------------------------------------------------
	0x1368 pe1_shp_dtl_0c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	filter7_tap17_weight            : 6,	//  0: 5
	                                : 2,	//  6: 7 reserved
	filter6_tap15_weight            : 6,	//  8:13
	                                : 2,	// 14:15 reserved
	filter5_tap13_weight            : 6,	// 16:21
	                                : 2,	// 22:23 reserved
	filter4_tap11_weight            : 6;	// 24:29
} PE1_SHP_DTL_0C;

/*-----------------------------------------------------------------------------
	0x136c pe1_shp_dtl_0d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	filter9_tap21_weight            : 6,	//  0: 5
	                                : 2,	//  6: 7 reserved
	filter8_tap19_weight            : 6;	//  8:13
} PE1_SHP_DTL_0D;

/*-----------------------------------------------------------------------------
	0x1370 pe1_shp_sum_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_dbg_scale                   : 4,	//  0: 3
	sum_mux                         : 4,	//  4: 7
	reg_enh_en_cc                   : 3,	//  8:10
	                                : 1,	//    11 reserved
	reg_enh_en_yy                   : 3;	// 12:14
} PE1_SHP_SUM_CTRL;

/*-----------------------------------------------------------------------------
	0x1374 pe1_shp_sca_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sca_total_detail_gain_en        : 1,	//     0
	sca_percentage_gain_en          : 1,	//     1
	sca_avg_detail_gain_en          : 1,	//     2
	sca_color_gain_en               : 1,	//     3
	crg_csc_sel                     : 1,	//     4
	                                : 3,	//  5: 7 reserved
	sca_gain_display_debug          : 4,	//  8:11
	sca_cr_image_display            : 2,	// 12:13
	                                : 2,	// 14:15 reserved
	sca_detail_measure_display_gain : 3,	// 16:18
	                                : 5,	// 19:23 reserved
	display_gain_for_cr_weight      : 8;	// 24:31
} PE1_SHP_SCA_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1378 pe1_shp_sca_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cr_strength_norm_factor         : 2,	//  0: 1
	                                : 6,	//  2: 7 reserved
	sca_td_calculation_type         : 2,	//  8: 9
	                                : 6,	// 10:15 reserved
	sca_cr_info_calculation_type    : 2;	// 16:17
} PE1_SHP_SCA_CTRL_01;

/*-----------------------------------------------------------------------------
	0x137c pe1_shp_sca_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	use_of_t_in_detail_calculation  : 2,	//  0: 1
	                                : 6,	//  2: 7 reserved
	total_detail_astart             : 8,	//  8:15
	total_detail_aend               : 8,	// 16:23
	t_start                         : 4,	// 24:27
	tend                            : 4;	// 28:31
} PE1_SHP_SCA_CTRL_02;

/*-----------------------------------------------------------------------------
	0x1380 pe1_shp_sca_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	flicker_removal                 : 1,	//     0
	                                : 3,	//  1: 3 reserved
	cr_mask_sel                     : 1,	//     4
	                                :11,	//  5:15 reserved
	t_filter_weight                 : 4,	// 16:19
	weight                          : 4,	// 20:23
	envelop_gain_for_sca            : 6;	// 24:29
} PE1_SHP_SCA_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1384 pe1_shp_sca_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fd_enable_flat_detector         : 1,	//     0
	                                : 7,	//  1: 7 reserved
	fd_flat_detector_gain           : 6,	//  8:13
	                                : 2,	// 14:15 reserved
	enable_sca_to_flat_filter       : 1,	//    16
	                                : 3,	// 17:19 reserved
	gain_of_sca_to_flat_filter      : 4;	// 20:23
} PE1_SHP_SCA_CTRL_04;

/*-----------------------------------------------------------------------------
	0x1388 pe1_shp_sca_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fd_detail_th1                   : 8,	//  0: 7
	fd_detail_th2                   : 8,	//  8:15
	fd_percentage_th_1              : 8,	// 16:23
	fd_percentage_th_2              : 8;	// 24:31
} PE1_SHP_SCA_CTRL_05;

/*-----------------------------------------------------------------------------
	0x138c pe1_shp_sca_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	enable_cr_measure_display       : 1,	//     0
	show_sqa_measure                : 1,	//     1
	show_cr_info                    : 1,	//     2
	debug_bar_gain_position         : 1,	//     3
	measure_display_gain            : 3,	//  4: 6
	                                : 1,	//     7 reserved
	edge_map_max_filtering          : 3,	//  8:10
	                                : 1,	//    11 reserved
	edge_operator_type              : 1;	//    12
} PE1_SHP_SCA_CTRL_06;

/*-----------------------------------------------------------------------------
	0x1390 pe1_shp_sca_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_manual_var                  : 7,	//  0: 6
	reg_manual_var_en               : 1,	//     7
	reg_manual_x0                   : 7,	//  8:14
	reg_manual_x0_en                : 1,	//    15
	reg_manual_str                  : 7,	// 16:22
	reg_manual_str_en               : 1;	//    23
} PE1_SHP_SCA_CTRL_07;

/*-----------------------------------------------------------------------------
	0x1394 pe1_shp_sca_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_cr_str_y1l                  : 8,	//  0: 7
	reg_cr_str_y2l                  : 8,	//  8:15
	reg_cr_str_y1h                  : 8,	// 16:23
	reg_cr_str_y2h                  : 8;	// 24:31
} PE1_SHP_SCA_CTRL_08;

/*-----------------------------------------------------------------------------
	0x1398 pe1_shp_sca_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	reg_xl_gain2                    : 4,	//  0: 3
	reg_xl_gain1                    : 4,	//  4: 7
	reg_xh_gain2                    : 4,	//  8:11
	reg_xh_gain1                    : 4,	// 12:15
	reg_cr_str_y0                   : 8;	// 16:23
} PE1_SHP_SCA_CTRL_09;

/*-----------------------------------------------------------------------------
	0x139c pe1_shp_sca_ctrl_0a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pre_avg_mode                    : 3,	//  0: 2
	pre_avg_enable                  : 1;	//     3
} PE1_SHP_SCA_CTRL_0A;

/*-----------------------------------------------------------------------------
	0x13a0 pe1_shp_sca_ctrl_0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gain_type                       : 2,	//  0: 1
	color_region                    : 3,	//  2: 4
	                                : 7,	//  5:11 reserved
	auto_increment                  : 1;	//    12
} PE1_SHP_SCA_CTRL_0B;

/*-----------------------------------------------------------------------------
	0x13a4 pe1_shp_sca_ctrl_0c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x1                              : 8,	//  0: 7
	x2                              : 8,	//  8:15
	g1                              : 6,	// 16:21
	                                : 2,	// 22:23 reserved
	g2                              : 6;	// 24:29
} PE1_SHP_SCA_CTRL_0C;

/*-----------------------------------------------------------------------------
	0x13a8 pe1_shp_crg_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hif_crg_shp_address             : 4,	//  0: 3
	                                : 8,	//  4:11 reserved
	hif_crg_shp_ai                  : 1,	//    12
	                                : 2,	// 13:14 reserved
	hif_crg_shp_wr                  : 1;	//    15
} PE1_SHP_CRG_CTRL_00;

/*-----------------------------------------------------------------------------
	0x13ac pe1_shp_crg_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	value                           : 8,	//  0: 7
	                                : 2,	//  8: 9 reserved
	saturation                      : 7,	// 10:16
	                                : 3,	// 17:19 reserved
	hue                             :10;	// 20:29
} PE1_SHP_CRG_CTRL_01;

/*-----------------------------------------------------------------------------
	0x13b0 pe1_xvy_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	icsc_en                         : 1,	//     0
	degamma_en                      : 1,	//     1
	pcc_en                          : 1,	//     2
	gamma                           : 1,	//     3
	scaler_en                       : 1,	//     4
	hsv_hsl_selection               : 1,	//     5
	s_adpative_scaler               : 1;	//     6
} PE1_XVY_CTRL_00;

/*-----------------------------------------------------------------------------
	0x13b4 pe1_xvy_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_csc_coef1                     :15,	//  0:14
	                                : 1,	//    15 reserved
	r_csc_coef0                     :15;	// 16:30
} PE1_XVY_CTRL_01;

/*-----------------------------------------------------------------------------
	0x13b8 pe1_xvy_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_csc_coef3                     :15,	//  0:14
	                                : 1,	//    15 reserved
	r_csc_coef2                     :15;	// 16:30
} PE1_XVY_CTRL_02;

/*-----------------------------------------------------------------------------
	0x13bc pe1_xvy_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_csc_coef5                     :15,	//  0:14
	                                : 1,	//    15 reserved
	r_csc_coef4                     :15;	// 16:30
} PE1_XVY_CTRL_03;

/*-----------------------------------------------------------------------------
	0x13c0 pe1_xvy_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_csc_coef7                     :15,	//  0:14
	                                : 1,	//    15 reserved
	r_csc_coef6                     :15;	// 16:30
} PE1_XVY_CTRL_04;

/*-----------------------------------------------------------------------------
	0x13c4 pe1_xvy_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_csc_ofst0                     :11,	//  0:10
	                                : 5,	// 11:15 reserved
	r_csc_coef8                     :15;	// 16:30
} PE1_XVY_CTRL_05;

/*-----------------------------------------------------------------------------
	0x13c8 pe1_xvy_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_csc_ofst2                     :11,	//  0:10
	                                : 5,	// 11:15 reserved
	r_csc_ofst1                     :11;	// 16:26
} PE1_XVY_CTRL_06;

/*-----------------------------------------------------------------------------
	0x13cc pe1_xvy_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_csc_ofst4                     :14,	//  0:10
	                                : 2,	// 11:15 reserved
	r_csc_ofst3                     :14;	// 16:26
} PE1_XVY_CTRL_07;

/*-----------------------------------------------------------------------------
	0x13d0 pe1_xvy_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_pcc_coef0                     :15,	//  0:14
	                                : 1,	//    15 reserved
	r_csc_ofst5                     :14;	// 16:26
} PE1_XVY_CTRL_08;

/*-----------------------------------------------------------------------------
	0x13d4 pe1_xvy_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_pcc_coef2                     :15,	//  0:14
	                                : 1,	//    15 reserved
	r_pcc_coef1                     :15;	// 16:30
} PE1_XVY_CTRL_09;

/*-----------------------------------------------------------------------------
	0x13d8 pe1_xvy_ctrl_0a ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_pcc_coef4                     :15,	//  0:14
	                                : 1,	//    15 reserved
	r_pcc_coef3                     :15;	// 16:30
} PE1_XVY_CTRL_0A;

/*-----------------------------------------------------------------------------
	0x13dc pe1_xvy_ctrl_0b ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_pcc_coef6                     :15,	//  0:14
	                                : 1,	//    15 reserved
	r_pcc_coef5                     :15;	// 16:30
} PE1_XVY_CTRL_0B;

/*-----------------------------------------------------------------------------
	0x13e0 pe1_xvy_ctrl_0c ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	r_pcc_coef8                     :15,	//  0:14
	                                : 1,	//    15 reserved
	r_pcc_coef7                     :15;	// 16:30
} PE1_XVY_CTRL_0C;

/*-----------------------------------------------------------------------------
	0x13e4 pe1_xvy_ctrl_0d ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	scaler                          : 8;	//  0: 7
} PE1_XVY_CTRL_0D;

/*-----------------------------------------------------------------------------
	0x13e8 pe1_dce_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dynamic_contrast_en             : 1,	//     0
	hist_bin_mode                   : 2,	//  1: 2
	hist_clear                      : 1,	//     3
	hist_bin_bitwidth_mode          : 2,	//  4: 5
	window_mode_en                  : 1,	//     6
	window_acquire                  : 1,	//     7
	color_region0_sel               : 1,	//     8
	color_region1_sel               : 1,	//     9
	color_region2_sel               : 1,	//    10
	color_region3_sel               : 1,	//    11
	color_region4_sel               : 1,	//    12
	color_region5_sel               : 1,	//    13
	color_region6_sel               : 1,	//    14
	color_region7_sel               : 1,	//    15
	color_region8_sel               : 1,	//    16
	color_region9_sel               : 1,	//    17
	color_region10_sel              : 1,	//    18
	color_region11_sel              : 1,	//    19
	color_region12_sel              : 1,	//    20
	color_region13_sel              : 1,	//    21
	color_region14_sel              : 1,	//    22
	color_region15_sel              : 1,	//    23
	dce_domain_sel                  : 1;	//    24
} PE1_DCE_CTRL_00;

/*-----------------------------------------------------------------------------
	0x13ec pe1_dce_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hist_bin_min_position           : 8,	//  0: 7
	hist_bin_max_position           : 8,	//  8:15
	color_region_gain               : 8;	// 16:23
} PE1_DCE_CTRL_01;

/*-----------------------------------------------------------------------------
	0x13f0 reserved ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x13f4 reserved ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x13f8 reserved ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x13fc reserved ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1400 pe1_dce_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hif_dyc_address                 : 5,	//  0: 4
	                                : 3,	//  5: 7 reserved
	hif_dce_load                    : 1,	//     8
	                                : 3,	//  9:11 reserved
	hif_dce_ai                      : 1,	//    12
	                                : 2,	// 13:14 reserved
	hif_dce_enable                  : 1;	//    15
} PE1_DCE_CTRL_06;

/*-----------------------------------------------------------------------------
	0x1404 pe1_dce_ctrl_07 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hif_dyc_wdata_y                 :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	hif_dyc_wdata_x                 :10;	// 16:25
} PE1_DCE_CTRL_07;

/*-----------------------------------------------------------------------------
	0x1408 pe1_dce_ctrl_08 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hif_dyc_wdata_y_32nd            :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	hif_dyc_wdata_x_32nd            :10;	// 16:25
} PE1_DCE_CTRL_08;

/*-----------------------------------------------------------------------------
	0x140c pe1_dce_ctrl_09 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hif_hist_address                : 6,	//  0: 5
	                                : 6,	//  6:11 reserved
	hif_hist_ai                     : 1,	//    12
	                                : 2,	// 13:14 reserved
	hif_hist_enable                 : 1,	//    15
	hif_status_address              : 3,	// 16:18
	                                : 9,	// 19:27 reserved
	hif_status_ai                   : 1,	//    28
	hif_mask                        : 1;	//    29
} PE1_DCE_CTRL_09;

/*-----------------------------------------------------------------------------
	0x1410 pe1_dce_ctrl_0a ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1414 pe1_dce_ctrl_0b ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1418 pe1_cen_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cr_apl_en1                      : 1,	//     0
	cr_apl_en2                      : 1,	//     1
	select_hsv                      : 1,	//     2
	select_rgb                      : 1,	//     3
	gb_apl_en                       : 1,	//     4
	vsp_sel                         : 1,	//     5
	global_apl_sel                  : 1,	//     6
	reg_cen_bypass                  : 1,	//     7
	reg_cen_debug_mode              : 1,	//     8
	debugging_mode_core             : 1,	//     9
	                                : 2,	// 10:11 reserved
	v_scaler_en                     : 1,	//    12
	                                : 3,	// 13:15 reserved
	demo_mode                       : 8;	// 16:23
} PE1_CEN_CTRL_00;

/*-----------------------------------------------------------------------------
	0x141c pe1_cen_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	show_color_region0              : 8,	//  0: 7
	show_color_region1              : 8,	//  8:15
	color_region_en0                : 8,	// 16:23
	color_region_en1                : 8;	// 24:31
} PE1_CEN_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1420 pe1_cen_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ihsv_sgain                      : 8,	//  0: 7
	ihsv_vgain                      : 8;	//  8:15
} PE1_CEN_CTRL_02;

/*-----------------------------------------------------------------------------
	0x1424 pe1_cen_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ihsv_hoffset                    : 8,	//  0: 7
	ihsv_soffset                    : 8,	//  8:15
	ihsv_voffset                    : 8;	// 16:23
} PE1_CEN_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1428 pe1_cen_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	den_ctrl0                       : 8,	//  0: 7
	den_apl_limit_high              : 8,	//  8:15
	den_gain                        : 8,	// 16:23
	den_coring                      : 8;	// 24:31
} PE1_CEN_CTRL_04;

/*-----------------------------------------------------------------------------
	0x142c pe1_cen_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hif_cen_address                 : 8,	//  0: 7
	hif_cen_ai_sel                  : 3,	//  8:10
	                                : 1,	//    11 reserved
	hif_cen_ai                      : 1,	//    12
	                                : 2,	// 13:14 reserved
	hif_cen_enable                  : 1;	//    15
} PE1_CEN_CTRL_05;

/*-----------------------------------------------------------------------------
	0x1430 pe1_cen_ctrl_06 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hif_cen_y_wdata                 :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	hif_cen_x_wdata                 :10;	// 16:25
} PE1_CEN_CTRL_06;

/*-----------------------------------------------------------------------------
	0x1434 wb_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_en                           : 1,	//     0
	apl_gain_bypass                 : 1,	//     1
	wb_user_ctrl_bypass             : 1,	//     2
	max_to_one_bypass               : 1,	//     3
	                                : 3,	//  4: 6 reserved
	use_apl_than_ctemp              : 1,	//     7
	user_ctemp                      : 8,	//  8:15
	ire_csc_offset                  :10,	// 16:25
	                                : 4,	// 26:29 reserved
	degamma_en                      : 1,	//    30
	gamma_en                        : 1;	//    31
} WB_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1438 wb_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ire_csc_g_coeff                 :10,	//  0: 9
	ire_csc_b_coeff                 :10,	// 10:19
	ire_csc_r_coeff                 :10;	// 20:29
} WB_CTRL_01;

/*-----------------------------------------------------------------------------
	0x143c wb_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	user_ctrl_g_gain                : 8,	//  0: 7
	user_ctrl_b_gain                : 8,	//  8:15
	user_ctrl_r_gain                : 8;	// 16:23
} WB_CTRL_02;

/*-----------------------------------------------------------------------------
	0x1440 wb_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	user_ctrl_g_offset              : 8,	//  0: 7
	user_ctrl_b_offset              : 8,	//  8:15
	user_ctrl_r_offset              : 8;	// 16:23
} WB_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1444 wb_ctrl_04 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x1448 wb_indir_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_indir_addr                   : 8,	//  0: 7
	                                : 4,	//  8:11 reserved
	wb_indir_ai_en                  : 1;	//    12
} WB_INDIR_CTRL;

/*-----------------------------------------------------------------------------
	0x144c wb_indir_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	wb_indir_data_g_gain            : 8,	//  0: 7
	wb_indir_data_b_gain            : 8,	//  8:15
	wb_indir_data_r_gain            : 8;	// 16:23
} WB_INDIR_DATA;

/*-----------------------------------------------------------------------------
	0x1458 pe1_gmc_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pxl_rep_xpos                    :11,	//  0:10
	                                : 1,	//    11 reserved
	lut_wmask_g                     : 1,	//    12
	lut_wmask_b                     : 1,	//    13
	lut_wmask_r                     : 1,	//    14
	                                : 1,	//    15 reserved
	pxl_rep_ypos                    :11,	// 16:26
	pxl_rep_area                    : 1,	//    27
	pxl_rep_disable_g               : 1,	//    28
	pxl_rep_disable_b               : 1,	//    29
	pxl_rep_disable_r               : 1,	//    30
	pxl_rep_enable                  : 1;	//    31
} PE1_GMC_CTRL_00;

/*-----------------------------------------------------------------------------
	0x145c pe1_gmc_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pxl_rep_width                   :11,	//  0:10
	                                : 5,	// 11:15 reserved
	pxl_rep_height                  :11;	// 16:26
} PE1_GMC_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1460 pe1_gmc_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pxl_rep_value_g                 :10,	//  0: 9
	pxl_rep_value_b                 :10,	// 10:19
	pxl_rep_value_r                 :10,	// 20:29
	gmc_mode                        : 2;	// 30:31
} PE1_GMC_CTRL_02;

/*-----------------------------------------------------------------------------
	0x1464 pe1_gmc_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	capture_addr                    :10,	//  0: 9
	                                : 2,	// 10:11 reserved
	capture_ai                      : 1,	//    12
	                                : 3,	// 13:15 reserved
	capture_num                     :11;	// 16:26
} PE1_GMC_CTRL;

/*-----------------------------------------------------------------------------
	0x1468 pe1_gmc_data ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	lut_data_g                      :10,	//  0: 9
	lut_data_b                      :10,	// 10:19
	lut_data_r                      :10,	// 20:29
	capture_stat_started            : 1,	//    30
	capture_stat_ended              : 1;	//    31
} PE1_GMC_DATA;

/*-----------------------------------------------------------------------------
	0x146c pe1_dither_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dither_en                       : 1,	//     0
	dcountour_en                    : 1,	//     1
	                                : 1,	//     2 reserved
	bit_mode_8                      : 1,	//     3
	                                : 4,	//  4: 7 reserved
	decontour_gain_r                : 8,	//  8:15
	decontour_gain_g                : 8,	// 16:23
	decontour_gain_b                : 8;	// 24:31
} PE1_DITHER_CTRL;

/*-----------------------------------------------------------------------------
	0x1470 pdpsp_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pdp_sp_detour                   : 1,	//     0
	pdp_sp_en                       : 1,	//     1
	                                : 1,	//     2 reserved
	grey_mask                       : 1,	//     3
	grey_mask_lev                   : 4,	//  4: 7
	max_offset                      : 3,	//  8:10
	use_hist_diff_sum               : 1,	//    11
	hist_diff_sum_cut               : 4,	// 12:15
	temp_delay                      :16;	// 16:31
} PDPSP_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1474 pdpsp_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	still_count_th                  :16,	//  0:15
	motion_measure_th               : 8,	// 16:23
	motion_iir_coeff                : 8;	// 24:31
} PDPSP_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1478 pdpsp_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	motion_value                    : 8,	//  0: 7
	                                : 8,	//  8:15 reserved
	always_shake                    : 1;	//    16
} PDPSP_CTRL_02;

/*-----------------------------------------------------------------------------
	0x147c pdpsp_status_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	still_count_value               :16,	//  0:15
	pdp_sp_fsm_state                : 2,	// 16:17
	                                : 6,	// 18:23 reserved
	motion_iir_value                : 8;	// 24:31
} PDPSP_STATUS_00;

/*-----------------------------------------------------------------------------
	0x1480 pe1_sqm_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	t_filter_weight                 : 8,	//  0: 7
	op_mode                         : 1,	//     8
	                                : 1,	//     9 reserved
	hdm_th                          :10,	// 10:19
	block_position_h                : 3,	// 20:22
	block_position_v                : 3;	// 23:25
} PE1_SQM_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1484 pe1_sqm_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pcm_th1                         :10,	//  0: 9
	pcm_th2                         :10,	// 10:19
	pcm_th3                         :10;	// 20:29
} PE1_SQM_CTRL_01;

/*-----------------------------------------------------------------------------
	0x1488 pe1_sqm_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	motion_th0                      : 8,	//  0: 7
	motion_th1                      : 8,	//  8:15
	blockness_th0                   : 8,	// 16:23
	blockness_th1                   : 8;	// 24:31
} PE1_SQM_CTRL_02;

/*-----------------------------------------------------------------------------
	0x148c pe1_sqm_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	motion                          : 8,	//  0: 7
	blockness                       : 8,	//  8:15
	min_weight                      : 8,	// 16:23
	max_weight                      : 8;	// 24:31
} PE1_SQM_CTRL_03;

/*-----------------------------------------------------------------------------
	0x1490 pe1_sqm_stat_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pdm                             :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	hcm                             :11;	// 16:26
} PE1_SQM_STAT_00;

/*-----------------------------------------------------------------------------
	0x1494 pe1_lsr_dtl_ee_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	extreme_enhancer_enable         : 1,	//     0
	                                : 7,	//  1: 7 reserved
	um1_enable                      : 1,	//     8
	um2_enable                      : 1,	//     9
	um3_enable                      : 1,	//    10
	um4_enable                      : 1,	//    11
	um1_filter_type                 : 1,	//    12
	um2_filter_type                 : 1,	//    13
	um3_filter_type                 : 1,	//    14
	um4_filter_type                 : 1,	//    15
	ee_gain_b                       : 4,	// 16:19
	ee_gain_w                       : 4;	// 20:23
} PE1_LSR_DTL_EE_CTRL_00;

/*-----------------------------------------------------------------------------
	0x1498 pe1_lsr_dtl_ee_ctrl_01 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	um1_gain_b                      : 4,	//  0: 3
	um1_gain_w                      : 4,	//  4: 7
	um2_gain_b                      : 4,	//  8:11
	um2_gain_w                      : 4,	// 12:15
	um3_gain_b                      : 4,	// 16:19
	um3_gain_w                      : 4,	// 20:23
	um4_gain_b                      : 4,	// 24:27
	um4_gain_w                      : 4;	// 28:31
} PE1_LSR_DTL_EE_CTRL_01;

/*-----------------------------------------------------------------------------
	0x149c pe1_lsr_dtl_ee_ctrl_02 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ee2_enable                      : 1,	//     0
	noise_freeze                    : 1,	//     1
	                                : 2,	//  2: 3 reserved
	noise_selection_gain            : 3,	//  4: 6
	                                : 1,	//     7 reserved
	noise_gain                      : 8,	//  8:15
	truncation_mode                 : 2,	// 16:17
	op_mode                         : 2,	// 18:19
	avg_filter                      : 1;	//    20
} PE1_LSR_DTL_EE_CTRL_02;

/*-----------------------------------------------------------------------------
	0x14a0 pe1_lsr_dtl_ee_ctrl_03 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	gain_balancing_on_off           : 1,	//     0
	                                : 3,	//  1: 3 reserved
	delta_axis_resolution           : 1,	//     4
	                                : 3,	//  5: 7 reserved
	ed_x1                           : 8,	//  8:15
	ed_x2                           : 8;	// 16:23
} PE1_LSR_DTL_EE_CTRL_03;

/*-----------------------------------------------------------------------------
	0x14a4 pe1_lsr_dtl_ee_ctrl_04 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ed_y1                           : 8,	//  0: 7
	ed_y2                           : 8,	//  8:15
	ed_y3                           : 8;	// 16:23
} PE1_LSR_DTL_EE_CTRL_04;

/*-----------------------------------------------------------------------------
	0x14a8 pe1_lsr_dtl_ee_ctrl_05 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ee2_black_gain                  : 8,	//  0: 7
	ee2_white_gain                  : 8,	//  8:15
	use_of_gt_in_ee2                : 1;	//    16
} PE1_LSR_DTL_EE_CTRL_05;

/*-----------------------------------------------------------------------------
	0x14ac pe1_vsp_ctrl_00 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	enable                          : 1,	//     0
	graycolor_enable                : 1,	//     1
	color_only_enable               : 1,	//     2
	                                : 5,	//  3: 7 reserved
	center_position                 : 8,	//  8:15
	contrast                        : 8,	// 16:23
	brightness                      : 8;	// 24:31
} PE1_VSP_CTRL_00;

/*-----------------------------------------------------------------------------
	0x14b0 pe1_sqm2_ctrl_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	outmux_debugmap                 : 4,	//  0: 3
	iir                             : 4,	//  4: 7
	i_score                         : 8,	//  8:15
	v_score                         : 8,	// 16:23
	l_score                         : 8;	// 24:31
} PE1_SQM2_CTRL_0;

/*-----------------------------------------------------------------------------
	0x14b4 pe1_sqm2_ctrl_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	v_limit                         : 8,	//  0: 7
	l_limit                         : 8,	//  8:15
	score_threshold                 : 8,	// 16:23
	flat_threshold                  : 8;	// 24:31
} PE1_SQM2_CTRL_1;

/*-----------------------------------------------------------------------------
	0x14b8 pe1_sqm2_ctrl_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	win_x0                          :11,	//  0:10
	                                : 5,	// 11:15 reserved
	win_y0                          :11;	// 16:26
} PE1_SQM2_CTRL_2;

/*-----------------------------------------------------------------------------
	0x14bc pe1_sqm2_ctrl_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	win_x1                          :11,	//  0:10
	                                : 5,	// 11:15 reserved
	win_y1                          :11;	// 16:26
} PE1_SQM2_CTRL_3;

/*-----------------------------------------------------------------------------
	0x14c0 pe1_sqm2_ctrl_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	charcter_delta_limit            : 8,	//  0: 7
	boundary_width                  : 8,	//  8:15
	video_height                    : 8;	// 16:23
} PE1_SQM2_CTRL_4;

/*-----------------------------------------------------------------------------
	0x14c4 pe1_sqm2_ctrl_5 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pc_threshold                    : 8,	//  0: 7
	pc_delta_limit                  : 8,	//  8:15
	pc_pixel_minimal_limit          : 8;	// 16:23
} PE1_SQM2_CTRL_5;

/*-----------------------------------------------------------------------------
	0x14c8 pe1_sqm2_stat ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x14cc pe1_bbd_ctrl_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	black_boundary_detection_enable : 1,	//     0
	hysterisis_mode                 : 3,	//  1: 3
	                                : 3,	//  4: 6 reserved
	mode_selection                  : 1,	//     7
	cnt_th                          : 8,	//  8:15
	diff_th                         : 8;	// 16:23
} PE1_BBD_CTRL_0;

/*-----------------------------------------------------------------------------
	0x14d0 pe1_bbd_ctrl_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bbd_x0                          :11,	//  0:10
	                                : 5,	// 11:15 reserved
	bbd_y0                          :11;	// 16:26
} PE1_BBD_CTRL_1;

/*-----------------------------------------------------------------------------
	0x14d4 pe1_bbd_ctrl_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bbd_x1                          :11,	//  0:10
	                                : 5,	// 11:15 reserved
	bbd_y1                          :11;	// 16:26
} PE1_BBD_CTRL_2;

/*-----------------------------------------------------------------------------
	0x14d8 pe1_bbd_stat_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x0                              :11,	//  0:10
	                                : 5,	// 11:15 reserved
	y0                              :11;	// 16:26
} PE1_BBD_STAT_0;

/*-----------------------------------------------------------------------------
	0x14dc pe1_bbd_stat_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	x1                              :11,	//  0:10
	                                : 5,	// 11:15 reserved
	y1                              :11;	// 16:26
} PE1_BBD_STAT_1;

/*-----------------------------------------------------------------------------
	0x14e0 pe1_ti_ctrl_0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	enable                          : 1,	//     0
	median_en                       : 1,	//     1
	                                :14,	//  2:15 reserved
	ti_gain                         : 8;	// 16:23
} PE1_TI_CTRL_0;

/*-----------------------------------------------------------------------------
	0x14e4 pe1_ti_ctrl_1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	enable                          : 1,	//     0
	median_en                       : 1,	//     1
	                                :14,	//  2:15 reserved
	y_gain                          : 8,	// 16:23
	c_gain                          : 8;	// 24:31
} PE1_TI_CTRL_1;

/*-----------------------------------------------------------------------------
	0x14e8 pe1_ti_ctrl_2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	enable                          : 1,	//     0
	median_en                       : 1,	//     1
	                                :14,	//  2:15 reserved
	y_gain                          : 8,	// 16:23
	c_gain                          : 8;	// 24:31
} PE1_TI_CTRL_2;

/*-----------------------------------------------------------------------------
	0x14ec pe1_ti_ctrl_3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	enable                          : 1,	//     0
	median_en                       : 1,	//     1
	                                :22,	//  2:23 reserved
	ti_gain                         : 8;	// 24:31
} PE1_TI_CTRL_3;

/*-----------------------------------------------------------------------------
	0x14f0 pe1_ti_ctrl_4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	enable                          : 1,	//     0
	median_en                       : 1,	//     1
	                                :22,	//  2:23 reserved
	ti_gain                         : 8;	// 24:31
} PE1_TI_CTRL_4;

typedef struct {
	PE1_TOP_CTRL_00                 	pe1_top_ctrl_00                 ;	// 0x1200 : ''
	PE1_TOP_CTRL_01                 	pe1_top_ctrl_01                 ;	// 0x1204 : ''
	PE1_TOP_CTRL_02                 	pe1_top_ctrl_02                 ;	// 0x1208 : ''
	PE1_TOP_CTRL_03                 	pe1_top_ctrl_03                 ;	// 0x120c : ''
	PE1_WIN_CTRL_00                 	pe1_win_ctrl_00                 ;	// 0x1210 : ''
	PE1_WIN_CTRL_01                 	pe1_win_ctrl_01                 ;	// 0x1214 : ''
	PE1_WIN_CTRL_02                 	pe1_win_ctrl_02                 ;	// 0x1218 : ''
	PE1_WIN_CTRL_03                 	pe1_win_ctrl_03                 ;	// 0x121c : ''
	PE1_WIN_CTRL_04                 	pe1_win_ctrl_04                 ;	// 0x1220 : ''
	UINT32                          	pe1_win_ctrl_05                 ;	// 0x1224 : ''
	PE1_APL_CTRL_00                 	pe1_apl_ctrl_00                 ;	// 0x1228 : ''
	PE1_APL_CTRL_01                 	pe1_apl_ctrl_01                 ;	// 0x122c : ''
	PE1_APL_CTRL_02                 	pe1_apl_ctrl_02                 ;	// 0x1230 : ''
	PE1_APL_CTRL_03                 	pe1_apl_ctrl_03                 ;	// 0x1234 : ''
	PE1_APL_CTRL_04                 	pe1_apl_ctrl_04                 ;	// 0x1238 : ''
	TPG_CTRL_00                     	tpg_ctrl_00                     ;	// 0x123c : ''
	TPG_CTRL_01                     	tpg_ctrl_01                     ;	// 0x1240 : ''
	TPG_CTRL_02                     	tpg_ctrl_02                     ;	// 0x1244 : ''
	TPG_INDIR_CTRL                  	tpg_indir_ctrl                  ;	// 0x1248 : ''
	TPG_INDIR_DATA                  	tpg_indir_data                  ;	// 0x124c : ''
	PE1_FILM_CTRL_00                	pe1_film_ctrl_00                ;	// 0x1250 : ''
	PE1_FILM_CTRL_01                	pe1_film_ctrl_01                ;	// 0x1254 : ''
	PE1_FILM_CTRL_02                	pe1_film_ctrl_02                ;	// 0x1258 : ''
	PE1_HFNR_CTRL_00                	pe1_hfnr_ctrl_00                ;	// 0x125c : ''
	PE1_HFNR_CTRL_01                	pe1_hfnr_ctrl_01                ;	// 0x1260 : ''
	PE1_LSR_CTRL_00                 	pe1_lsr_ctrl_00                 ;	// 0x1264 : ''
	PE1_LSR_CTRL_01                 	pe1_lsr_ctrl_01                 ;	// 0x1268 : ''
	PE1_LSR_CTRL_02                 	pe1_lsr_ctrl_02                 ;	// 0x126c : ''
	PE1_LSR_CTRL_03                 	pe1_lsr_ctrl_03                 ;	// 0x1270 : ''
	PE1_LSR_CTRL_04                 	pe1_lsr_ctrl_04                 ;	// 0x1274 : ''
	PE1_LSR_CTRL_05                 	pe1_lsr_ctrl_05                 ;	// 0x1278 : ''
	PE1_LSR_CTRL_06                 	pe1_lsr_ctrl_06                 ;	// 0x127c : ''
	PE1_LSR_CTRL_07                 	pe1_lsr_ctrl_07                 ;	// 0x1280 : ''
	PE1_LSR_CTRL_08                 	pe1_lsr_ctrl_08                 ;	// 0x1284 : ''
	PE1_LSR_CTRL_09                 	pe1_lsr_ctrl_09                 ;	// 0x1288 : ''
	PE1_LSR_DTL_CTRL_00             	pe1_lsr_dtl_ctrl_00             ;	// 0x128c : ''
	PE1_LSR_DTL_CTRL_01             	pe1_lsr_dtl_ctrl_01             ;	// 0x1290 : ''
	PE1_LSR_DTL_CTRL_02             	pe1_lsr_dtl_ctrl_02             ;	// 0x1294 : ''
	PE1_LSR_DTL_CTRL_03             	pe1_lsr_dtl_ctrl_03             ;	// 0x1298 : ''
	PE1_LSR_DTL_CTRL_04             	pe1_lsr_dtl_ctrl_04             ;	// 0x129c : ''
	PE1_LSR_DTL_CTRL_05             	pe1_lsr_dtl_ctrl_05             ;	// 0x12a0 : ''
	PE1_LSR_DTL_CTRL_06             	pe1_lsr_dtl_ctrl_06             ;	// 0x12a4 : ''
	PE1_LSR_DTL_CTRL_07             	pe1_lsr_dtl_ctrl_07             ;	// 0x12a8 : ''
	PE1_LSR_DTL_CTRL_08             	pe1_lsr_dtl_ctrl_08             ;	// 0x12ac : ''
	PE1_LSR_DTL_CTRL_09             	pe1_lsr_dtl_ctrl_09             ;	// 0x12b0 : ''
	PE1_LSR_DTL_CTRL_0A             	pe1_lsr_dtl_ctrl_0a             ;	// 0x12b4 : ''
	PE1_LSR_DTL_CTRL_0B             	pe1_lsr_dtl_ctrl_0b             ;	// 0x12b8 : ''
	PE1_LSR_DTL_CTRL_0C             	pe1_lsr_dtl_ctrl_0c             ;	// 0x12bc : ''
	PE1_LSR_DTL_CTRL_0D             	pe1_lsr_dtl_ctrl_0d             ;	// 0x12c0 : ''
	PE1_LSR_GT_CTRL_00              	pe1_lsr_gt_ctrl_00              ;	// 0x12c4 : ''
	PE1_LSR_GT_CTRL_01              	pe1_lsr_gt_ctrl_01              ;	// 0x12c8 : ''
	PE1_LSR_GT_CTRL_02              	pe1_lsr_gt_ctrl_02              ;	// 0x12cc : ''
	PE1_LSR_GT_CTRL_03              	pe1_lsr_gt_ctrl_03              ;	// 0x12d0 : ''
	PE1_LSR_GT_CTRL_04              	pe1_lsr_gt_ctrl_04              ;	// 0x12d4 : ''
	PE1_LSR_GT_CTRL_05              	pe1_lsr_gt_ctrl_05              ;	// 0x12d8 : ''
	PE1_LSR_GT_CTRL_06              	pe1_lsr_gt_ctrl_06              ;	// 0x12dc : ''
	PE1_LSR_SCA_CTRL_00             	pe1_lsr_sca_ctrl_00             ;	// 0x12e0 : ''
	PE1_LSR_SCA_CTRL_01             	pe1_lsr_sca_ctrl_01             ;	// 0x12e4 : ''
	PE1_LSR_SCA_CTRL_02             	pe1_lsr_sca_ctrl_02             ;	// 0x12e8 : ''
	PE1_LSR_SCA_CTRL_03             	pe1_lsr_sca_ctrl_03             ;	// 0x12ec : ''
	PE1_LSR_SCA_CTRL_04             	pe1_lsr_sca_ctrl_04             ;	// 0x12f0 : ''
	PE1_LSR_SCA_CTRL_05             	pe1_lsr_sca_ctrl_05             ;	// 0x12f4 : ''
	PE1_LSR_SCA_CTRL_06             	pe1_lsr_sca_ctrl_06             ;	// 0x12f8 : ''
	PE1_LSR_SCA_CTRL_07             	pe1_lsr_sca_ctrl_07             ;	// 0x12fc : ''
	PE1_LSR_SCA_CTRL_08             	pe1_lsr_sca_ctrl_08             ;	// 0x1300 : ''
	PE1_LSR_SCA_CTRL_09             	pe1_lsr_sca_ctrl_09             ;	// 0x1304 : ''
	PE1_LSR_SCA_CTRL_0A             	pe1_lsr_sca_ctrl_0a             ;	// 0x1308 : ''
	PE1_LSR_SCA_CTRL_0B             	pe1_lsr_sca_ctrl_0b             ;	// 0x130c : ''
	PE1_LSR_SCA_CTRL_0C             	pe1_lsr_sca_ctrl_0c             ;	// 0x1310 : ''
	PE1_LSR_CRG_CTRL_00             	pe1_lsr_crg_ctrl_00             ;	// 0x1314 : ''
	PE1_LSR_CRG_CTRL_01             	pe1_lsr_crg_ctrl_01             ;	// 0x1318 : ''
	PE1_SHP_EDGE_CTRL_00            	pe1_shp_edge_ctrl_00            ;	// 0x131c : ''
	PE1_SHP_EDGE_CTRL_01            	pe1_shp_edge_ctrl_01            ;	// 0x1320 : ''
	PE1_SHP_EDGE_CTRL_02            	pe1_shp_edge_ctrl_02            ;	// 0x1324 : ''
	PE1_SHP_EDGE_CTRL_03            	pe1_shp_edge_ctrl_03            ;	// 0x1328 : ''
	PE1_SHP_EDGE_CTRL_04            	pe1_shp_edge_ctrl_04            ;	// 0x132c : ''
	PE1_SHP_CTI_CTRL_00             	pe1_shp_cti_ctrl_00             ;	// 0x1330 : ''
	UINT32                          	pe1_shp_cti_ctrl_01             ;	// 0x1334 : ''
	PE1_SHP_DTL_00                  	pe1_shp_dtl_00                  ;	// 0x1338 : ''
	PE1_SHP_DTL_01                  	pe1_shp_dtl_01                  ;	// 0x133c : ''
	PE1_SHP_DTL_02                  	pe1_shp_dtl_02                  ;	// 0x1340 : ''
	PE1_SHP_DTL_03                  	pe1_shp_dtl_03                  ;	// 0x1344 : ''
	PE1_SHP_DTL_04                  	pe1_shp_dtl_04                  ;	// 0x1348 : ''
	PE1_SHP_DTL_05                  	pe1_shp_dtl_05                  ;	// 0x134c : ''
	PE1_SHP_DTL_06                  	pe1_shp_dtl_06                  ;	// 0x1350 : ''
	PE1_SHP_DTL_07                  	pe1_shp_dtl_07                  ;	// 0x1354 : ''
	PE1_SHP_DTL_08                  	pe1_shp_dtl_08                  ;	// 0x1358 : ''
	PE1_SHP_DTL_09                  	pe1_shp_dtl_09                  ;	// 0x135c : ''
	PE1_SHP_DTL_0A                  	pe1_shp_dtl_0a                  ;	// 0x1360 : ''
	PE1_SHP_DTL_0B                  	pe1_shp_dtl_0b                  ;	// 0x1364 : ''
	PE1_SHP_DTL_0C                  	pe1_shp_dtl_0c                  ;	// 0x1368 : ''
	PE1_SHP_DTL_0D                  	pe1_shp_dtl_0d                  ;	// 0x136c : ''
	PE1_SHP_SUM_CTRL                	pe1_shp_sum_ctrl                ;	// 0x1370 : ''
	PE1_SHP_SCA_CTRL_00             	pe1_shp_sca_ctrl_00             ;	// 0x1374 : ''
	PE1_SHP_SCA_CTRL_01             	pe1_shp_sca_ctrl_01             ;	// 0x1378 : ''
	PE1_SHP_SCA_CTRL_02             	pe1_shp_sca_ctrl_02             ;	// 0x137c : ''
	PE1_SHP_SCA_CTRL_03             	pe1_shp_sca_ctrl_03             ;	// 0x1380 : ''
	PE1_SHP_SCA_CTRL_04             	pe1_shp_sca_ctrl_04             ;	// 0x1384 : ''
	PE1_SHP_SCA_CTRL_05             	pe1_shp_sca_ctrl_05             ;	// 0x1388 : ''
	PE1_SHP_SCA_CTRL_06             	pe1_shp_sca_ctrl_06             ;	// 0x138c : ''
	PE1_SHP_SCA_CTRL_07             	pe1_shp_sca_ctrl_07             ;	// 0x1390 : ''
	PE1_SHP_SCA_CTRL_08             	pe1_shp_sca_ctrl_08             ;	// 0x1394 : ''
	PE1_SHP_SCA_CTRL_09             	pe1_shp_sca_ctrl_09             ;	// 0x1398 : ''
	PE1_SHP_SCA_CTRL_0A             	pe1_shp_sca_ctrl_0a             ;	// 0x139c : ''
	PE1_SHP_SCA_CTRL_0B             	pe1_shp_sca_ctrl_0b             ;	// 0x13a0 : ''
	PE1_SHP_SCA_CTRL_0C             	pe1_shp_sca_ctrl_0c             ;	// 0x13a4 : ''
	PE1_SHP_CRG_CTRL_00             	pe1_shp_crg_ctrl_00             ;	// 0x13a8 : ''
	PE1_SHP_CRG_CTRL_01             	pe1_shp_crg_ctrl_01             ;	// 0x13ac : ''
	PE1_XVY_CTRL_00                 	pe1_xvy_ctrl_00                 ;	// 0x13b0 : ''
	PE1_XVY_CTRL_01                 	pe1_xvy_ctrl_01                 ;	// 0x13b4 : ''
	PE1_XVY_CTRL_02                 	pe1_xvy_ctrl_02                 ;	// 0x13b8 : ''
	PE1_XVY_CTRL_03                 	pe1_xvy_ctrl_03                 ;	// 0x13bc : ''
	PE1_XVY_CTRL_04                 	pe1_xvy_ctrl_04                 ;	// 0x13c0 : ''
	PE1_XVY_CTRL_05                 	pe1_xvy_ctrl_05                 ;	// 0x13c4 : ''
	PE1_XVY_CTRL_06                 	pe1_xvy_ctrl_06                 ;	// 0x13c8 : ''
	PE1_XVY_CTRL_07                 	pe1_xvy_ctrl_07                 ;	// 0x13cc : ''
	PE1_XVY_CTRL_08                 	pe1_xvy_ctrl_08                 ;	// 0x13d0 : ''
	PE1_XVY_CTRL_09                 	pe1_xvy_ctrl_09                 ;	// 0x13d4 : ''
	PE1_XVY_CTRL_0A                 	pe1_xvy_ctrl_0a                 ;	// 0x13d8 : ''
	PE1_XVY_CTRL_0B                 	pe1_xvy_ctrl_0b                 ;	// 0x13dc : ''
	PE1_XVY_CTRL_0C                 	pe1_xvy_ctrl_0c                 ;	// 0x13e0 : ''
	PE1_XVY_CTRL_0D                 	pe1_xvy_ctrl_0d                 ;	// 0x13e4 : ''
	PE1_DCE_CTRL_00                 	pe1_dce_ctrl_00                 ;	// 0x13e8 : ''
	PE1_DCE_CTRL_01                 	pe1_dce_ctrl_01                 ;	// 0x13ec : ''
	UINT32                          	                 __rsvd_00[4]   ;	// 0x13f0 ~ 0x13fc
	PE1_DCE_CTRL_06                 	pe1_dce_ctrl_06                 ;	// 0x1400 : ''
	PE1_DCE_CTRL_07                 	pe1_dce_ctrl_07                 ;	// 0x1404 : ''
	PE1_DCE_CTRL_08                 	pe1_dce_ctrl_08                 ;	// 0x1408 : ''
	PE1_DCE_CTRL_09                 	pe1_dce_ctrl_09                 ;	// 0x140c : ''
	UINT32                          	pe1_dce_ctrl_0a                 ;	// 0x1410 : ''
	UINT32                          	pe1_dce_ctrl_0b                 ;	// 0x1414 : ''
	PE1_CEN_CTRL_00                 	pe1_cen_ctrl_00                 ;	// 0x1418 : ''
	PE1_CEN_CTRL_01                 	pe1_cen_ctrl_01                 ;	// 0x141c : ''
	PE1_CEN_CTRL_02                 	pe1_cen_ctrl_02                 ;	// 0x1420 : ''
	PE1_CEN_CTRL_03                 	pe1_cen_ctrl_03                 ;	// 0x1424 : ''
	PE1_CEN_CTRL_04                 	pe1_cen_ctrl_04                 ;	// 0x1428 : ''
	PE1_CEN_CTRL_05                 	pe1_cen_ctrl_05                 ;	// 0x142c : ''
	PE1_CEN_CTRL_06                 	pe1_cen_ctrl_06                 ;	// 0x1430 : ''
	WB_CTRL_00                      	wb_ctrl_00                      ;	// 0x1434 : ''
	WB_CTRL_01                      	wb_ctrl_01                      ;	// 0x1438 : ''
	WB_CTRL_02                      	wb_ctrl_02                      ;	// 0x143c : ''
	WB_CTRL_03                      	wb_ctrl_03                      ;	// 0x1440 : ''
	UINT32                          	wb_ctrl_04                      ;	// 0x1444 : ''
	WB_INDIR_CTRL                   	wb_indir_ctrl                   ;	// 0x1448 : ''
	WB_INDIR_DATA                   	wb_indir_data                   ;	// 0x144c : ''
	UINT32                          	                 __rsvd_01[   2];	// 0x1450 ~ 0x1454
	PE1_GMC_CTRL_00                 	pe1_gmc_ctrl_00                 ;	// 0x1458 : ''
	PE1_GMC_CTRL_01                 	pe1_gmc_ctrl_01                 ;	// 0x145c : ''
	PE1_GMC_CTRL_02                 	pe1_gmc_ctrl_02                 ;	// 0x1460 : ''
	PE1_GMC_CTRL                    	pe1_gmc_ctrl                    ;	// 0x1464 : ''
	PE1_GMC_DATA                    	pe1_gmc_data                    ;	// 0x1468 : ''
	PE1_DITHER_CTRL                 	pe1_dither_ctrl                 ;	// 0x146c : ''
	PDPSP_CTRL_00                   	pdpsp_ctrl_00                   ;	// 0x1470 : ''
	PDPSP_CTRL_01                   	pdpsp_ctrl_01                   ;	// 0x1474 : ''
	PDPSP_CTRL_02                   	pdpsp_ctrl_02                   ;	// 0x1478 : ''
	PDPSP_STATUS_00                 	pdpsp_status_00                 ;	// 0x147c : ''
	PE1_SQM_CTRL_00                 	pe1_sqm_ctrl_00                 ;	// 0x1480 : ''
	PE1_SQM_CTRL_01                 	pe1_sqm_ctrl_01                 ;	// 0x1484 : ''
	PE1_SQM_CTRL_02                 	pe1_sqm_ctrl_02                 ;	// 0x1488 : ''
	PE1_SQM_CTRL_03                 	pe1_sqm_ctrl_03                 ;	// 0x148c : ''
	PE1_SQM_STAT_00                 	pe1_sqm_stat_00                 ;	// 0x1490 : ''
	PE1_LSR_DTL_EE_CTRL_00          	pe1_lsr_dtl_ee_ctrl_00          ;	// 0x1494 : ''
	PE1_LSR_DTL_EE_CTRL_01          	pe1_lsr_dtl_ee_ctrl_01          ;	// 0x1498 : ''
	PE1_LSR_DTL_EE_CTRL_02          	pe1_lsr_dtl_ee_ctrl_02          ;	// 0x149c : ''
	PE1_LSR_DTL_EE_CTRL_03          	pe1_lsr_dtl_ee_ctrl_03          ;	// 0x14a0 : ''
	PE1_LSR_DTL_EE_CTRL_04          	pe1_lsr_dtl_ee_ctrl_04          ;	// 0x14a4 : ''
	PE1_LSR_DTL_EE_CTRL_05          	pe1_lsr_dtl_ee_ctrl_05          ;	// 0x14a8 : ''
	PE1_VSP_CTRL_00                 	pe1_vsp_ctrl_00                 ;	// 0x14ac : ''
	PE1_SQM2_CTRL_0                 	pe1_sqm2_ctrl_0                 ;	// 0x14b0 : ''
	PE1_SQM2_CTRL_1                 	pe1_sqm2_ctrl_1                 ;	// 0x14b4 : ''
	PE1_SQM2_CTRL_2                 	pe1_sqm2_ctrl_2                 ;	// 0x14b8 : ''
	PE1_SQM2_CTRL_3                 	pe1_sqm2_ctrl_3                 ;	// 0x14bc : ''
	PE1_SQM2_CTRL_4                 	pe1_sqm2_ctrl_4                 ;	// 0x14c0 : ''
	PE1_SQM2_CTRL_5                 	pe1_sqm2_ctrl_5                 ;	// 0x14c4 : ''
	UINT32                          	pe1_sqm2_stat                   ;	// 0x14c8 : ''
	PE1_BBD_CTRL_0                  	pe1_bbd_ctrl_0                  ;	// 0x14cc : ''
	PE1_BBD_CTRL_1                  	pe1_bbd_ctrl_1                  ;	// 0x14d0 : ''
	PE1_BBD_CTRL_2                  	pe1_bbd_ctrl_2                  ;	// 0x14d4 : ''
	PE1_BBD_STAT_0                  	pe1_bbd_stat_0                  ;	// 0x14d8 : ''
	PE1_BBD_STAT_1                  	pe1_bbd_stat_1                  ;	// 0x14dc : ''
	PE1_TI_CTRL_0                   	pe1_ti_ctrl_0                   ;	// 0x14e0 : ''
	PE1_TI_CTRL_1                   	pe1_ti_ctrl_1                   ;	// 0x14e4 : ''
	PE1_TI_CTRL_2                   	pe1_ti_ctrl_2                   ;	// 0x14e8 : ''
	PE1_TI_CTRL_3                   	pe1_ti_ctrl_3                   ;	// 0x14ec : ''
	PE1_TI_CTRL_4                   	pe1_ti_ctrl_4                   ;	// 0x14f0 : ''
} PE1_REG_T;
/* 188 regs, 188 types */

/* 188 regs, 188 types in Total*/

/*
 * @{
 * Naming for register pointer.
 * gpRealRegPE1 : real register of PE1.
 * gpRegPE1     : shadow register.
 *
 * @def PE1_RdFL: Read  FLushing : Shadow <- Real.
 * @def PE1_WrFL: Write FLushing : Shadow -> Real.
 * @def PE1_Rd  : Read  whole register(UINT32) from Shadow register.
 * @def PE1_Wr  : Write whole register(UINT32) from Shadow register.
 * @def PE1_Rd01 ~ PE1_Rdnn: Read  given '01~nn' fields from Shadow register.
 * @def PE1_Wr01 ~ PE1_Wrnn: Write given '01~nn' fields to   Shadow register.
 * */
#define PE1_RdFL(_r)			((gpRegPE1->_r)=(gpRealRegPE1->_r))
#define PE1_WrFL(_r)			((gpRealRegPE1->_r)=(gpRegPE1->_r))

#define PE1_Rd(_r)			*((UINT32*)(&(gpRegPE1->_r)))
#define PE1_Wr(_r,_v)			((PE1_Rd(_r))=((UINT32)(_v)))

#define PE1_Rd01(_r,_f01,_v01)													\
								do { 											\
