/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2010 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 

/*-----------------------------------------------------------------------------
	0x0900 ssc_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	bnd_pel_filtering_scheme        : 1,	//     0
	fir_config                      : 1,	//     1
	filter_type_sel                 : 1,	//     2
	fir_coef_table_sel              : 1,	//     3
	size_info_manual_load           : 1,	//     4
	ddr_update_endian_change        : 1;	//     5
} SSC_CTRL;

/*-----------------------------------------------------------------------------
	0x0904 ssc_field ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	interlace_mode                  : 1,	//     0
	curr_field                      : 1,	//     1
	mpeg_stream                     : 1;	//     2
} SSC_FIELD;

/*-----------------------------------------------------------------------------
	0x0908 ssc_y_init_pos_h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_init_pos_h                    :12;	//  0:11
} SSC_Y_INIT_POS_H;

/*-----------------------------------------------------------------------------
	0x090c ssc_y_init_pos_v ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_init_pos_v                    :12;	//  0:11
} SSC_Y_INIT_POS_V;

/*-----------------------------------------------------------------------------
	0x0910 ssc_c_init_pos_h ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	c_init_pos_h                    :12;	//  0:11
} SSC_C_INIT_POS_H;

/*-----------------------------------------------------------------------------
	0x0914 ssc_c_init_pos_v ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	c_init_pos_v                    :12;	//  0:11
} SSC_C_INIT_POS_V;

/*-----------------------------------------------------------------------------
	0x0918 ssc_scr_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	input_h_size                    :11,	//  0:10
	                                : 5,	// 11:15 reserved
	input_v_size                    :11;	// 16:26
} SSC_SCR_SIZE;

/*-----------------------------------------------------------------------------
	0x091c ssc_win_out_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	out_win_h_size                  :11,	//  0:10
	                                : 5,	// 11:15 reserved
	out_win_v_size                  :11;	// 16:26
} SSC_WIN_OUT_SIZE;

/*-----------------------------------------------------------------------------
	0x0920 ssc_win_in_offset ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	in_win_h_offset                 :11,	//  0:10
	                                : 5,	// 11:15 reserved
	in_win_v_offset                 :11;	// 16:26
} SSC_WIN_IN_OFFSET;

/*-----------------------------------------------------------------------------
	0x0924 ssc_win_in_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	in_win_h_size                   :11,	//  0:10
	                                : 5,	// 11:15 reserved
	in_win_v_size                   :11;	// 16:26
} SSC_WIN_IN_SIZE;

/*-----------------------------------------------------------------------------
	0x0928 ssc_c_format ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	in_c_format                     : 3,	//  0: 2
	                                :13,	//  3:15 reserved
	out_c_format                    : 3;	// 16:18
} SSC_C_FORMAT;

/*-----------------------------------------------------------------------------
	0x0930 ssc_y_fir_coef_data0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_coefficient0                  :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	y_coefficient1                  :10;	// 16:25
} SSC_Y_FIR_COEF_DATA0;

/*-----------------------------------------------------------------------------
	0x0934 ssc_y_fir_coef_data1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_coefficient2                  :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	y_coefficient3                  :10;	// 16:25
} SSC_Y_FIR_COEF_DATA1;

/*-----------------------------------------------------------------------------
	0x0938 ssc_y_fir_coef_data2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_coefficient4                  :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	y_coefficient5                  :10;	// 16:25
} SSC_Y_FIR_COEF_DATA2;

/*-----------------------------------------------------------------------------
	0x093c ssc_y_fir_coef_data3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_coefficient6                  :10,	//  0: 9
	                                : 6,	// 10:15 reserved
	y_coefficient7                  :10;	// 16:25
} SSC_Y_FIR_COEF_DATA3;

/*-----------------------------------------------------------------------------
	0x0940 ssc_y_fir_coef_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	addr                            : 4,	//  0: 3
	h_v_sel                         : 1,	//     4
	                                : 3,	//  5: 7 reserved
	update                          : 1,	//     8
	                                : 3,	//  9:11 reserved
	rnw                             : 1;	//    12
} SSC_Y_FIR_COEF_CTRL;

/*-----------------------------------------------------------------------------
	0x0944 ssc_update_from_ddr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ddr_stride                      :11,	//  0:10
	                                : 5,	// 11:15 reserved
	ddr_line_cnt                    : 8,	// 16:23
	                                : 7,	// 24:30 reserved
	ddr_update_on                   : 1;	//    31
} SSC_UPDATE_FROM_DDR;

/*-----------------------------------------------------------------------------
	0x0968 ssc_status_rev ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	y_status                        :11,	//  0:10
	                                : 5,	// 11:15 reserved
	c_status                        :11;	// 16:26
} SSC_STATUS_REV;

/*-----------------------------------------------------------------------------
	0x096c ssc_manual_load ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	update_input_frm_size           : 1,	//     0
	                                : 3,	//  1: 3 reserved
	update_wout_size                : 1,	//     4
	                                : 3,	//  5: 7 reserved
	update_win_offset               : 1,	//     8
	                                : 3,	//  9:11 reserved
	update_win_size                 : 1;	//    12
} SSC_MANUAL_LOAD;

typedef struct {
	SSC_CTRL                        	ssc_ctrl                        ;	// 0x0900 : ''
	SSC_FIELD                       	ssc_field                       ;	// 0x0904 : ''
	SSC_Y_INIT_POS_H                	ssc_y_init_pos_h                ;	// 0x0908 : ''
	SSC_Y_INIT_POS_V                	ssc_y_init_pos_v                ;	// 0x090c : ''
	SSC_C_INIT_POS_H                	ssc_c_init_pos_h                ;	// 0x0910 : ''
	SSC_C_INIT_POS_V                	ssc_c_init_pos_v                ;	// 0x0914 : ''
	SSC_SCR_SIZE                    	ssc_scr_size                    ;	// 0x0918 : ''
	SSC_WIN_OUT_SIZE                	ssc_win_out_size                ;	// 0x091c : ''
	SSC_WIN_IN_OFFSET               	ssc_win_in_offset               ;	// 0x0920 : ''
	SSC_WIN_IN_SIZE                 	ssc_win_in_size                 ;	// 0x0924 : ''
	SSC_C_FORMAT                    	ssc_c_format                    ;	// 0x0928 : ''
	UINT32                          	                 __rsvd_00[   1];	// 0x092c
	SSC_Y_FIR_COEF_DATA0            	ssc_y_fir_coef_data0            ;	// 0x0930 : ''
	SSC_Y_FIR_COEF_DATA1            	ssc_y_fir_coef_data1            ;	// 0x0934 : ''
	SSC_Y_FIR_COEF_DATA2            	ssc_y_fir_coef_data2            ;	// 0x0938 : ''
	SSC_Y_FIR_COEF_DATA3            	ssc_y_fir_coef_data3            ;	// 0x093c : ''
	SSC_Y_FIR_COEF_CTRL             	ssc_y_fir_coef_ctrl             ;	// 0x0940 : ''
	SSC_UPDATE_FROM_DDR             	ssc_update_from_ddr             ;	// 0x0944 : ''
	UINT32                          	                 __rsvd_01[   8];	// 0x0948 ~ 0x0964
	SSC_STATUS_REV                  	ssc_status_rev                  ;	// 0x0968 : ''
	SSC_MANUAL_LOAD                 	ssc_manual_load                 ;	// 0x096c : ''
} SSC_REG_T;
/* 19 regs, 19 types */

/* 19 regs, 19 types in Total*/

/*
 * @{
 * Naming for register pointer.
 * gpRealRegSSC : real register of SSC.
 * gpRegSSC     : shadow register.
 *
 * @def SSC_RdFL: Read  FLushing : Shadow <- Real.
 * @def SSC_WrFL: Write FLushing : Shadow -> Real.
 * @def SSC_Rd  : Read  whole register(UINT32) from Shadow register.
 * @def SSC_Wr  : Write whole register(UINT32) from Shadow register.
 * @def SSC_Rd01 ~ SSC_Rdnn: Read  given '01~nn' fields from Shadow register.
 * @def SSC_Wr01 ~ SSC_Wrnn: Write given '01~nn' fields to   Shadow register.
 * */
#define SSC_RdFL(_r)			((gpRegSSC->_r)=(gpRealRegSSC->_r))
#define SSC_WrFL(_r)			((gpRealRegSSC->_r)=(gpRegSSC->_r))

#define SSC_Rd(_r)			*((UINT32*)(&(gpRegSSC->_r)))
#define SSC_Wr(_r,_v)			((SSC_Rd(_r))=((UINT32)(_v)))

#define SSC_Rd01(_r,_f01,_v01)													\
								do { 											\
