/*
	SIC LABORATORY, LG ELECTRONICS INC., SEOUL, KOREA
	Copyright(c) 2010 by LG Electronics Inc.

	This program is free software; you can redistribute it and/or 
	modify it under the terms of the GNU General Public License
	version 2 as published by the Free Software Foundation.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of 
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
	GNU General Public License for more details.
*/ 

/*-----------------------------------------------------------------------------
	0x0000 cha_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cha_hsize                       :11,	//  0:10
	                                : 2,	// 11:12 reserved
	cha_csample                     : 1,	//    13
	cha_aspect                      : 1,	//    14
	                                : 1,	//    15 reserved
	cha_vsize                       :12,	// 16:27
	                                : 1,	//    28 reserved
	cha_frame_lr                    : 1,	//    29
	cha_field_id                    : 1,	//    30
	cha_pr_sq                       : 1;	//    31
} CHA_INFO;

/*-----------------------------------------------------------------------------
	0x0004 chb_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	chb_hsize                       :11,	//  0:10
	                                : 2,	// 11:12 reserved
	chb_csample                     : 1,	//    13
	chb_aspect                      : 1,	//    14
	                                : 1,	//    15 reserved
	chb_vsize                       :12,	// 16:27
	                                : 1,	//    28 reserved
	chb_frame_lr                    : 1,	//    29
	chb_field_id                    : 1,	//    30
	chb_pr_sq                       : 1;	//    31
} CHB_INFO;

/*-----------------------------------------------------------------------------
	0x0008 pic_init ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g0                     : 1,	//     0
	pic_init_g1                     : 1,	//     1
	pic_init_g2                     : 1,	//     2
	pic_init_g3                     : 1;	//     3
} DE0A_PIC_INIT;

/*-----------------------------------------------------------------------------
	0x000c pic_start ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_start_g0                    : 1,	//     0
	pic_start_g1                    : 1,	//     1
	pic_start_g2                    : 1,	//     2
	pic_start_g3                    : 1;	//     3
} DE0A_PIC_START;

/*-----------------------------------------------------------------------------
	0x0010 field_check_pt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	chb_field_pt                    :12,	//  0:11
	                                : 4,	// 12:15 reserved
	cha_field_pt                    :12;	// 16:27
} FIELD_CHECK_PT;

/*-----------------------------------------------------------------------------
	0x0014 src_mux_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                : 4,	//  0: 3 reserved
	sub_i_c_fmt                     : 3,	//  4: 6
	                                : 1,	//     7 reserved
	main_o_c_fmt                    : 3,	//  8:10
	                                : 1,	//    11 reserved
	main_i_c_fmt                    : 3,	// 12:14
	                                : 1,	//    15 reserved
	enb_aa                          : 1,	//    16
	conv10to8                       : 1,	//    17
	                                : 2,	// 18:19 reserved
	main_out_ctrl                   : 2,	// 20:21
	msc_ddr_update_mode             : 1,	//    22
	enb_3d_in_mode                  : 1,	//    23
	mif_wr_ctrl                     : 2,	// 24:25
	ch_sel3d                        : 1,	//    26
	enb_3d_mode                     : 2,	// 27:28
	enb_3d                          : 1,	//    29
	fieldid                         : 1,	//    30
	pr_sq                           : 1;	//    31
} SRC_MUX_CTRL;

/*-----------------------------------------------------------------------------
	0x0018 src_mux_size ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hsize                           :11,	//  0:10
	                                : 5,	// 11:15 reserved
	vsize                           :12;	// 16:27
} SRC_MUX_SIZE;

/*-----------------------------------------------------------------------------
	0x001c msrc_sync_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	sync_pos                        :28,	//  0:27
	                                : 1,	//    28 reserved
	cvi_select                      : 1,	//    29
	mvi_select                      : 1,	//    30
	mvi_cvi_select                  : 1;	//    31
} MSRC_SYNC_CTRL;

/*-----------------------------------------------------------------------------
	0x0020 dco_mfc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dco_mfc                         :28;	//  0:27
} DCO_MFC;

/*-----------------------------------------------------------------------------
	0x0024 dco_dfc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dco_dfc                         :28;	//  0:27
} DCO_DFC;

/*-----------------------------------------------------------------------------
	0x0028 dco_dflc ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dco_dflc                        :12;	//  0:11
} DCO_DFLC;

/*-----------------------------------------------------------------------------
	0x002c dco_fcw ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	dco_fcw                         :22;	//  0:21
} DCO_FCW;

/*-----------------------------------------------------------------------------
	0x0030 smux_ro_lcnt ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	smux_ro_lcnt                    :12;	//  0:11
} SMUX_RO_LCNT;

/*-----------------------------------------------------------------------------
	0x0034 gmau_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ask_cmd_dly_cnt                 : 8,	//  0: 7
	                                : 8,	//  8:15 reserved
	ask_to_cnt                      :10;	// 16:25
} DE0A_GMAU_CTRL;

/*-----------------------------------------------------------------------------
	0x0038 pic_init_g0_timer ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g0_timer               :28,	//  0:27
	mif_end_g0                      : 1;	//    28
} DE0A_PIC_INIT_G0_TIMER;

/*-----------------------------------------------------------------------------
	0x003c pic_init_g1_timer ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g1_timer               :28,	//  0:27
	mif_end_g1_wd                   : 1,	//    28
	mif_end_g1_rd                   : 1;	//    29
} DE0A_PIC_INIT_G1_TIMER;

/*-----------------------------------------------------------------------------
	0x0040 pic_init_g2_timer ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g2_timer               :28,	//  0:27
	mif_end_tnr_c                   : 1,	//    28
	mif_end_tnr_y                   : 1;	//    29
} DE0A_PIC_INIT_G2_TIMER;

/*-----------------------------------------------------------------------------
	0x0044 pic_init_g3_timer ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g3_timer               :28;	//  0:27
} DE0A_PIC_INIT_G3_TIMER;

/*-----------------------------------------------------------------------------
	0x0048 pic_end_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_end_g0                      : 4,	//  0: 3
	pic_end_g1                      : 6,	//  4: 9
	pic_end_g2                      : 9,	// 10:18
	pic_end_g3                      : 3;	// 19:21
} DE0A_PIC_END_INFO;

/*-----------------------------------------------------------------------------
	0x004c de0a_intr_reg ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	intr_end_g0                     : 1,	//     0
	                                : 3,	//  1: 3 reserved
	intr_end_g1                     : 1,	//     4
	                                : 3,	//  5: 7 reserved
	intr_end_g2                     : 1,	//     8
	                                : 3,	//  9:11 reserved
	intr_end_g3                     : 1,	//    12
	                                : 3,	// 13:15 reserved
	cha_input_intr                  : 1,	//    16
	                                : 3,	// 17:19 reserved
	chb_input_intr                  : 1,	//    20
	pe0_intr                        : 1,	//    21
	smux_ow_intr                    : 1,	//    22
	msrc_intr                       : 1,	//    23
	cha_field_intr                  : 1,	//    24
	cha_frame_lr_intr               : 1,	//    25
	chb_field_intr                  : 1,	//    26
	chb_frame_lr_intr               : 1;	//    27
} DE0A_INTR_REG;

/*-----------------------------------------------------------------------------
	0x0050 de0a_intr_mask ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de0a_intr_mask                  :28;	//  0:27
} DE0A_INTR_MASK;

/*-----------------------------------------------------------------------------
	0x0054 de0a_intr_mux ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de0a_intr_mux                   :28;	//  0:27
} DE0A_INTR_MUX;

/*-----------------------------------------------------------------------------
	0x0058 msrc_intr_time_stp ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x005c de_gpio_mux ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de_gpio_mux                     : 1;	//     0
} DE_GPIO_MUX;

/*-----------------------------------------------------------------------------
	0x0060 de_version ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0000 pic_init ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g0                     : 1,	//     0
	pic_init_g1                     : 1,	//     1
	pic_init_g2                     : 1;	//     2
} DE0B_PIC_INIT;

/*-----------------------------------------------------------------------------
	0x0004 pic_start ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_start_g0                    : 1,	//     0
	pic_start_g1                    : 1,	//     1
	pic_start_g2                    : 1;	//     2
} DE0B_PIC_START;

/*-----------------------------------------------------------------------------
	0x0008 cvm_isize ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cvm_ihsize                      :11,	//  0:10
	                                : 5,	// 11:15 reserved
	cvm_ivsize                      :11;	// 16:26
} CVM_ISIZE;

/*-----------------------------------------------------------------------------
	0x000c cvm_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cvm_ohsize                      :11,	//  0:10
	                                : 6,	// 11:16 reserved
	en_anti                         : 1,	//    17
	o_c_fmt                         : 3,	// 18:20
	i_c_fmt                         : 3,	// 21:23
	ecanvas                         : 1;	//    24
} CVM_CTRL;

/*-----------------------------------------------------------------------------
	0x0010 cvm_hdn_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	c_phase_off                     :12,	//  0:11
	c_bnd_mode                      : 1,	//    12
	                                : 3,	// 13:15 reserved
	y_phase_off                     :12,	// 16:27
	y_bnd_mode                      : 1;	//    28
} CVM_HDN_CTRL;

/*-----------------------------------------------------------------------------
	0x0014 cvm_hdn_coeff ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	coeff1                          :10,	//  0: 9
	coeff0                          :10,	// 10:19
	rw                              : 1,	//    20
	                                : 3,	// 21:23 reserved
	coeff_index                     : 6;	// 24:29
} CVM_HDN_COEFF;

/*-----------------------------------------------------------------------------
	0x0018 mdm_isize ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mdm_ihsize                      :11,	//  0:10
	                                : 5,	// 11:15 reserved
	mdm_ivsize                      :11;	// 16:26
} MDM_ISIZE;

/*-----------------------------------------------------------------------------
	0x001c mdm_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mdm_ohsize                      :11,	//  0:10
	                                : 6,	// 11:16 reserved
	en_anti                         : 1,	//    17
	o_c_fmt                         : 3,	// 18:20
	i_c_fmt                         : 3,	// 21:23
	csc_en                          : 1;	//    24
} MDM_CTRL;

/*-----------------------------------------------------------------------------
	0x0020 mdm_csc_coef0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mdm_csc_coef1                   :15,	//  0:14
	                                : 1,	//    15 reserved
	mdm_csc_coef0                   :15;	// 16:30
} MDM_CSC_COEF0;

/*-----------------------------------------------------------------------------
	0x0024 mdm_csc_coef1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mdm_csc_coef3                   :15,	//  0:14
	                                : 1,	//    15 reserved
	mdm_csc_coef2                   :15;	// 16:30
} MDM_CSC_COEF1;

/*-----------------------------------------------------------------------------
	0x0028 mdm_csc_coef2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mdm_csc_coef5                   :15,	//  0:14
	                                : 1,	//    15 reserved
	mdm_csc_coef4                   :15;	// 16:30
} MDM_CSC_COEF2;

/*-----------------------------------------------------------------------------
	0x002c mdm_csc_coef3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mdm_csc_coef7                   :15,	//  0:14
	                                : 1,	//    15 reserved
	mdm_csc_coef6                   :15;	// 16:30
} MDM_CSC_COEF3;

/*-----------------------------------------------------------------------------
	0x0030 mdm_csc_coef4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	                                :16,	//  0:15 reserved
	mdm_csc_coef4                   :15;	// 16:30
} MDM_CSC_COEF4;

/*-----------------------------------------------------------------------------
	0x0034 mdm_csc_offset0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mdm_csc_ofst1                   :11,	//  0:10
	                                : 5,	// 11:15 reserved
	mdm_csc_ofst0                   :11;	// 16:26
} MDM_CSC_OFFSET0;

/*-----------------------------------------------------------------------------
	0x0038 mdm_csc_offset1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mdm_csc_ofst3                   :11,	//  0:10
	                                : 5,	// 11:15 reserved
	mdm_csc_ofst2                   :11;	// 16:26
} MDM_CSC_OFFSET1;

/*-----------------------------------------------------------------------------
	0x003c mdm_csc_offset2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mdm_csc_ofst5                   :11,	//  0:10
	                                : 5,	// 11:15 reserved
	mdm_csc_ofst4                   :11;	// 16:26
} MDM_CSC_OFFSET2;

/*-----------------------------------------------------------------------------
	0x0040 mdm_hdn_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	c_phase_off                     :12,	//  0:11
	c_bnd_mode                      : 1,	//    12
	                                : 3,	// 13:15 reserved
	y_phase_off                     :12,	// 16:27
	y_bnd_mode                      : 1;	//    28
} MDM_HDN_CTRL;

/*-----------------------------------------------------------------------------
	0x0044 mdm_hdn_coeff ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	coeff1                          :10,	//  0: 9
	coeff0                          :10,	// 10:19
	rw                              : 1,	//    20
	                                : 3,	// 21:23 reserved
	coeff_index                     : 6;	// 24:29
} MDM_HDN_COEFF;

/*-----------------------------------------------------------------------------
	0x0048 cvmd_status ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	mdm_ro_lcnt                     :11,	//  0:10
	                                : 5,	// 11:15 reserved
	cvm_ro_lcnt                     :11;	// 16:26
} CVMD_STATUS;

/*-----------------------------------------------------------------------------
	0x004c ssrc0_sync_pos ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ssrc0_sync_pos                  :28;	//  0:27
} SSRC0_SYNC_POS;

/*-----------------------------------------------------------------------------
	0x0050 ssrc1_sync_pos ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ssrc1_sync_pos                  :28;	//  0:27
} SSRC1_SYNC_POS;

/*-----------------------------------------------------------------------------
	0x0054 sync_mux_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vdec_sync_gen_mode              : 1,	//     0
	vdec_sync_gen_pr_sq             : 1,	//     1
	cvi_pulse_mux                   : 1,	//     2
	ssrc1_sync_mux                  : 2,	//  3: 4
	ssrc0_sync_mux                  : 2;	//  5: 6
} SYNC_MUX_CTRL;

/*-----------------------------------------------------------------------------
	0x0058 vdec_sync_field0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vdec_sync_field0                :28,	//  0:27
	update_mode                     : 1;	//    28
} VDEC_SYNC_FIELD0;

/*-----------------------------------------------------------------------------
	0x005c vdec_sync_field1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vdec_sync_field1                :28,	//  0:27
	update_mode                     : 1;	//    28
} VDEC_SYNC_FIELD1;

/*-----------------------------------------------------------------------------
	0x0060 cpu_sync_frame ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cpu_sync_frame                  :28,	//  0:27
	update_mode                     : 1;	//    28
} CPU_SYNC_FRAME;

/*-----------------------------------------------------------------------------
	0x0064 gmau_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ask_cmd_dly_cnt                 : 8,	//  0: 7
	                                : 8,	//  8:15 reserved
	ask_to_cnt                      :10;	// 16:25
} DE0B_GMAU_CTRL;

/*-----------------------------------------------------------------------------
	0x0068 pic_init_g0_timer ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g0_timer               :28;	//  0:27
} DE0B_PIC_INIT_G0_TIMER;

/*-----------------------------------------------------------------------------
	0x006c pic_init_g1_timer ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g1_timer               :28;	//  0:27
} DE0B_PIC_INIT_G1_TIMER;

/*-----------------------------------------------------------------------------
	0x0070 pic_init_g2_timer ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g2_timer               :28;	//  0:27
} DE0B_PIC_INIT_G2_TIMER;

/*-----------------------------------------------------------------------------
	0x0074 pic_end_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_end_g0_info                 : 3,	//  0: 2
	pic_end_g1_info                 : 3,	//  3: 5
	pic_end_g2_info                 : 5;	//  6:10
} DE0B_PIC_END_INFO;

/*-----------------------------------------------------------------------------
	0x0078 de0b_intr_reg ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	intr_end_g0                     : 1,	//     0
	                                : 3,	//  1: 3 reserved
	intr_end_g1                     : 1,	//     4
	                                : 3,	//  5: 7 reserved
	intr_end_g2                     : 1,	//     8
	                                : 2,	//  9:10 reserved
	cvm_if_ow_intr                  : 1,	//    11
	mdm_if_ow_intr                  : 1,	//    12
	ssrc0_intr                      : 1,	//    13
	ssrc1_intr                      : 1;	//    14
} DE0B_INTR_REG;

/*-----------------------------------------------------------------------------
	0x007c de0b_intr_mask ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0080 de0b_intr_mux ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0084 ssrc_intr_time_stp0 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0088 ssrc_intr_time_stp1 ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x008c de_func_intr ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de0a_intr_mcu                   : 1,	//     0
	de0b_intr_mcu                   : 1,	//     1
	de1a_intr_mcu                   : 1,	//     2
	de1b_intr_mcu                   : 1,	//     3
	de0a_intr_cpu                   : 1,	//     4
	de0b_intr_cpu                   : 1,	//     5
	de1a_intr_cpu                   : 1,	//     6
	de1b_intr_cpu                   : 1;	//     7
} DE_FUNC_INTR;

/*-----------------------------------------------------------------------------
	0x0090 de_vdec_if ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vsync_vdec                      : 1,	//     0
	                                : 3,	//  1: 3 reserved
	vdec_sel                        : 1;	//     4
} DE_VDEC_IF;

/*-----------------------------------------------------------------------------
	0x0000 pic_init ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g0                     : 1,	//     0
	pic_init_g1                     : 1,	//     1
	                                :14,	//  2:15 reserved
	auto_pic_init                   : 1;	//    16
} DE1A_PIC_INIT;

/*-----------------------------------------------------------------------------
	0x0004 pic_start ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_start_g0                    : 1,	//     0
	pic_start_g1                    : 1;	//     1
} DE1A_PIC_START;

/*-----------------------------------------------------------------------------
	0x0008 disp_param0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vsync_bp                        : 8,	//  0: 7
	vsync                           : 8,	//  8:15
	vsync_fp                        : 8,	// 16:23
	sync_polarity                   : 1,	//    24
	                                : 2,	// 25:26 reserved
	update_mode                     : 1;	//    27
} DISP_PARAM0;

/*-----------------------------------------------------------------------------
	0x000c disp_param1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hsync_bp                        : 8,	//  0: 7
	hsync                           : 8,	//  8:15
	hsync_fp                        :10,	// 16:25
	sync_polarity                   : 1,	//    26
	update_mode                     : 1;	//    27
} DISP_PARAM1;

/*-----------------------------------------------------------------------------
	0x0010 disp_param2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	hofst0                          :12,	//  0:11
	hofst1                          :12,	// 12:23
	vofst1                          : 7,	// 24:30
	update_mode                     : 1;	//    31
} DISP_PARAM2;

/*-----------------------------------------------------------------------------
	0x0014 disp_param3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	disp_sync_ha                    :11,	//  0:10
	                                : 5,	// 11:15 reserved
	disp_sync_va                    :12,	// 16:27
	disp_frame_lr_3d_tv             : 1,	//    28
	update_mode                     : 1;	//    29
} DISP_PARAM3;

/*-----------------------------------------------------------------------------
	0x0018 disp_intr_pos ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	disp_intr_pos                   :28;	//  0:27
} DISP_INTR_POS;

/*-----------------------------------------------------------------------------
	0x001c gmau_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ask_cmd_dly_cnt                 : 8,	//  0: 7
	                                : 8,	//  8:15 reserved
	ask_to_cnt                      :10;	// 16:25
} DE1A_GMAU_CTRL;

/*-----------------------------------------------------------------------------
	0x0020 pic_init_g0_timer ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g0_timer               :28;	//  0:27
} DE1A_PIC_INIT_G0_TIMER;

/*-----------------------------------------------------------------------------
	0x0024 pic_init_g1_timer ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g1_timer               :28;	//  0:27
} DE1A_PIC_INIT_G1_TIMER;

/*-----------------------------------------------------------------------------
	0x0028 pic_end_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_end_g0                      : 5,	//  0: 4
	pic_end_g1                      : 1;	//     5
} DE1A_PIC_END_INFO;

/*-----------------------------------------------------------------------------
	0x002c de1a_intr_reg ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	intr_end_g0                     : 1,	//     0
	                                : 1,	//     1 reserved
	disp_intr_for_cpu               : 1,	//     2
	                                : 1,	//     3 reserved
	intr_end_g1                     : 1,	//     4
	                                : 1,	//     5 reserved
	disp_intr_for_mcu               : 1,	//     6
	ov_underflow                    : 1;	//     7
} DE1A_INTR_REG;

/*-----------------------------------------------------------------------------
	0x0030 de1a_intr_mask ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de1a_intr_mask                  : 8;	//  0: 7
} DE1A_INTR_MASK;

/*-----------------------------------------------------------------------------
	0x0034 de1a_intr_mux ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de1a_intr_mux                   : 8;	//  0: 7
} DE1A_INTR_MUX;

/*-----------------------------------------------------------------------------
	0x0038 disp_intr_time_stp ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x003c de_pwm_r0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm0_r_h                        :11,	//  0:10
	                                : 5,	// 11:15 reserved
	pwm0_r_v                        :11;	// 16:26
} DE_PWM_R0;

/*-----------------------------------------------------------------------------
	0x0040 de_pwm_f0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm0_r_h                        :11,	//  0:10
	                                : 5,	// 11:15 reserved
	pwm0_f_v                        :11;	// 16:26
} DE_PWM_F0;

/*-----------------------------------------------------------------------------
	0x0044 de_pwm_r1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm1_r_h                        :11,	//  0:10
	                                : 5,	// 11:15 reserved
	pwm1_r_v                        :11;	// 16:26
} DE_PWM_R1;

/*-----------------------------------------------------------------------------
	0x0048 de_pwm_f1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm1_r_h                        :11,	//  0:10
	                                : 5,	// 11:15 reserved
	pwm1_f_v                        :11;	// 16:26
} DE_PWM_F1;

/*-----------------------------------------------------------------------------
	0x004c de_pwm_r2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm2_r_h                        :11,	//  0:10
	                                : 5,	// 11:15 reserved
	pwm2_r_v                        :11;	// 16:26
} DE_PWM_R2;

/*-----------------------------------------------------------------------------
	0x0050 de_pwm_f2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm2_r_h                        :11,	//  0:10
	                                : 5,	// 11:15 reserved
	pwm2_f_v                        :11;	// 16:26
} DE_PWM_F2;

/*-----------------------------------------------------------------------------
	0x0054 de_pwm_r3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm3_r_h                        :11,	//  0:10
	                                : 5,	// 11:15 reserved
	pwm3_r_v                        :11;	// 16:26
} DE_PWM_R3;

/*-----------------------------------------------------------------------------
	0x0058 de_pwm_f3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm3_f_h                        :11,	//  0:10
	                                : 5,	// 11:15 reserved
	pwm3_f_v                        :11;	// 16:26
} DE_PWM_F3;

/*-----------------------------------------------------------------------------
	0x005c de_pwm_r4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm4_r_h                        :11,	//  0:10
	                                : 5,	// 11:15 reserved
	pwm4_r_v                        :11;	// 16:26
} DE_PWM_R4;

/*-----------------------------------------------------------------------------
	0x0060 de_pwm_f4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm4_f_h                        :11,	//  0:10
	                                : 5,	// 11:15 reserved
	pwm4_f_v                        :11;	// 16:26
} DE_PWM_F4;

/*-----------------------------------------------------------------------------
	0x0064 de_pwm_sub_r0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de_pwm_sub_r0                   :11;	//  0:10
} DE_PWM_SUB_R0;

/*-----------------------------------------------------------------------------
	0x0068 de_pwm_sub_r1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de_pwm_sub_r1                   :11;	//  0:10
} DE_PWM_SUB_R1;

/*-----------------------------------------------------------------------------
	0x006c de_pwm_sub_r2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de_pwm_sub_r2                   :11;	//  0:10
} DE_PWM_SUB_R2;

/*-----------------------------------------------------------------------------
	0x0070 de_pwm_sub_r3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de_pwm_sub_r3                   :11;	//  0:10
} DE_PWM_SUB_R3;

/*-----------------------------------------------------------------------------
	0x0074 de_pwm_sub_r4 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de_pwm_sub_r4                   :11;	//  0:10
} DE_PWM_SUB_R4;

/*-----------------------------------------------------------------------------
	0x0078 de_pwm_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pwm_inv                         : 5,	//  0: 4
	pwm_fc_l                        : 5,	//  5: 9
	pwm_fc_h                        : 5;	// 10:14
} DE_PWM_CTRL;

/*-----------------------------------------------------------------------------
	0x007c de_pwm_sel ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de_pwm_sel                      : 5;	//  0: 4
} DE_PWM_SEL;

/*-----------------------------------------------------------------------------
	0x0000 pic_init ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g0                     : 1,	//     0
	pic_init_g1                     : 1,	//     1
	                                :14,	//  2:15 reserved
	auto_pic_init_osd               : 1,	//    16
	                                : 7,	// 17:23 reserved
	auto_pic_init_cve               : 1;	//    24
} DE1B_PIC_INIT;

/*-----------------------------------------------------------------------------
	0x0004 pic_start ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_start_g0                    : 1,	//     0
	pic_start_g1                    : 1;	//     1
} DE1B_PIC_START;

/*-----------------------------------------------------------------------------
	0x0008 fb_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	fb_ctrl                         : 2;	//  0: 1
} FB_CTRL;

/*-----------------------------------------------------------------------------
	0x000c cve_param0 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vertical_back_porch             : 8,	//  0: 7
	vertical_sync                   : 8,	//  8:15
	vertical_front_porch            : 8,	// 16:23
	sync_polarity                   : 1;	//    24
} CVE_PARAM0;

/*-----------------------------------------------------------------------------
	0x0010 cve_param1 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	horizontal_back_porch           : 8,	//  0: 7
	horizontal_sync                 : 8,	//  8:15
	horizontal_front_porch          : 8,	// 16:23
	sync_polarity                   : 1;	//    24
} CVE_PARAM1;

/*-----------------------------------------------------------------------------
	0x0014 cve_param2 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	v_hoffset1                      :11,	//  0:10
	v_hoffset0                      :11,	// 11:21
	                                : 2,	// 22:23 reserved
	field_id_polarity               : 1;	//    24
} CVE_PARAM2;

/*-----------------------------------------------------------------------------
	0x0018 cve_param3 ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cve_sync_ha                     :11,	//  0:10
	                                : 5,	// 11:15 reserved
	cve_sync_va                     :11;	// 16:26
} CVE_PARAM3;

/*-----------------------------------------------------------------------------
	0x001c cve_intr_pos ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	cve_intr_pos                    :28;	//  0:27
} CVE_INTR_POS;

/*-----------------------------------------------------------------------------
	0x0020 gmau_ctrl ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	ask_cmd_dly_cnt                 : 8,	//  0: 7
	                                : 8,	//  8:15 reserved
	ask_to_cnt                      :10;	// 16:25
} DE1B_GMAU_CTRL;

/*-----------------------------------------------------------------------------
	0x0024 pic_init_g0_timer ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g0_timer               :28;	//  0:27
} DE1B_PIC_INIT_G0_TIMER;

/*-----------------------------------------------------------------------------
	0x0028 pic_init_g1_timer ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_init_g1_timer               :28;	//  0:27
} DE1B_PIC_INIT_G1_TIMER;

/*-----------------------------------------------------------------------------
	0x002c pic_end_info ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	pic_end_g0                      : 3,	//  0: 2
	pic_end_g1                      : 5;	//  3: 7
} DE1B_PIC_END_INFO;

/*-----------------------------------------------------------------------------
	0x0030 de1b_intr_reg ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	intr_end_g0                     : 1,	//     0
	                                : 3,	//  1: 3 reserved
	intr_end_g1                     : 1,	//     4
	                                : 1,	//     5 reserved
	cve_va_intr                     : 1,	//     6
	                                : 1,	//     7 reserved
	cve_intr                        : 1;	//     8
} DE1B_INTR_REG;

/*-----------------------------------------------------------------------------
	0x0034 de1b_intr_mask ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de1b_intr_mask                  : 9;	//  0: 8
} DE1B_INTR_MASK;

/*-----------------------------------------------------------------------------
	0x0038 de1b_intr_mux ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	de1b_intr_mux                   : 9;	//  0: 8
} DE1B_INTR_MUX;

/*-----------------------------------------------------------------------------
	0x003c cve_intr_time_stp ''
------------------------------------------------------------------------------*/
/*	no field */

/*-----------------------------------------------------------------------------
	0x0040 de_venc_if ''
------------------------------------------------------------------------------*/
typedef struct {
	UINT32
	vsync_venc                      : 1,	//     0
	                                : 3,	//  1: 3 reserved
	venc_sel                        : 1;	//     4
} DE_VENC_IF;

typedef struct {
	CHA_INFO                        	cha_info                        ;	// 0x0000 : ''
	CHB_INFO                        	chb_info                        ;	// 0x0004 : ''
	DE0A_PIC_INIT                       de0a_pic_init                   ;	// 0x0008 : ''
	DE0A_PIC_START                      de0a_pic_start                  ;	// 0x000c : ''
	FIELD_CHECK_PT                  	field_check_pt                  ;	// 0x0010 : ''
	SRC_MUX_CTRL                    	src_mux_ctrl                    ;	// 0x0014 : ''
	SRC_MUX_SIZE                    	src_mux_size                    ;	// 0x0018 : ''
	MSRC_SYNC_CTRL                  	msrc_sync_ctrl                  ;	// 0x001c : ''
	DCO_MFC                         	dco_mfc                         ;	// 0x0020 : ''
	DCO_DFC                         	dco_dfc                         ;	// 0x0024 : ''
	DCO_DFLC                        	dco_dflc                        ;	// 0x0028 : ''
	DCO_FCW                         	dco_fcw                         ;	// 0x002c : ''
	SMUX_RO_LCNT                    	smux_ro_lcnt                    ;	// 0x0030 : ''
	DE0A_GMAU_CTRL                      de0a_gmau_ctrl                  ;	// 0x0034 : ''
    DE0A_PIC_INIT_G0_TIMER              de0a_pic_init_g0_timer          ;	// 0x0038 : ''
    DE0A_PIC_INIT_G1_TIMER              de0a_pic_init_g1_timer          ;	// 0x003c : ''
    DE0A_PIC_INIT_G2_TIMER              de0a_pic_init_g2_timer          ;	// 0x0040 : ''
    DE0A_PIC_INIT_G3_TIMER              de0a_pic_init_g3_timer          ;	// 0x0044 : ''
	DE0A_PIC_END_INFO                   de0a_pic_end_info               ;	// 0x0048 : ''
	DE0A_INTR_REG                   	de0a_intr_reg                   ;	// 0x004c : ''
	DE0A_INTR_MASK                  	de0a_intr_mask                  ;	// 0x0050 : ''
	DE0A_INTR_MUX                   	de0a_intr_mux                   ;	// 0x0054 : ''
	UINT32                          	msrc_intr_time_stp              ;	// 0x0058 : ''
	DE_GPIO_MUX                     	de_gpio_mux                     ;	// 0x005c : ''
	UINT32                          	de_version                      ;	// 0x0060 : ''
} DE0A_CTRL_REG_T;
/* 25 regs, 25 types */

typedef struct {
	DE0B_PIC_INIT                       de0b_pic_init                   ;	// 0x0800 : ''
	DE0B_PIC_START                      de0b_pic_start                  ;	// 0x0804 : ''
	CVM_ISIZE                       	cvm_isize                       ;	// 0x0808 : ''
	CVM_CTRL                        	cvm_ctrl                        ;	// 0x080c : ''
	CVM_HDN_CTRL                    	cvm_hdn_ctrl                    ;	// 0x0810 : ''
	CVM_HDN_COEFF                   	cvm_hdn_coeff                   ;	// 0x0814 : ''
	MDM_ISIZE                       	mdm_isize                       ;	// 0x0818 : ''
	MDM_CTRL                        	mdm_ctrl                        ;	// 0x081c : ''
	MDM_CSC_COEF0                   	mdm_csc_coef0                   ;	// 0x0820 : ''
	MDM_CSC_COEF1                   	mdm_csc_coef1                   ;	// 0x0824 : ''
	MDM_CSC_COEF2                   	mdm_csc_coef2                   ;	// 0x0828 : ''
	MDM_CSC_COEF3                   	mdm_csc_coef3                   ;	// 0x082c : ''
	MDM_CSC_COEF4                   	mdm_csc_coef4                   ;	// 0x0830 : ''
	MDM_CSC_OFFSET0                 	mdm_csc_offset0                 ;	// 0x0834 : ''
	MDM_CSC_OFFSET1                 	mdm_csc_offset1                 ;	// 0x0838 : ''
	MDM_CSC_OFFSET2                 	mdm_csc_offset2                 ;	// 0x083c : ''
	MDM_HDN_CTRL                    	mdm_hdn_ctrl                    ;	// 0x0840 : ''
	MDM_HDN_COEFF                   	mdm_hdn_coeff                   ;	// 0x0844 : ''
	CVMD_STATUS                     	cvmd_status                     ;	// 0x0848 : ''
	SSRC0_SYNC_POS                  	ssrc0_sync_pos                  ;	// 0x084c : ''
	SSRC1_SYNC_POS                  	ssrc1_sync_pos                  ;	// 0x0850 : ''
	SYNC_MUX_CTRL                   	sync_mux_ctrl                   ;	// 0x0854 : ''
	VDEC_SYNC_FIELD0                	vdec_sync_field0                ;	// 0x0858 : ''
	VDEC_SYNC_FIELD1                	vdec_sync_field1                ;	// 0x085c : ''
	CPU_SYNC_FRAME                  	cpu_sync_frame                  ;	// 0x0860 : ''
	DE0B_GMAU_CTRL                      de0b_gmau_ctrl                  ;	// 0x0864 : ''
	DE0B_PIC_INIT_G0_TIMER              de0b_pic_init_g0_timer          ;	// 0x0868 : ''
	DE0B_PIC_INIT_G1_TIMER              de0b_pic_init_g1_timer          ;	// 0x086c : ''
	DE0B_PIC_INIT_G2_TIMER              de0b_pic_init_g2_timer          ;	// 0x0870 : ''
	DE0B_PIC_END_INFO                   de0b_pic_end_info               ;	// 0x0874 : ''
	DE0B_INTR_REG                   	de0b_intr_reg                   ;	// 0x0878 : ''
	UINT32                          	de0b_intr_mask                  ;	// 0x087c : ''
	UINT32                          	de0b_intr_mux                   ;	// 0x0880 : ''
	UINT32                          	ssrc_intr_time_stp0             ;	// 0x0884 : ''
	UINT32                          	ssrc_intr_time_stp1             ;	// 0x0888 : ''
	DE_FUNC_INTR                    	de_func_intr                    ;	// 0x088c : ''
	DE_VDEC_IF                      	de_vdec_if                      ;	// 0x0890 : ''
} DE0B_CTRL_REG_T;
/* 37 regs, 37 types */

typedef struct {
	DE1A_PIC_INIT                       de1a_pic_init                   ;	// 0x1000 : ''
	DE1A_PIC_START                      de1a_pic_start                  ;	// 0x1004 : ''
	DISP_PARAM0                     	disp_param0                     ;	// 0x1008 : ''
	DISP_PARAM1                     	disp_param1                     ;	// 0x100c : ''
	DISP_PARAM2                     	disp_param2                     ;	// 0x1010 : ''
	DISP_PARAM3                     	disp_param3                     ;	// 0x1014 : ''
	DISP_INTR_POS                   	disp_intr_pos                   ;	// 0x1018 : ''
	DE1A_GMAU_CTRL                      de1a_gmau_ctrl                  ;	// 0x101c : ''
	DE1A_PIC_INIT_G0_TIMER              de1a_pic_init_g0_timer          ;	// 0x1020 : ''
	DE1A_PIC_INIT_G1_TIMER              de1a_pic_init_g1_timer          ;	// 0x1024 : ''
	DE1A_PIC_END_INFO                   de1a_pic_end_info               ;	// 0x1028 : ''
	DE1A_INTR_REG                   	de1a_intr_reg                   ;	// 0x102c : ''
	DE1A_INTR_MASK                  	de1a_intr_mask                  ;	// 0x1030 : ''
	DE1A_INTR_MUX                   	de1a_intr_mux                   ;	// 0x1034 : ''
	UINT32                          	disp_intr_time_stp              ;	// 0x1038 : ''
	DE_PWM_R0                       	de_pwm_r0                       ;	// 0x103c : ''
	DE_PWM_F0                       	de_pwm_f0                       ;	// 0x1040 : ''
	DE_PWM_R1                       	de_pwm_r1                       ;	// 0x1044 : ''
	DE_PWM_F1                       	de_pwm_f1                       ;	// 0x1048 : ''
	DE_PWM_R2                       	de_pwm_r2                       ;	// 0x104c : ''
	DE_PWM_F2                       	de_pwm_f2                       ;	// 0x1050 : ''
	DE_PWM_R3                       	de_pwm_r3                       ;	// 0x1054 : ''
	DE_PWM_F3                       	de_pwm_f3                       ;	// 0x1058 : ''
	DE_PWM_R4                       	de_pwm_r4                       ;	// 0x105c : ''
	DE_PWM_F4                       	de_pwm_f4                       ;	// 0x1060 : ''
	DE_PWM_SUB_R0                   	de_pwm_sub_r0                   ;	// 0x1064 : ''
	DE_PWM_SUB_R1                   	de_pwm_sub_r1                   ;	// 0x1068 : ''
	DE_PWM_SUB_R2                   	de_pwm_sub_r2                   ;	// 0x106c : ''
	DE_PWM_SUB_R3                   	de_pwm_sub_r3                   ;	// 0x1070 : ''
	DE_PWM_SUB_R4                   	de_pwm_sub_r4                   ;	// 0x1074 : ''
	DE_PWM_CTRL                     	de_pwm_ctrl                     ;	// 0x1078 : ''
	DE_PWM_SEL                      	de_pwm_sel                      ;	// 0x107c : ''
} DE1A_CTRL_REG_T;
/* 32 regs, 32 types */

typedef struct {
	DE1B_PIC_INIT                       de1b_pic_init                   ;	// 0x1800 : ''
	DE1B_PIC_START                      de1b_pic_start                  ;	// 0x1804 : ''
	FB_CTRL                         	fb_ctrl                         ;	// 0x1808 : ''
	CVE_PARAM0                      	cve_param0                      ;	// 0x180c : ''
	CVE_PARAM1                      	cve_param1                      ;	// 0x1810 : ''
	CVE_PARAM2                      	cve_param2                      ;	// 0x1814 : ''
	CVE_PARAM3                      	cve_param3                      ;	// 0x1818 : ''
	CVE_INTR_POS                    	cve_intr_pos                    ;	// 0x181c : ''
	DE1B_GMAU_CTRL                      de1b_gmau_ctrl                  ;	// 0x1820 : ''
    DE1B_PIC_INIT_G0_TIMER              de1b_pic_init_g0_timer          ;	// 0x1824 : ''
    DE1B_PIC_INIT_G1_TIMER              de1b_pic_init_g1_timer          ;	// 0x1828 : ''
    DE1B_PIC_END_INFO                   de1b_pic_end_info               ;	// 0x182c : ''
	DE1B_INTR_REG                   	de1b_intr_reg                   ;	// 0x1830 : ''
	DE1B_INTR_MASK                  	de1b_intr_mask                  ;	// 0x1834 : ''
	DE1B_INTR_MUX                   	de1b_intr_mux                   ;	// 0x1838 : ''
	UINT32                          	cve_intr_time_stp               ;	// 0x183c : ''
	DE_VENC_IF                      	de_venc_if                      ;	// 0x1840 : ''
} DE1B_CTRL_REG_T;
/* 17 regs, 17 types */

/* 111 regs, 111 types in Total*/

/*
 * @{
 * Naming for register pointer.
 * gpRealRegDE0A_CTRL : real register of DE0A_CTRL.
 * gpRegDE0A_CTRL     : shadow register.
 *
 * @def DE0A_CTRL_RdFL: Read  FLushing : Shadow <- Real.
 * @def DE0A_CTRL_WrFL: Write FLushing : Shadow -> Real.
 * @def DE0A_CTRL_Rd  : Read  whole register(UINT32) from Shadow register.
 * @def DE0A_CTRL_Wr  : Write whole register(UINT32) from Shadow register.
 * @def DE0A_CTRL_Rd01 ~ DE0A_CTRL_Rdnn: Read  given '01~nn' fields from Shadow register.
 * @def DE0A_CTRL_Wr01 ~ DE0A_CTRL_Wrnn: Write given '01~nn' fields to   Shadow register.
 * */
#define DE0A_CTRL_RdFL(_r)			((gpRegDE0A_CTRL->_r)=(gpRealRegDE0A_CTRL->_r))
#define DE0A_CTRL_WrFL(_r)			((gpRealRegDE0A_CTRL->_r)=(gpRegDE0A_CTRL->_r))

#define DE0A_CTRL_Rd(_r)			*((UINT32*)(&(gpRegDE0A_CTRL->_r)))
